{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Arcane Thrower","displayname":"Arcane Thrower","class":"Fighter","level":{"3":[{"featuretext":"Returning Weapon\n\nWhen you take choose this archetype at 3rd level you may take one hour to carve runes into any melee weapon of your choice with which you are proficient in order to bond it to you. You may summon this weapon back to your hand instantaneously, even between attacks, causing the weapon to dissolve wherever it is and reform in your hand. Additionally, you may throw this weapon using it's normal damage die at a range of 30\/60 if it does not have the thrown property. You may only ever have one returning weapon as it is bound to your soul, and if it is destroyed then you take 5d10 psychic damage. You may bond with a new weapon whenever you want, but doing so takes an extra hour of time to remove the runes from your previous weapon. You don't need to spend extra time if your weapon was destroyed."}],"7":[{"featuretext":"Arcane Impact\n\nThrough your battles with your returning weapon you have learned how to make it more effective by using it as a conduit for pure Arcane energy. At 7th level when you make a ranged attack with your returning weapon you may choose to make it explode with magical energy on impact, dealing an its normal damage as force and extra damage equal to 1d6 + the distance thrown divided by 10 force damage (round up) to the target and creatures within a 5 foot radius. This doesn't destroy the weapon, but you must retrieve it by reforming it in your hand. You can add this damage to melee attacks, but if you do so then you will take the sum total of the damage dealt since the weapon explodes in your hand."}],"10":[{"featuretext":"Arcane Seeking\n\nStarting at 10th level the runes on your returning weapon allow it to seek out cowards who hide from your mighty chucks. Your returning weapon now negates the armor class bonus granted by any level of cover or shields but only when making ranged attacks."}],"15":[{"featuretext":"Extended Range\n\nBeginning at 15th level the runes on your returning weapon allow it to sail through the air further and faster, making it's range 40\/80 and increasing Arcane Impact's extra damage to 1d10 + distance thrown divided by 5 (round up)."}],"18":[{"featuretext":"Ranged Dominance\n\nAt level 18 your throwing ability is without equal, and you want other, lesser, ranged combatants to know. Whenever a ranged attack is made that you can see, you may use your reaction to throw your returning weapon at it, reducing its damage by however much damage you roll or destroying it completely. Additionally, you gain advantage on attack rolls on the creature who made the ranged attack until the end of your next turn"}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
