{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Armorer","class":"Artificer","level":{"3":[{"featuretext":"Power Armor\n\nBeginning at 3rd level, your metallurgical pursuits have led to you making armor a conduit for your artificer magic. As an action, you can turn a suit of heavy armor you are wearing into power armor, provided you have smith’s tools in hand. You gain the following benefits while wearing the power armor:\n\nIf the armor normally has a Strength requirement, the power armor lacks this requirement for you.\n\nYou can use the power armor as a spellcasting focus for your artificer spells.\n\nThe power armor attaches to you and can’t be removed against your will. It also expands to cover your entire body, and it replaces any missing limbs, functioning identically to a body part it is replacing.\n\nThe armor continues to be power armor until you doff it, you don another suit of armor, or you die.\n\n"},{"featuretext":"Armor Model\n\nBeginning at 3rd level, you can customize your power armor. When you do so, choose one of the following armor models: guardian or infiltrator. The model you choose gives you special benefits while you wear it.\n\nEach model includes a special weapon. When you attack with that weapon, you can use your Intelligence modifier, instead of Strength or Dexterity, for the attack and damage rolls. You can change your power armor's model whenever you finish a short or long rest, provided you have smith's tools in hand.\n\nGuardian\n\nYou design your armor to be in the frontline of conflict. It has the following features:\n\nThunder Gauntlets. Your armored fists each count as a simple melee weapon, and each deals 1d8 thunder damage on a hit. A creature hit by the gauntlet has disadvantage on attack rolls against targets other than you until the start of your next turn, as the armor magically emits a distracting pulse when the creature attacks someone else.\n\nDefensive Field. You gain a bonus action that you can use on each of your turns to gain temporary hit points equal to your level in this class, replacing any temporary hit points you already have. You lose these temporary hit points if you doff the armor.\n\nInfiltrator\n\nYou customize your armor for subtle undertakings. It has the following features:\n\nLightning Launcher. A gemlike node appears on one of your armored fists or on the chest (your choice). It counts as a simple ranged weapon, with a normal range of 90 feet and a long range of 300 feet, and it deals 1d6 lightning damage on a hit. Once on each of your turns when you hit a creature with it, you can deal an extra 1d6 lightning damage to that target.\n\nPowered Steps. Your walking speed increases by 5 feet.\n\nSecond Skin. The armor’s weight is negligible, and it becomes formfitting and wearable under clothing. If the armor normally imposes disadvantage on Dexterity (Stealth) checks, the power armor doesn’t.\n\n"}],"5":[{"featuretext":"Extra Attack\n\nStarting at 5th level, you can attack twice, rather than once, whenever you take the Attack action on your turn.\n\n"}],"9":[{"featuretext":"Armor Modifications\n\nAt 9th level, you learn how to use your artificer infusions to specially modify the armor enhanced by your Power Armor feature. That armor now counts as separate items for the purposes of your Infuse Items feature: armor (the chest piece), boots, bracers, and a weapon. Each of those items can bear one of your infusions. In addition, the maximum number of items you can infuse at once increases by 2, but those extra items must be part of your power armor.\n\n"}],"15":[{"featuretext":"Perfected Armor\n\nAt 15th level, Your power armor gains additional benefits based on its model, as shown below.\n\nGuardian. Tinkering with your armor's energy system leads you to discover a powerful pulling force. When a creature you can see ends its turn within 30 feet of you, you can use your reaction to force the creature to succeed on a Strength saving throw against your spell save DC or be pulled up to 30 feet toward you to an unoccupied space. If you pull the target to space within 5 feet of you, you can make a melee weapon attack against it as part of this reaction.\n\nYou can use this reaction a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses of it when you finish a long rest.\n\nInfiltrator. Any creature that takes lightning damage from your Lightning Launcher glimmers with light until the start of your next turn. The glimmering creature sheds dim light in a 5 foot radius, and the next attack roll against it by a creature other than you has advantage. If that attack hits, it deals an extra 1d6 lightning damage.\n\n"}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}