{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Ascendent Dragon","class":"Monk","level":{"3":[{"featuretext":"Draconic Disciple\n\nAt 3rd-level you can channel your draconic ki to imbue your unarmed strikes with the essence of a dragon’s breath and to use your connection with draconic creatures to magnify your presence. You gain the following benefits:\n\nWhen you damage a target with an unarmed strike, you can change the damage type to acid, cold, fire, lightning, or poison.\n\nIf you can’t already, you learn to speak, read, and write Draconic.\n\nIf you fail a Charisma (Intimidation) or Charisma (Persuasion) check, you can use your reaction to reroll the check, as you tap into the mighty presence of dragons. Once this feature turns a failure into a success, you can’t use it again until you finish a long rest.\n\nBreath of the Dragon\n\nAt 3rd-level you can channel your ki into destructive waves of energy like the dragons you emulate. When you take the Attack action on your turn, you can replace one of the attacks with an exhalation of draconic energy in either a 20-foot cone or a 30-foot line that is 5 feet wide (your choice). Choose a damage type: acid, cold, fire, lightning, or poison. Each creature in the area must make a Dexterity saving throw against your ki save DC, taking damage of the chosen type equal to two rolls of your Martial Arts die on a failure, or half as much damage on a success.\n\nAt 11th level, the damage of your breath increases to three rolls of your Martial Arts die.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nWhile you have no uses available, you can spend 1 ki point to use this feature again.\n\n"}],"6":[{"featuretext":"Wings Unfurled\nAt 6th-level when you use your Step of the Wind, you can unfurl spectral draconic wings from your back that vanish at the end of your turn. While the wings exist, you have a flying speed equal to your walking speed.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nWhile you have no uses available, you can spend 1 additional ki point when you activate Step of the Wind to use this feature again."}],"11":[{"featuretext":"Aspect of the Wyrm\nWhen you reach 11th-level the power of your draconic ki now radiates from you, protecting your allies from harm and punishing any who raise arms against them. As a bonus action, you can create an aura of draconic power that radiates 30 feet from you for 1 minute. Choose acid, cold, fire, lightning, or poison damage, and for the duration, you gain the following effects:\n\nYou and your allies within your aura gain resistance to the chosen damage type.\nWaves of destructive energy flow out from you and your allies when any of you are attacked. When you or one of your allies in the aura is hit by an attack made by another creature within the aura, the target that was hit can use their reaction to deal an amount of damage of the chosen type equal to one roll of your Martial Arts die to the attacker.\nOnce you use this bonus action, you can’t use it again until you finish a long rest, unless you expend 4 ki points to use it again."}],"17":[{"featuretext":"Ascendant Aspect\nAt 17th-level your draconic ki reaches its peak. You gain the following benefits:\n\nYou gain blindsight out to 30 feet. Within that range, you can effectively see anything that isn’t behind total cover, even if you’re blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.\nWhen you damage a creature with your Breath of the Dragon, the energy clings to the target. At the start of each of the creature’s turns, it takes damage of the type your breath dealt equal to one roll of your Martial Arts die. At the end of its turn, the creature can repeat the save, ending the effect on itself on a success.\nWhen you activate your Aspect of the Wyrm, draconic fury explodes from you. Choose any number of creatures you can see within your aura. Those creatures each take 4d10 acid, cold, fire, lightning, or poison damage (your choice)."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}