{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Bond of the Divine","class":"Soul Binder","previewtext":"Sometimes gods grant gifts to worthy mortals. They can take all shapes and forms and you have been given a boon in the form of a friend and protector for life.\n\nSoul binders that make a bond with a celestial are often followers of the god that the celestial used to serve, traveling the world and spreading the word of that god.\n\n","level":{"1":[{"featuretext":"Guardian of the Heavens\n\nWhen you choose this bond at 1st level,, you bind your soul with a celestial creature. The celestial has the appearance of your choice and uses the Holy Guardian stat block.\n\nDivine Warrior\n\nAt 1st level you gain proficiency with medium armor and martial weapons. You can also speak, read and write Celestial. Additionally your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.\n\nHoly Guardian\n\nMedium celestial, lawful good\n\nArmor Class 13 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d10 (or 6) + its Constitution modifier per soul binder level\n\nHit Die 1d10 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA15 (+2)13 (+1)16 (+3)8 (-1)11 (+0)13 (+1)\n\nSenses darkvision 60 ft.\n\nDamage Resistances necrotic, radiant\n\nLanguages Celestial, Understands the other languages known by its binder, but can't speak them.\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d8 + its Strength modifier bludgeoning, piercing or slashing damage.\n\n"}],"3":[{"featuretext":"Gift of Life\n\nWhen you reach 3rd level, your companion has learned to be selfless and giving, sacrificing part of its life energy to heal you or your companions.\n\nYour guardian can use a bonus action to deal damage to itself, in turn healing a creature of its choice within 5 feet of it. This damage ignores temporary hit points, immunities and resistances. The creature regains hit points equal to the damage dealt.\n\n"}],"7":[{"featuretext":"Inspiring Heal\n\nAt 7th level, you know how to mend wounds and inspire your guardian to perform better in combat.\n\nYou learn the healing word spell. You always have it prepared, and it doesn't count against the number of spells you can prepare each day. It counts as a soul binder spell for you.\n\nAdditionally, whenever you cast healing word on your guardian, it can use its reaction to make a melee weapon attack.\n\n"}],"11":[{"featuretext":"Edicts of Radiance\n\nStarting at 11th level, you can command your guardian with a voice that can pierce the heavens. The following commands are added to your Edict options:\n\nBlinding Light. You command your guardian to unleash its inner radiant light. On its turn it can use its action to release its blinding energy. Creatures of its choice within 15 feet of it must succeed on a Constitution saving throw or be blinded until the end of your next turn.\n\nSpread Your Wings. Your words inspire your guardian to fly as high as the sky. It has a flying speed of 60 feet and it doesn't provoke opportunity attacks until the start of your next turn.\n\n"}],"15":[{"featuretext":"Death Prevention\n\nWhen you reach 15th level, your guardian have gained the powers to protect people from the grasp of death.\n\nIf a creature within 60 feet of your companion drops to 0 hit points or fails a death saving throw, your guardian can use its reaction to teleport to an unoccupied space within 5 feet of that creature and breathe new life into them. The creature regains 10d12 hit points.\n\nOnce you use this feature, you can't do so again until you finish a long rest.\n\n"}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}