{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Circle of Spores","displayname":"Circle of Spores","class":"Druid","previewtext":"Gain an affinity with decay and the undead","level":{"2":[{"addspell":{"name":"Chill Touch","spelllevel":"0"}},{"featuretextwithbullet":"Halo of Spores - As a reaction on your turn, you can choose one creature within 10 ft of you to take 3 poison damage. This damage increase to 6 at level 6, 9 damage at level 10, and 12 damage at level 14."},{"featuretextwithbullet":"Circle Spells: You learn the Chill touch cantrip. Additionally, you will learn extra spells at level 3, 5, 7, and 9. These spells always are prepared for you, and do not count against the number you can prepare. These spells will be added to the app's spell list."},{"featuretextwithbullet":"Symbiotic Entity: When you use your Wild Shape feature, instead of transforming, you can infuse your spores with magic. \nFor 10 minutes, this feature grants you the following benefits: \n3 temporary hit points per druid level. \nThe damage from Halo of Spores is doubled. \nYour melee weapon attacks deal an additional 1d6 damage. "}],"3":[{"addspell":{"name":"Gentle Repose","spelllevel":"2"}},{"addspell":{"name":"Ray of Enfeeblement","spelllevel":"2"}}],"5":[{"addspell":{"name":"Animate Dead","spelllevel":"3"}},{"addspell":{"name":"Gaseous Form","spelllevel":"3"}}],"6":[{"featuretextwithbullet":"Fungal Infestation: If you kill a humanoid with your Halo of Spores feature, it rises as a zombie at the end of your turn. It has 1 hp, obeys your mental commands, can only take the Attack action, and acts directly after your turn. It lasts for 1 hour."}],"7":[{"addspell":{"name":"Blight","spelllevel":"4"}},{"addspell":{"name":"Confusion","spelllevel":"4"}}],"9":[{"addspell":{"name":"Cloudkill","spelllevel":"5"}},{"addspell":{"name":"Contagion","spelllevel":"5"}}],"10":[{"featuretextwithbullet":"Spreading Spores: As a bonus action, you hurl spores up to 30 ft away. These spores cover a 10 ft cube for 1 minute. Any creature that starts their turn inside this area takes your Halo of Spores damage. While the cube is active, you cannot use Halo of Spores. \nThe cube vanishes if you use this feature again. "}],"14":[{"featuretextwithbullet":"Fungal Body: You can no longer be blinded, deafened, frightened, or poisoned. Additionally, if an attack scores a critical hit against you, it does not deal the extra damage."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
