{"backgrounds":[],"races":[{"name":"half orc\/half elf","displayname":"half orc\/half elf","abilityscorebonuses":[{"strength":"1","constitution":"1","intelligence":"1"}],"speed":"30","languages":["Orc","Elvish","Common"]}],"subraces":[{"name":"Azerblood","race":"Dwarf","abilityscorebonuses":[{"strength":"1"}],"languages":["",""],"features":[{"featuretext":"Fire Resistance. You have resistance to fire damage.\nHeat Weapon. As a bonus action, you can cause one\nmetal melee weapon you are holding to ignite for 1\nminute. For the duration, the weapon sheds bright light in\na 10-foot radius and dim light for an additional 10 feet,\nand when you hit a creature with that weapon, the target\ntakes extra fire damage equal to half your proficiency\nbonus (rounded down).\nOnce you use this trait, you can't use it again until you\nfinish a long rest.\nExtra Language. You can speak, read, and write lgnan."}]}],"classes":[{"name":"Soul Binder","hitdie":"6","armorproficiencies":["Light Armor"],"weaponproficiencies":["Simple Weapons"],"toolproficiencies":["One type of musical instrument","One type of artisan's tools"],"equipment":[{"selection":[{"weapon":{"name":"Dagger","quantity":"2"}},{"weapon":{"type":"simple"}},{"weapon":{"type":"martial"}}]},{"selection":["priest pack","scholar's pack"]},{"selection":[{"armor":{"name":"Leather"}},""]}],"saveproficiencies":["constitution","charisma"],"classskills":["animal handling","arcana","history","insight","intimidation","nature","persuasion"],"skillcount":"2","spellprogression":"half","spellcastingability":"charisma","multiclass":{"abilityscoreprerequisites":[{"greaterthanorequal":{"first":"charismascore","second":"14"}}]},"level":{"1":[{"archetypemenu":""}],"2":[{"featuretext":"Edict\n\nYou have gotten better control over your companion and can give it more complicated commands. You can use a bonus action to speak a command to your companion. It must be able to hear you for the command to take effect. \nAt 2nd level, you learn the following commands:\n\nStrike. You command your companion to attack with extra ferocity. The next time your companion hits another creature with an attack this turn, that attack deals extra 2d6 damage.\n\nToughen Up. You command your companion to toughen up and be ready to withstand even more blows. Your companion gains 2d6 temporary hit points that last for 10 minutes.\n\nBlock. You command your companion to evade or block incoming attacks rather than taking them. Until the end of your next turn your companion can add your Charisma modifier to any saving throw it has to make, and add half your Charimsa modifier (rounded up) to its AC.\n\nMove. You tell your companion that it needs to move fast, or move safely. When given this command your companion can take the Disengage or Dash action as a bonus action on this turn.\n\nYou can use this feature a number of times equal to your Charisma modifier (minimum of 1), regaining all uses on a long rest.\n\nThe amount of dice for the \"Strike\" and \"Toughen Up\" edict increase as you gain levels in this class, increasing to 3d6 at 5th level, 4d6 at 11th level and 5d6 at 17th level.\n\n"}],"3":[{"featuretext":"Magic Item Absorption\n\nWhen you reach 3rd level, the soul binder can perform a special ritual to merge a magic item into its companion during a short rest. Merging with an item requires physical contact between the soul binder, the item and the companion.\n\nCertain items have prerequisites. The companion must meet any prerequisite for the item to successfully merge with it. Your companion cannot merge with items requiring a class prerequisite. If the short rest is interrupted, the merging fails. Otherwise, at the end of the short rest, the item merges into the companion.\n\nWhile merged, the companion gains an intuitive understanding of how to activate any magical properties of the item, including any necessary Command words. Your companion can use the magical properties of the item and apply the effects to its natural weapons and natural armor, but doesn't get the benefit of the armor or weapon itself. It can only have one weapon merged at a time, and one piece of armor. The companions natural weapons can only benefit from one of the merged items, and you can change this on a short rest, the same goes for its natural armor. If it absorbs a weapon, its attacks becomes magical.\n\nExample: if you bind a +1 Plate armor to your companion it gains +1 to its AC, but not the benefits of wearing Plate armor. Each merged item within the creature counts as an attunement for the soul binder, regardless if whether the item required attunement. Attempting to merge with more than three items fails automatically. The soul binder can voluntarily end the merge by spending another short rest focused on the item, unless the item is cursed.\n\nIf the companion dies, all the merges items are expelled from its corpse on the ground around it.\n\n"}],"4":[{"abilityscoreimprovement":""}],"5":[{"featuretext":"Advanced Offense\n\nBeginning at 5th level, you and your companion have improved your skill in combat and work even better together. You gain one of the following features of your choice:\n\nCompanion Extra Attack. Your companion can attack twice instead of once, whenever it takes the Attack action on its turn.\n\nExpert Commanding. There is no longer any restrictions for whenever you or your companion can take the Attack action or cast a spell with a casting time of 1 action as long as it is a soul binder spell.\n\nAt 11th level you get the other feature that you didn't pick at 5th level.\n\nSoul Linked Casting\n\nYou and your companion are of the same soul, and you can channel magic through your link.\n\nAt 5th level, when you cast a spell targeting yourself, you can choose to also have the spell affect your companion if the companion is within 60 feet of you. If you lose concentration on the spell, you both lose the effect, and you must make concentration checks also if your companion takes damage, as if you took that amount of damage.\n\n"}],"6":[{"featuretext":"Soul Infused Attacks\n\nStarting at 6th level, your companions attacks count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\nCompanion's Protection\n\nWhen you reach 6th level your companion's defense is better than ever, avoiding everything from traps to spells. It gains proficiency in all saving throws. Additionally, it has advantage on Intelligence and Charisma saving throws when you are within 100 feet of it and it can see you.\n\n"}],"7":[{"featuretext":"Project Senses\n\nBeginning at 7th level you can project your mind into your companion. As an action, you can see through your companion’s eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses that the companion has. During this time, you are deaf and blind with regard to your own senses. While you are seeing with your companion's eyes you can also choose to speak though it with your own voice being projected from its mouth.\n\n"}],"8":[{"abilityscoreimprovement":""}],"9":[{"featuretext":"Resting Voice\n\nBeginning at 9th level you now regain all uses of your edicts on a short or long rest.\n\n"}],"10":[{"featuretext":"Countermeasure\n\nAt 10th level, your companion is very protective of you and will harm anyone who seeks to hurt you. When you are targeted by an attack, your companion can take one of the following reactions:\n\nRevenge. The companion can use its reaction to make one attack against the enemy if it is within range.\n\nRoar. It uses its reaction to let out a frightful roar to impose disadvantage on the attack roll as long as the attacker is within 30 feet of it and is not deafened.\n\nBody Shield. If your companion is within 5 feet of you when the attack is made, it can use its reaction to redirect the attack to target the companion instead.\n\n"}],"12":[{"abilityscoreimprovement":""}],"14":[{"featuretext":"Soul Purification\n\nWhen you reach 14th level you can use your soul energy to flush out any negative effects currently impeding your companion.\n\nIf your companion is affected by a magical effect that allows it to make a saving throw at the start or end of its turns, or as an action, you can use your action to allow your companion to immediately attempt to make the saving throw even if it has already done so on said turn.\n\n"}],"16":[{"abilityscoreimprovement":""}],"18":[{"featuretext":"Resonating Voice\n\nAt 18th level you use your magic to command your companion with a voice that resonates with your shared soul bond.\n\nWhen you use an edict you can select another edict you know and have that affect your companion as well.\n\n"}],"20":[{"abilityscoreimprovement":""}]}},{"name":"Artificer","displayname":"Artificer","hitdie":"8","armorproficiencies":["Light Armor","Medium Armor"],"weaponproficiencies":["Simple Weapons"],"toolproficiencies":["Thieves' Tools","One type of artisan's tools","One type of artisan's tools"],"equipment":[{"selection":["Handaxe and Light Hammer",{"weapon":{"name":"Simple Weapons","quantity":"2"}}]},{"weapon":{"name":"Light Crossbow"}},"20 Light Crossbow Bolts",{"selection":[{"armor":{"name":"Scale Mail"}},{"armor":{"name":"Studded Leather"}}]},"Thieves' Tools","Dungeoneer's Pack"],"saveproficiencies":["constitution","intelligence"],"classskills":["arcana","deception","history","investigation","medicine","nature","religion","sleight of hand"],"skillcount":"2","spellprogression":"third","spellcastingability":"intelligence","multiclass":{"abilityscoreprerequisites":[{"greaterthanorequal":{"first":"strengthscore","second":"0"}}]},"level":{"1":[{"addspell":{"name":"Detect Magic (Ritual)","spelllevel":"1"}},{"addspell":{"name":"Identify (Ritual)","spelllevel":"1"}},{"archetypemenu":""}],"2":[{"featuretextwithbullet":"Tool Expertise: Your proficiency bonus is doubled for any ability check you make that uses any of the tool proficiencies you gain from this class."},{"sharedclassfeaturemenu":{"name":"Wondrous Invention (Level 2)","selections":"1","class":"Artificer"}}],"4":[{"abilityscoreimprovement":""},{"featuretextwithbullet":"Infuse Magic: When you cast an artificer spell with a casting time of 1 action, you can increase its casting time to 1 minute. If you do so and hold a nonmagical item throughout the casting, you expend a spell slot, but none of the spell’s effects occur. Instead, the spell transfers into that item for later use if the item doesn’t already contain a spell from this feature. Any creature holding the item thereafter can use an action to activate the spell if the creature has an Intelligence score of at least 6. The spell is cast using your spellcasting ability, targeting the creature that activates the item. If the spell targets more than one creature, the creature that activates the item selects the additional targets. If the spell has an area of effect, it is centered on the item. If the spell’s range is self, it targets the creature that activates the item. When you infuse a spell in this way, it must be used within 8 hours. After that time, its magic fades and is wasted. You can have a limited number of infused spells at the same time. The number equals your Intelligence modifier."}],"5":[{"featuretextwithbullet":"Superior Attunement: You can now attune to up to four magic items at a time. At 15th level, this limit increases to five magic items."},{"sharedclassfeaturemenu":{"name":"Wondrous Invention (Level 5)","selections":"1","class":"Artificer"}}],"6":[{"featuretextwithbullet":"Mechanical Servant: Your research and mastery of your craft allow you to produce a mechanical servant. The servant is a construct that obeys your commands without hesitation and functions in combat to protect you. Though magic fuels its creation, the servant is not magical itself. You are assumed to have been working on the servant for quite some time, finally finishing it during a short or long rest after you reach 6th level. Select a Large beast with a challenge rating of 2 or less. The servant uses that beast’s game statistics, but it can look however you like, as long as its form is appropriate for its statistics. It has the following modifications:\r\n• It is a construct instead of a beast.\r\n• It can’t be charmed.\r\n• It is immune to poison damage and the poisoned condition.\r\n• It gains darkvision with a range of 60 feet if it doesn’t have it already.\r\n• It understands the languages you can speak when you create it, but it can’t speak.\r\n• If you are the target of a melee attack and the servant is within 5 feet of the attacker, you can use your reaction to command the servant to respond, using its reaction to make a melee attack against the attacker.\r\nThe servant obeys your orders to the best of its ability. In combat, it rolls its own initiative and acts on its own. If the servant is killed, it can be returned to life via normal means, such as with the revivify spell. In addition, over the course of a long rest, you can repair a slain servant if you have access to its body. It returns to life with 1 hit point at the end of the rest. If the servant is beyond recovery, you can build a new one with one week of work (eight hours each day) and 1,000 gp of raw materials."}],"8":[{"abilityscoreimprovement":""}],"12":[{"abilityscoreimprovement":""}],"15":[{"sharedclassfeaturemenu":{"name":"Wondrous Invention (Level 15)","selections":"1","class":"Artificer"}}],"16":[{"abilityscoreimprovement":""}],"18":[{"abilityscoreimprovement":""}],"20":[{"featuretextwithbullet":"Soul of Artifice: You can attune to up to six magic items at once. In addition, you gain a +1 bonus to all saving throws per magic item you are currently attuned to."},{"sharedclassfeaturemenu":{"name":"Wondrous Invention (Level 20)","selections":"1","class":"Artificer"}}]}}],"archetypes":[{"name":"Oath of the Unconquered","class":"Paladin","previewtext":"Unbreakable and Dominating","spellprogression":"half","spellcastingability":"charisma","level":{"3":[{"featuretext":"CHANNEL DIVINITY \nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options. Adamantine Bulwark. Anytime you take damage from an attack or spell, you can use your reaction and your channel divinity to reduce all damage you take by an amount equal to three times your paladin level Unstoppable Charge. You can spend an action to use your channel divinity to move up to your speed in a straight line. You can move through enemy creatures, and the first enemy creature of up to one size larger than you or smaller that you come in contact with must succeed on a strength saving throw or take bludgeoning damage equal to 2d8 + your paladin level, and be forcefully moved along with you until you finish your movement. Each other creature whose space you, or the creature you are pushing, pass through during this action must succeed on a dexterity saving throw or be knocked prone. "}],"5":[{"addspell":{"name":"Warding bond, Enlarge\/Reduce","spelllevel":"2"}}],"7":[{"featuretext":"AURA OF IRON\nBeginning at 7th level, you emanate so many protective magics that it is almost palpable. You and friendly creatures within 10 feet of you reduce all damage taken by an amount equal to your Charisma modifier (minimum 1). You reduce damage this way before resistances have been calculated. At 18th level, the range of this aura increases to 30 feet. "}],"9":[{"addspell":{"name":"Beacon of Hope, Wind Wall","spelllevel":"3"}}],"13":[{"addspell":{"name":"Resilient Sphere, Freedom of Movement","spelllevel":"4"}}],"15":[{"featuretext":"LIVING FORTRESS\nAt 15th level, you have come to embody many qualities of an actual fortress. You can no longer be forcefully moved by spell effects, or by abilites used by creatures that are one size larger than you or smaller. Additionally, allies who are within 5 feet of you, and are of your size or smaller, gain the benefits of half cover."}],"17":[{"addspell":{"name":"Passwall, Stonewall","spelllevel":"5"}}],"20":[{"featuretext":"UNBREAKABLE DEFENDER\nAt 20th level, you can use an action to create an additional, secondary layer of armor made of solidified radiant energy that appears over your form. For one minute you gain the following benefits: \n• If an attack or spell that deals damage would damage you for 15 hit points or less, you ignore it. • Anytime a hostile creature makes a ranged attack against an allied creature within your Aura of Iron, you can roll a d6. On a 4 or higher, you become the target of the attack instead. • Allied creatures within 30ft of you always gain the benefits of half cover. \nOnce you use this feature, you can't use it again until you finish a long rest. "}]}},{"name":"Monster Slayer","displayname":"Monster Slayer","class":"Fighter","level":{"3":[{"featuretext":"Combat Superiority\n\nWhen you choose this archetype at 3rd level, you gain a set of abilities that are fueled by special dice called superiority dice.\n\nSuperiority Dice. You have four superiority dice, which are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\n\nYou gain another superiority die at 7th level and one more at 15th level.\n\nUsing Superiority Dice. You can expend superiority dice to gain a number of different benefits:\n\n• Precision Attack. When you make a weapon attack against a creature, you can expend one superiority die to add it to the attack roll. You can use this ability before or after making the attack roll, but before any of the effects of the attack are applied.\n\n• Sharpened Attack. When you damage a creature with a weapon attack, you can expend one superiority die to add it to the damage roll. You can use this ability after rolling damage. If the attack causes the target to make a Constitution saving throw to maintain concentration, it has disadvantage on that save.\n\n• Sharpened Senses. When you make a Wisdom (Perception) check to detect a hidden creature or object, or a Wisdom (Insight) check to determine if someone is lying to you, you can expend one superiority die to add it to the roll. You can use this feature after seeing the total but before learning if you succeeded or failed.\n\n• Superior Willpower. When you make an Intelligence, a Wisdom, or a Charisma saving throw, you can expend one superiority die to add it to the roll. You can use this feature only before you learn if the save succeeded or failed.\n\n"},{"featuretext":"Bonus Proficiencies\n\nWhen you choose this archetype at 3rd level, you gain proficiency in two of the following skills of your choice: Arcana, History, Insight, Investigation, Nature, or Perception. You can gain proficiency with a tool of your choice in place of one skill choice."},{"featuretext":"Hunter's Mysticism\n\nAt 3rd level, your study of the supernatural gives you a limited ability to use magic. You can cast Detect Magic as a ritual. You can cast Protection from Evil and Good, but you cannot cast it again with this feature until you finish a long rest. Wisdom is your spellcasting ability for these spells.\n\nIn addition, you gain the ability to speak one of the following languages of your choice: Abyssal, Celestial, or Infernal.\n\n"}],"7":[{"featuretext":"Monster Slayer\n\nAt 7th level, whenever you expend superiority dice to add to a damage roll, you can expend up to two dice instead of just one, adding both to the roll. Both dice are expended as normal. If the target of your attack is an aberration, a fey, a fiend, or an undead, you deal maximum damage with both dice, instead of rolling them."}],"10":[{"featuretext":"Improved Combat Superiority\n\nAt 10th level, your superiority dice turn into d10s. At 18th level, they turn into d12s."}],"15":[{"featuretext":"Relentless\n\nStarting at 15th level, when you roll initiative and have no superiority dice remaining, you regain one superiority die."}]}},{"name":"Vampiric Bloodline","displayname":"Vampiric Bloodline","class":"Sorcerer","previewtext":"Your innate magic stems from the mingling of your bloodline with the blood of a vampire. Some sorcerers with this origin can trace their powers back to an ancient bargain with a powerful vampire. When a vampire takes particular interest in a mortal being, they may allow that humanoid to have a taste of their blood. This ritual is seldom practiced, and few vampires would ever even dare to try it. But this is not the only way to gain this origin, as many of these sorcerers can trace their powers to a near-death experience with a vampire. Whatever the case, vampiric magic permeates your blood, and your very being. Vampiric sorcerers most often try to hide their ancestry, since their origins can make them as reviled as the vampires that spawned them. However, a select few embrace their vampiric ancestry, and may even seek to become true vampires in death.","spellprogression":"full","spellcastingability":"charisma","level":{"1":[{"featuretext":"Denizen of the Night\n\nStarting when you choose this origin at 1st level, you gain darkvision out to a range of 30 feet, as described in chapter 8 of the PHB."},{"featuretext":"Martial Prowess\n\nAlso at 1st level, your vampiric ancestry grants you increased effectiveness in melee combat. Your unarmed strikes use a d6 as their damage die, and use your Charisma instead of Strength for their attack and damage rolls. Additionally, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class."}],"6":[{"featuretext":"Vampiric Regeneration\n\nAt 6th level, you gain a semblance of the regenerative abilities of a vampire. At the start of each of your turns, you gain a number of temporary hit points equal to half your Sorcerer level. The amount of temporary hit points gained is halved when you are in sunlight or running water."},{"featuretext":"Extra Attack\n\nStarting at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. Additionally, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage, and use a d8 as their damage die."}],"14":[{"featuretext":"Shapechanger\n\nStarting at 14th level, you can use your action to polymorph into a Tiny bat or back into your true form. While in bat form, you can't speak, attack, or cast spells, your walking speed is 5 feet, and you have a flying speed of 30 feet. Your statistics, other than your size and speed, are unchanged. Anything you are wearing or carrying transforms with you."}],"18":[{"featuretext":"Misty Escape\n\nAt 18th level, you gain the ability to escape from death as a cloud of mist. When you would be reduced to 0 hit points, you can use your reaction and spend 5 sorcery points to instead be reduced to 1 hit point and immediately cast gaseous form on yourself without expending a spell slot or material components."}]}},{"name":"Nightstalker","class":"Revised Ranger"},{"name":"Arcane Thrower","displayname":"Arcane Thrower","class":"Fighter","level":{"3":[{"featuretext":"Returning Weapon\n\nWhen you take choose this archetype at 3rd level you may take one hour to carve runes into any melee weapon of your choice with which you are proficient in order to bond it to you. You may summon this weapon back to your hand instantaneously, even between attacks, causing the weapon to dissolve wherever it is and reform in your hand. Additionally, you may throw this weapon using it's normal damage die at a range of 30\/60 if it does not have the thrown property. You may only ever have one returning weapon as it is bound to your soul, and if it is destroyed then you take 5d10 psychic damage. You may bond with a new weapon whenever you want, but doing so takes an extra hour of time to remove the runes from your previous weapon. You don't need to spend extra time if your weapon was destroyed."}],"7":[{"featuretext":"Arcane Impact\n\nThrough your battles with your returning weapon you have learned how to make it more effective by using it as a conduit for pure Arcane energy. At 7th level when you make a ranged attack with your returning weapon you may choose to make it explode with magical energy on impact, dealing an its normal damage as force and extra damage equal to 1d6 + the distance thrown divided by 10 force damage (round up) to the target and creatures within a 5 foot radius. This doesn't destroy the weapon, but you must retrieve it by reforming it in your hand. You can add this damage to melee attacks, but if you do so then you will take the sum total of the damage dealt since the weapon explodes in your hand."}],"10":[{"featuretext":"Arcane Seeking\n\nStarting at 10th level the runes on your returning weapon allow it to seek out cowards who hide from your mighty chucks. Your returning weapon now negates the armor class bonus granted by any level of cover or shields but only when making ranged attacks."}],"15":[{"featuretext":"Extended Range\n\nBeginning at 15th level the runes on your returning weapon allow it to sail through the air further and faster, making it's range 40\/80 and increasing Arcane Impact's extra damage to 1d10 + distance thrown divided by 5 (round up)."}],"18":[{"featuretext":"Ranged Dominance\n\nAt level 18 your throwing ability is without equal, and you want other, lesser, ranged combatants to know. Whenever a ranged attack is made that you can see, you may use your reaction to throw your returning weapon at it, reducing its damage by however much damage you roll or destroying it completely. Additionally, you gain advantage on attack rolls on the creature who made the ranged attack until the end of your next turn"}]}},{"name":"Soul Knife","displayname":"Soul Knife","class":"Monk","previewtext":"Monks of the Way of the Soul Knife are deadly assassins and bounty hunters. They use their psionic talents to manifest psychic blades that tear through their enemies’ bodies and auras. Their talents extend beyond combat, as their ability to perceive auras allows them to track down foes and see through their deceptions.","level":{"3":[{"featuretext":"Soul Knives\n\nStarting when you choose this tradition at 3rd level, you can use your psionic energy to manifest blades that disrupt your foes’ minds.\n\nYour unarmed strikes deal your choice of psychic, piercing, slashing, or bludgeoning damage each time you hit.\n\nIn addition, you can use a bonus action to increase the reach of your unarmed strikes by 30 feet until the end of your turn."},{"featuretext":"Psychic Slash\n\nAt 3rd level, when you channel ki into your attacks you augment your soul knives to inflict devastating psionic blows.\n\nWhenever you hit a creature with one of the attacks granted by your Flurry of Blows and that attack inflicts psychic damage, you can impose one of the following effects on the target:\n\nLife Drain. You gain temporary hit points equal to half the damage your attack deals.\n\nInvoke Terror. The target must succeed on a Wisdom saving throw or become frightened of you until the end of your next turn.\n\nInvoke Wrath. The target suffers disadvantage on all attack rolls against targets other than you until the end of your next turn.\n\nAstral Slide. You teleport the target up to 10 feet to a destination you can see.\n\nSynaptic Overload. The target gains vulnerability to psychic damage until the end of your next turn.\n\n"}],"6":[{"featuretext":"Aura Sight\n\nAt 6th level, you gain the ability to perceive the auras of other creatures.\n\nAs an action, select a creature that you can see. That creature makes a Wisdom saving throw, though it has no knowledge that you forced it to attempt this saving throw. On a failed save, you learn if the creature shares any aspects of its alignment with you, its current hit points, and its current attitude and intentions toward you or one other creature, object, or location of your choice. In addition, for the next 24 hours or until you use this ability again, you can use an action to determine the creature’s distance and direction from you.\n\nIf a creature succeeds on its saving throw against this ability, you cannot use this ability against that creature again until you complete a long rest.\n\n"}],"11":[{"featuretext":"\nSpectral Blades\n\nAt 11th level, you can cause your blades to phase through physical objects and defenses.\n\nOnce during your turn, you can choose to forego one unarmed strike in place of forcing a creature within the reach of that attack to make a Dexterity saving throw against your ki save DC. On a failed saving throw, the creature takes psychic damage equal to that of your unarmed strike, or half that damage if it succeeds.\n\n"}],"17":[{"featuretext":"Psychic Form\n\nAt 17th level, you can transform your physical body into the same psychic energy that comprises your soul knives. As a bonus action, you assume a psychic form, which grants the following benefits:\n\n• You have resistance to all damage.\n• You have a fly speed of 30 feet.\n• You can move through other creatures and objects as if they were difficult terrain. You take 5 force damage if you end your turn inside an object.\n\nThis benefit lasts for 1 minute. You cannot use it again until you complete a long rest.\n\n"}]}},{"name":"Oath of Treachery","class":"Paladin","spellcastingability":"charisma","level":{"3":[{"featuretext":"Channel Divinity\n\nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\nConjure Duplicate. As an action, you create a visual illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space of your choice that you can see within 30 feet of you. The illusion looks exactly like you; it is silent; it is your size, is insubstantial, and doesn’t occupy its space; and it is unaffected by attacks and damage. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but the illusion must remain within 120 feet of you.\n\nFor the duration, you can cast spells as though you were in the illusion’s space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how uncanny the illusion is.\n\nPoison Strike. You can use your Channel Divinity to make a weapon deadlier. As a bonus action, you touch one weapon or piece of ammunition and conjure a special poison on it. The poison lasts for 1 minute. The next time you hit a target with an attack using that weapon or ammunition, the target takes poison damage immediately after the attack. The poison damage equals 2d10 + your paladin level, or 20 + your paladin level if you had advantage on the attack roll.\n"}],"7":[{"featuretext":"Aura of Treachery\n\nStarting at 7th level, you emanate an aura of discord, which gives you the following benefits.\n\nCull the Herd. You have advantage on melee attack rolls against any creature that has one or more of its allies within 5 feet of it.\n\nTreacherous Strike. If a creature within 5 feet of you misses you with a melee attack, you can use your reaction to force the attacker to reroll that attack against a creature of your choice that is also within 5 feet of the attacker. The ability fails and is wasted if the attacker is immune to being charmed. You can use this ability three times, and regain expended uses of it when you finish a short or long rest.\n\n"}],"15":[{"featuretext":"Blackguard's Escape\n\nAt 15th level, you have the ability to slip away from your foes. Immediately after you are hit by an attack, you can use your reaction to turn invisible and teleport up to 60 feet to a spot you can see. You remain invisible until the end of your next turn or until you attack, deal damage, or force a creature to make a saving throw. Once you use this feature, you must finish a short or long rest before you can use it again."}],"20":[{"featuretext":"Icon of Deceit\n\nAt 20th level, you gain the ability to emanate feelings of treachery. As an action, you can magically become an avatar of deceit, gaining the following benefits for 1 minute:\n\n• You are invisible.\n\n• If a creature damages you on its turn, it must succeed on a Wisdom saving throw (DC equal to your spell save DC) or you control its next action, provided that you aren’t incapacitated when it takes the action. A creature automatically succeeds on the save if the creature is immune to being charmed.\n\n• If you have advantage on an attack roll, you gain a bonus to its damage roll equal to your paladin level.\n\nOnce you use this feature, you can’t use it again until you finish a long rest.\n\n"}]}},{"name":"Shadow","class":"Rogue","level":{"3":[{"featuretext":"Bonus Cantrips\n\n\r\nWhen you choose this archetype at 3rd level, you gain the \r\numbraturgy † cantrip and the dueling shadows † cantrip. \r\nCharisma is your spellcasting ability for these spells."},{"featuretext":"Severed Shadow\n\nStarting at 3rd level, you can separate your shadow from your \r\nbody, creating a shadowy replica of yourself and causing you to \r\nno longer cast a shadow. This replica is completely opaque and \r\nsolid, and looks like a three-dimensional silhouette of yourself. \r\n As an action, you may separate your shadow and then move it \r\nup to 30 feet as part of the same action. The shadow shares your \r\nstatistics, and can perform all movements that you would be able \r\nto, making ability checks for any movements that would normally \r\nrequire them, but it cannot take any actions. The shadow is \r\nsusceptible to saving throws and attacks, including opportunity \r\nattacks, and it shares your AC. If it takes any damage, it instantly disappears. Your separated shadow can count as an enemy of a \r\nhostile creature for the purpose of granting sneak attack.\r\n On subsequent turns while you are separated from your shadow \r\nby less than 120 feet, you may move it another 30 feet (no action \r\nrequired). As a bonus action on your turn, you may choose to \r\nteleport to the location of your shadow, reuniting yourself with it. \r\nYou can also reunite with your shadow by moving into its space.\r\n Once you teleport to your shadow, you can’t teleport to it again \r\nuntil you complete a short or long rest."}],"9":[{"featuretext":"Deceiving Darkness\n\nStarting at 9th level, you have advantage on Dexterity (Stealth) \r\nchecks if you are in dim light or darkness."}],"13":[{"featuretext":"Shadow Simulacrum\n\nAt 13th level, you gain greater control over your shadow. When \r\nyour shadow is separated from you, you can use your bonus \r\naction to have it perform the Help action, and your shadow can \r\nalso manipulate objects weighing up to 25 pounds."}],"17":[{"featuretext":"Master of Shadows\n\nWhen you reach 17th level, you have gained ultimate control over \r\nyour shadow. When you sever your shadow, you can control its \r\nmovement as long as it is within 500 feet, and you may use your \r\nbonus action to switch from using its senses to using your own, or \r\nback again. Additionally, you no longer have to complete a short \r\nor long rest before teleporting to it again."}]}},{"name":"Way of the Astral Self","class":"Monk","level":{"3":[{"featuretext":"Arms of the Astral Self\n\nAt 3rd level, your mastery of your ki allows you \r\nto summon a portion of your astral self. On your \r\nturn, you can spend 2 ki points as a bonus action \r\nto summon the arms of your astral self for 10 \r\nminutes. These spectral arms hover near your \r\nshoulders. You determine the arms’ appearance \r\nbased on the qualities of your character. \r\nWhile your astral arms are summoned, you \r\ngain the following benefits: \r\n• You can use your Wisdom modifier in place of \r\nyour Strength modifier when making Strength \r\nchecks and Strength saving throws. \r\n• The arms are monk weapons and have a reach \r\nof 10 feet. The arms deal radiant or necrotic \r\ndamage (your choice). When you attack with \r\nthe arms, you can use your Wisdom modifier \r\ninstead of your Strength or Dexterity modifier \r\nfor the attack and damage rolls. \r\n• Immediately after you use the Attack action \r\nwith your astral arms on your turn, you can \r\nmake one extra attack with your astral arms as \r\na bonus action. The number of extra attacks \r\nincreases when you reach certain levels in this \r\nclass, increasing to two at 11th level and three \r\nat 17th level."}],"6":[{"featuretext":"Visage of the Astral Self"}],"11":[{"featuretext":"Awakening of the Astral Self\n\nStarting at 11th level, you tap into the greater \r\npower of your astral self. While you have both \r\nyour astral arms and visage summoned, you gain \r\nthe following benefits. \r\nDeflect Energy. When you take acid, cold, fire, \r\nlightning, or force damage, you can use your \r\nreaction to deflect it. When you do so, the \r\ndamage you take is reduced by 1d10 + your \r\nWisdom modifier + your monk level. \r\nEmpowered Arms. Once on each of your turns \r\nwhen you hit a target with your astral arms, you \r\ncan deal extra damage to the target equal to your \r\nMartial Arts die. \r\nWord of the Spirit. When you speak through \r\nyour visage, you can direct your words to a \r\ncreature of your choice that you can see within \r\n30 feet of you, making it so only that creature \r\ncan hear you. Alternatively, you can amplify your \r\nvoice so that all creatures within 600 feet can \r\nhear you."}],"17":[{"featuretext":"Complete Astral Self\n\r\nStarting at 17th level, your connection to your \r\nastral self is complete, allowing you summon it \r\nentirely. On your turn, you can spend 10 ki \r\npoints as a bonus action to summon the arms, \r\nvisage, and body of your astral self for 10 \r\nminutes. This spectral body covers your physical \r\nform like a suit of armor, connecting with the \r\narms and visage. You determine its appearance \r\nbased on the qualities of your character. \r\nWhile your astral self is summoned, you gain \r\nthe following benefits\nArmor of the Spirit. You gain a +2 bonus to AC \r\nwhile you aren’t incapacitated. \r\nAstral Barrage. Whenever you use the Extra \r\nAttack feature to attack twice, you can instead \r\nattack three times using your astral arms. \r\nKi Consumption. When a creature within 10 \r\nfeet of you is reduced to 0 hit points, you can use \r\nyour reaction to regain ki points equal to your \r\nWisdom modifier (minimum 1)."}]}},{"name":"Path of the Sin Scarred","class":"Barbarian","previewtext":"One unfortunate night, one terrible event now defines a dark\r\npart of your soul. Unable to forgive or forget has lead to anger\r\ntaking on the form of vengeance and burning forth to destroy\r\nall who make the mistake of getting in the way of those who\r\nhave been scared.","level":{"3":[{"featuretext":"Scarred Visage\r\nAt 3rd level when you take this path you have been afflicted\r\nwith a curse either by a close encounter with a magical\r\ncreature or a heinous act you have performed. When you rage\r\nthe wounds from this event open up with your fury giving you\r\nadvantage on intimidation checks.\r\nSin save DC = 8 + proficiancy + con"},{"featuretext":"Natural Weapon\r\nAdditionally, at 3rd level, your body has begun to warp for the\r\ncurse inflicted upon you. While raging you grow a natural\r\nweapon from your body that you gain proficiency with. Chose\r\na natural weapon from below. These natural weapons all\r\nhave the finesse property.\r\nClaws: 1d8 slashing damage. On a successful attack, the\r\ncreature hit must make a Constitution saving throw\r\nagainst your sin save or take an additional 1d6 damage on\r\nthe end of its turn till it either is healed through magic or a\r\nDC10 medicine check.\r\nHorns: 1d8 piercing damage. If you move 10ft then use\r\nyour horns to attack you do 1D8 bludgeoning damage and\r\nthe creature hit must make a natural weapon saving throw\r\nor be pushed 10ft and knocked prone\r\nTail: 1d4 bludgeoning damage. You can attack with this as\r\na bonus action. Additionally, you can attack any creature\r\nthat moves within 5ft or you as a reaction.\r\nFangs: 1d8 pricing damage. On a successful hit, you gain\r\nback hit points equal to half the damage inflicted by this\r\nattack."}],"6":[{"featuretext":"Elemental Atonement\r\nAt 6th level, the magical essence of your curse can no longer\r\nbe contained within you, spilling out with your rage warping\r\nyou even further. Chose an element from the list below, when\r\nyou are raging and attack using your natural weapon you deal\r\nan additional 1d6 of that damage type. This damage\r\nincreases to 2d6 when you are at 12th level and 3d6 at 16th\r\nlevel. Additionally Natural weapons count as magical for\r\novercoming resistance to non-magical weapons.\r\nFire: Your skin becomes black like charcoal and you\r\nbellow out smoke from your mouth and nostrils.\r\nCold: You become pale as snow, your eyes become a deep\r\nblue and you cool the air around you.\r\nLightning: Your veins glow an eerie purple\/blue and you\r\nemit a faint light for 10ft.\r\nForce: Wind rushes around you and your facial feature\r\nsharped to an unnatural degree.\r\nNecrotic: Your visage becomes shrouded in a black mist\r\nand your bones are highly visible beneath your skin.\r\nRadiant: You are shrouded in a bright aura, Your eyes\r\nbecome pure white, and you emit bright light for 10ft"}],"10":[{"featuretext":"Greater Mutations\r\nAt 10th level, your curse has progressed giving you access to\r\nmore advanced mutations. Choose one mutation from the list\r\nbelow, when you rage you gain the benefits of the option\r\nchosen.\r\nWings: A pair of wings sprout from your body grating you\r\na flight speed equal to your movement speed.\r\nExtended limbs: Your arms become unnaturally long\r\ngiving weapon attacks and the claw natural weapon the\r\nreach property.\r\nNatural armour: Your body natural resilience increases\r\ngranting you +2 to your armour class.\r\nEnthralling venom: When you successfully hit a creature\r\nwith one of your natural weapons you can force it to make\r\na charisma saving throw against your Sin save DC or\r\nbecome charmed by you till the beginning of your next\r\nturn. You can do this as many times as your Constitution\r\nmodifier per long rest.\r\nBanshees shrike: You let out a bloodcurdling shrike\r\ncausing every hostile creature within 30ft of you to make a\r\nconstitution saving throw against your Sin save DC or\r\ntake 2d10 plus your constitution modifier and become\r\ndefend or take half the damage and not be defend on a\r\nsuccessful save. You can do this once per short or long\r\nrest."}],"14":[{"featuretext":"Acceptance\r\nAt 14th level, your curse has fully integrated with your body\r\nand you have become a true monster. You can choose and\r\nadditional natural weapon and your natural weapons deal\r\ndamage equal to one die higher eg. 1d8 to 1d10. Additionally,\r\nwhile raging you gain an additional ability according to what\r\nelement you had chosen for the Elemental Attonment feature.\r\nFire: Dangerous flames jet out from your body, whenever\r\na hostile creature ends its turn within 10ft must make a\r\nDexterity saving throw against your Sin save DC or take\r\n3d6 fire damage\r\nCold: The air practically freezes in your presence. Any\r\ncreature that ends its turn within 10ft of you must make a\r\nConstitution saving throw against your Sin save DC or\r\ngain one level of exhaustion. if a creature passes this save\r\nbecomes immune to this effect for 1 minute.\r\nLighting: You become like lightning itself and gain an\r\nextra 10ft of movement speed. Additionally, when you\r\nmove more than 15ft towards a creature as an action, you\r\ncan force that creature to make a dexterity saving throw\r\nagainst your Sin save DC or take 2d8 lightning damage\r\nand be knocked prone or take half damage and not be\r\nknocked prone on a successful save. You can do this as\r\nmany times as your Constitution modifier per long rest.\r\nForce: A strong wind whips around you causing ranged\r\nweapon attacks to have disadvantage against you and any\r\ncreature that ends its turn within 10ft of you must make a\r\nStrength saving throw against your Sin save DC or be\r\npushed back by 10ft.\r\nNecrotic: You become a force of entropy. When you\r\nreduce a medium or smaller humanoid or beasts hit\r\npoints to 0 you can make that creature make a\r\nconstitution saving throw against your Sin save DC or be\r\nresurrected with 1 hit point. The resurrected creature\r\nuses the statistics of a zombie and takes its turn\r\nimmediately after yours in combat. The creature obeys\r\nyour mental commands and can only take the attack\r\naction in combat and can only make 1 attack per round.\r\nThe creature remains animated for 1 hour before\r\ncrumbling to dust.\r\nRadiant: You body radiates divine light. As an action, you\r\ncan teleport to an unoccupied space within 30ft of you and\r\nany hostile creature within 10ft of the space you\r\nteleported to must make a Constitution saving throw\r\nagainst your Sin save DC or take 4d6 radiant damage and\r\nbe blinded till the start of your next turn or take half ad not\r\nbe blinded on a successful save."}]}},{"name":"Giant Soul","class":"Sorcerer","spellcastingability":"charisma","level":{"1":[{"featuretext":"Jotun Resilience\n\nThe resilience of giants flows through your body. At 1st level, your hit point maximum increases by 1, and it increases by 1 again whenever you gain a level in this class.\n\n"},{"featuretext":"Mark of the Ordning\n\nAt 1st level, you discover innate magical abilities within yourself that are based on your giant heritage. Select one of the giant types from the Mark of the Ordning table. At 1st and 3rd level, you learn the spells associated with your choice, as shown in the table. These spells count as sorcerer spells for you, but they don’t count against your number of sorcerer spells known.\n\n"}],"6":[{"featuretext":"Soul of Lost Ostoria\n\nStarting at 6th level, you gain a benefit whenever you cast one of the spells granted by your Mark of the Ordning Feature.\n\nCloud Giant. Immediately after you cast any of your Mark of the Ordning spells, you can magically teleport as a bonus action. You teleport to an unoccupied space you can see that is no farther away than a number of feet equal to 10 + your Constitution modifier.\n\nFire Giant. You gain a bonus to the damage rolls of your Mark of the Ordning spells. The bonus equals your Constitution modifier (minimum of +1).\n\nFrost Giant. Immediately after you cast any of your Mark of the Ordning spells, you gain temporary hit points equal to your Constitution modifier (minimum of 1). If the spell is Armor of Agathys, you instead increase its temporary hit points by an amount equal to your Constitution modifier (minimum of 1).\n\nHill Giant. Immediately after you cast any of your Mark of the Ordning spells, you can target up to two creatures within 5 feet of you that you can see. Each target must succeed on a Strength saving throw against your spell save DC or be pushed a number of feet away from you equal to 5 + your Constitution modifier (minimum of +1). A target can choose to fail this save.\n\nStone Giant. Immediately after you cast any of your Mark of the Ordning spells, you gain a bonus to AC equal to your Constitution modifier (minimum of +1) until the end of your next turn.\n\nStorm Giant. Immediately after you cast any of your Mark of the Ordning spells, up to three creatures of your choice that you can see within 30 feet of you take lightning damage equal to your Constitution modifier (minimum of 1).\n\n"}],"14":[{"featuretext":"Rage of Fallen Ostoria\n\nStarting at 14th level, you gain the ability to channel the souls of your ancestors into your physical form. When you start casting a sorcerer spell on your turn and expend a spell slot, you can increase your size by one category – from Medium to Large, for example. This increase lasts for 1 minute. It ends early if you die or are incapacitated. Until it ends, you gain the following benefits:\n\n• Your current hit points and your hit point maximum both increase by 1 per sorcerer level.\n• Your reach increases by 5 feet.\n• Your walking speed increases by 5 feet.\n• You have advantage on Strength checks and Strength saving throws.\n• You gain a bonus to the damage rolls of your melee weapon attacks; the bonus equals your Constitution modifier (minimum of +1).\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest.\n\n"}],"18":[{"featuretext":"Blessing of the All Father\n\nAt 18th level, your Constitution score increases by 2, up to a maximum of 22.\n\nIn addition, you can now use Rage of Fallen Ostoria twice between rests, but no more than once on a turn. If you use that feature while under its effects, its increases to your size, hit points, reach, and walking speed are cumulative.\n\n"}]}},{"name":"Bond of the Wild","class":"Soul Binder","level":{"1":[{"featuretext":"Bond of the Wild\n\nYou are in touch with nature itself and have offered something of yourself to it. In return, you are given a trusty animal companion that protects you and carries out your orders. Your bond with the beast makes you inseparable.\n\nBeast Companion\n\nMedium beast, unaligned\n\nArmor Class 11 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d8 (or 5) + its Constitution modifier per soul binder level\n\nHit Die 1d8 per soul binder level\n\nSpeed 30 ft.\n\nSTR,DEX,CON,INT,WIS,CHA( - )( - )( - )3 (-4)12 (+1)10 (+0)\n\nLanguages Understands the languages of its binder, but can't speak\n\nActions\n\nClaws. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft.,\none target. Hit: 1d8 + its Strength modifier bludgeoning, piercing or slashing damage.\n\nWarrior of the Wild\n\nWhen you choose this bond at 1st level, you gain proficiency with martial weapons and medium armor. Additionally your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.\n\nBeast Companion\n\nAlso at 1st level, you gain the company of a loyal beast. It has the appearance of your choice, uses the Beast Companion stat block and gains one of the following features of your choice:\n\nKeen Hearing and Smell. The beast has advantage on Wisdom (Perception) checks that rely on hearing or smell.\n\nSneaky. The beast has expertise in Dexterity (Stealth) checks.\n\nNocturnal. The beast gains darkvision out to a range of\n60 feet.\n\nAmphibious. The beast can breathe air and water. It also gains a swimming speed equal to its walking speed.\n\nLeaper. The beast's long jump is up to 20 feet and its high jump is up to 10 feet, with or without a running start.\n\nSpider Climb. The beast can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.\n\nBig Boned. The beast's size is Large.\n\nYou may pick one additional trait at 7th and 11th level.\n\nYou also get to allocate the following stats for your beast:\n16, 14 and 12. You can place them in the beast's Strength, Dexterity and Constitution scores.\n\nYou can communicate basic ideas to your beast with a few hand signs and nods.\n\n"}],"3":[{"featuretext":"Run With the Pack\n\nWhen you reach 3rd level, you and your beast know each other's every move and you perform best in combat when you are together. When you and your beast are within 10 feet of each other and neither of you are incapacitated, you gain the following benefits:\n\nWhen your beast hits a creature with an attack, you can use your reaction to make one weapon attack against the same creature.\n\nIf one of you is prone, it only takes 5 feet of movement to stand up again.\n\n"}],"7":[{"featuretext":"Bestial Evolution\n\nAt 7th level, your beast is infused with magic via your bond and can evolve itself in different ways. You can pick one of the following features to grant to your beast:\n\nFast Flier. Your beast gains a flying speed equal to double its walking speed. It also gains Flyby, meaning it doesn't provoke opportunity attacks when it flies out of an enemy's reach.\n\nCharger. Your beast gains an extra 15 feet walking speed. Additionally, if the beast moves at least 20 feet straight toward a target and then hits it with an attack on the same turn, the attack deals an extra 2d10 damage to the target. If the target is a creature, it must succeed on a Strength saving throw or be knocked prone.\n\nRelentless Rampager. When the beast is reduced to 0 hit points but not killed outright, it can drop to 1 hit point instead. It can't use this feature again until you finish a long rest. Additionally when the beast reduces a creature to 0 hit points with a melee attack, the beast can use its reaction to move up to half of its speed and make one attack. If it hits with that attack, it gains half of the damage dealt as temporary hit points.\n\n"}],"11":[{"featuretext":"Nature's Commands\n\nAt 11th level, you can command your beast with the guidance of nature itself. The following commands are added to your Edict options:\n\nTooth and Nail. Your beast can use its action to make a melee attack against each creature of its choice within 5 feet of it, with a separate attack roll for each target.\n\nDodge and Evade. Until the end of your next turn, whenever your beast is hit by an attack that it can see, it can use its reaction to reduce the incoming attack's damage by half.\n\n"}],"15":[{"featuretext":"Ultimate Evolution\n\nWhen you reach 15th level, your beast has surpassed any limits you could imagine. Your essence is infused within its body, pushing it to the peak of its evolution.\n\nIt gains two additional traits from your Beast Companion feature and one additional option from your Bestial Evolution feature.\n\n"}]}},{"name":"Bond of the Elements","class":"Soul Binder","level":{"1":[{"featuretext":"Bond of the Elements\n\nYou are in balance with the world, and the elements that surround you. You are so closely bonded with them that you can manifest an elemental avatar, using part of your soul to anchor it to this plane of existence.\n\nAid of the Elements\n\nWhen you choose this bond at 1st level, the elements themselves have granted you the aid of an elemental avatar, that takes on a different shape depending on which element you are attuned to. The avatar has the appearance of your choice and uses the Elemental Avatar stat block.\n\nWhen you gain this feature you may pick one of the following elemental types to attune to: fire, cold, lightning or thunder. On your turn you can change the attuned elemental type of your avatar as an action.\n\nEach element will also give your avatar a set of unique traits and a cantrip that it can cast. The different elements are detailed in the Elements table below.\n\nElemental Avatar\n\nLarge elemental, unaligned\n\nArmor Class 11 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d10 (or 6) + its Constitution modifier per soul binder level\n\nHit Die 1d10 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA16 (+3)14 (+2)14 (+2)6 (-2)12 (+1)6 (-2)\n\nSenses darkvision 60 ft.\n\nLanguages Understands the languages of its binder, but can't speak\n\nDamage Resistance: attuned elemental damage type\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d10 + its Strength modifier damage of your current attuned type.\n\nElements\n\nElement\/damage typeTraitCantripAir\/lightningThe avatar has a flying (hover) speed equal to its walking speed.gustEarth\/ThunderThe avatar can burrow through nonmagical, unworked earth and stone. While doing so, the elemental doesn't disturb the material it moves through.mold earthFire\/fireThe avatar sheds bright light in a 30-foot radius and dim light in an additional 30-feet radius.control flamesWater\/coldThe avatar has a swimming speed equal to its walking speed, and has the Amphibious trait.shape water\n\nExpanded Spell List\n\nAs your soul becomes one with the elements and nature itself, you gain access to more spells. These spells are always prepared and don't count against the number of spells you can prepare each day. They are soul binder spells for you.\n\nElements Bond Spells\n\nSpell LevelSpells\n1st absorb elements\n2nd dragon's breath\n3rd protection from energy\n4th elemental bane\n5th conjure elemental"}],"3":[{"featuretext":"Elemental Burst\n\nAt 3rd level, your avatar has learned to harness its elemental powers with great fury. As an action, it can burst elemental force all around it.\n\nEvery creature of its choice within 10 feet of it must make a saving throw which is dependent on the element of the attack, taking 3d8 damage of your current attuned elemental type on a failed save, or half as much on a successful one. Additionally, they suffer one of the following effects, dependent on what element you are attuned to:\n\nAir. Any creature within the area must succeed on a Strength saving throw or be pushed 15 feet away from the avatar.\n\nEarth. Any creature within the area must succeed on a Strength saving throw or be knocked prone.\n\nFire. Any creature within the area must succeed on a Dexterity saving throw or get charred, imposing disadvantage on their next attack.\n\nWater. Any creature within the area must succeed on a Constitution saving throw or have their speed reduced to 0 feet, until the end of your next turn.\n\nOnce your avatar has used this feature it must finish a long rest before it can do so again.\n\nThe damage of this feature increases by 1d8 as you gain levels in this class. The damage improves to 4d8 at 7th level, 5d8 at 11th level, 6d8 at 15th level and 7d8 at 18th level.\n\n"}],"7":[{"featuretext":"Boon of Nature\n\nWhen you reach 7th level, your soul is infused with the essence of nature through your avatar. As an action, you can use this power to empower your avatar. It keeps this boon for 1 minute. The boon has a different effect depending on what element you are attuned to, and the boon will not change even if you attune to a different element while it is in effect.\n\nAir. Your avatar runs swift like lightning. Its speed becomes 90 feet, and opportunity attacks against it have disadvantage.\n\nEarth. Your avatar hardens its rocky carapace. It gains temporary hit points equal to double your Charisma modifier at the start of its turns.\n\nFire. Your avatar strikes with precision. It can add your Charisma modifier to its attack rolls.\n\nWater. Your avatar freezes enemies into place. It can attempt to grapple a creature within 5 feet of it as a bonus action. While grappled by this feature, the grappled creature is also restrained. The avatar can only have one creature grappled like this at a time.\n\nOnce you have used this feature you must finish a long rest before you can do so again.\n\n"}],"11":[{"featuretext":"Edicts of the Elements\n\nAt the 11th level, you can command your avatar to unleash their elemental powers. The following commands are added to your Edict options:\n\nElemental Bolt. You command your avatar to hurl a bolt of elemental energy. It must use its reaction to send a bolt flying in a direction of your choice, flying in a 30-feet long and 5-feet wide line.\n\nWhen it hits a creature, that creature must succeed on a Dexterity saving throw or take 4d8 damage of your current attuned type and the bolt disperses. If creature does succeed, the bolt keeps flying until it hits another creature or travels its full distance.\n\nPunch of the Avatar. Your avatar gathers elemental energy in its hand, unleashing its energy when next striking a foe. If a creature is hit by your elemental's attack until the end of this turn, it takes an additional 3d8 damage of your current attuned type and must succeed on a saving throw determined by your attuned element. On a failed save it is subjected to a negative effect. The saving throw and its effect is identical to the one in your Elemental Burst feature.\n\n"}],"15":[{"featuretext":"Merged Attunement\n\nWhen you reach 15th level, your avatar can take on a form of multiple elements, combining the strength of both. You can now attune to two elements at once. Your avatar gains resistance to both damage types associated with said elements. When your elemental attacks, it can choose between the two damage types for its attacks. It does the same for its Edict options and when it uses Elemental Burst. It gains both traits and cantrips from your attuned elements. When you use your Boon of Nature feature, it gains the effects of both elements as well.\n\nWhen you use an action to change your avatar's elements, you can choose to change both at once.\n\n"}]}},{"name":"Bond of the Playful Fey","class":"Soul Binder","level":{"1":[{"featuretext":"Bond of the Playful Fey\n\nThere are places where the barrier between the Material Plane and the Feywild is thin, and sometimes creatures from one plane end up in another. Soul binders have found that creatures from the Fey make excellent companions. Maybe you got your companion as a gift from an Archfey or maybe the two of you became friends naturally and made a bond.\n\nTrickster Spirit\n\nWhen you choose this bond at 1st level, you make a bond with a playful creature from the Feywild. The fey has the appearance of your choice and uses the Fey Companion stat block. Additionally, as your soul is bonded with the creature, you learn to speak its language. You can speak, read and write Sylvan.\n\nFey Companion\n\nMedium fey, chaotic neutral\n\nArmor Class 11 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d8 (or 5) + its Constitution modifier per soul binder level\n\nHit Die 1d8 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA16 (+3)14 (+2)12 (+1)8 (-1)10 (+0)13 (+1)\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d10 + its Strength modifier bludgeoning, piercing or slashing damage.\n\nExpanded Spell List\n\nAs you bind with this magical creature from another plane, you are able to have more spells available to you. These spells are always prepared and don't count against the number of spells you can prepare each day. They are soul binder spells for you.\n\nPlayful Fey Bond Spells\n\nSpell LevelSpells\n1st faerie fire\n2nd enthrall\n3rd major image\n4th hallucinatory terrain\n5th dream"}],"3":[{"featuretext":"Trickster's Dance\n\nAt 3rd level, your companion has learned to use their illusory powers to confuse and play tricks on their enemies.\n\nWhenever your companion is hit with a melee weapon attack, it can use its reaction to reduce the damage of the attack by 1d8 + your Charisma modifier + your soul binder level.\n\nIf the damage is reduced to 0, your companion can force the enemy to make a Wisdom saving throw. On a failed save, the creature takes psychic damage equal to the original amount of damage their attack would have dealt.\n\nYour fey can use this feature a number of times equal to your Charisma modifier (minimum 1). It regains all expended uses when you finish a long rest.\n\n"}],"7":[{"featuretext":"Mystical Evasiveness\n\nWhen you reach 7th level, you have learned to channel the powers from the Feywild and can use that energy to form a protective veil over your companion.\n\nWhenever your companion is forced to make a saving throw due to a spell or another magical effect, you can use your reaction to give your companion advantage on the saving throw if you are within 30 feet of it.\n\n"}],"11":[{"featuretext":"Jester's Edicts\n\nAt 11th level, you can command your companion to pull playful maneuvers. The following commands are added to your Edict options:\n\nHide and Seek. You command your companion to hide itself from preying eyes. On its next turn it can use a bonus action to turn invisible until the start of its next turn. The invisibility is broken if the companion makes an attack or otherwise harms another creature.\n\nHop and Skip. You command your companion to blink in and out of the Fey, jumping to a different position. On its turn, your companion can use its bonus action to teleport up to 30 feet to a point that it can see.\n\n"}],"15":[{"featuretext":"Fooling Copycat\n\nWhen you reach 15th level, your companion resonates with you so well, that it can mimic your every move.\n\nAs a bonus action, your companion can create an illusion over itself that is identical you, including the clothes and equipment you are currently wearing. The illusion lasts for 10 minutes or until the companion ends it as a bonus action. While the illusion is active, the companion gains the following benefits:\n\nOn its turn it can cast soul switch without expending a spell slot or material components.\n\nWhile the two of you are within 5 feet of each other, you both have advantage on attack rolls, and creatures short of truesight have disadvantage on attacks against the two of you.\n\nThe companion can speak any of your languages using your voice.\n\nYou and your companion can communicate telepathically as long as you are on the same plane of existence\n\nOnce it has used this feature it must finish a short or long rest before it can do so again.\n\n"}]}},{"name":"Bond of the Divine","class":"Soul Binder","previewtext":"Sometimes gods grant gifts to worthy mortals. They can take all shapes and forms and you have been given a boon in the form of a friend and protector for life.\n\nSoul binders that make a bond with a celestial are often followers of the god that the celestial used to serve, traveling the world and spreading the word of that god.\n\n","level":{"1":[{"featuretext":"Guardian of the Heavens\n\nWhen you choose this bond at 1st level,, you bind your soul with a celestial creature. The celestial has the appearance of your choice and uses the Holy Guardian stat block.\n\nDivine Warrior\n\nAt 1st level you gain proficiency with medium armor and martial weapons. You can also speak, read and write Celestial. Additionally your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.\n\nHoly Guardian\n\nMedium celestial, lawful good\n\nArmor Class 13 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d10 (or 6) + its Constitution modifier per soul binder level\n\nHit Die 1d10 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA15 (+2)13 (+1)16 (+3)8 (-1)11 (+0)13 (+1)\n\nSenses darkvision 60 ft.\n\nDamage Resistances necrotic, radiant\n\nLanguages Celestial, Understands the other languages known by its binder, but can't speak them.\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d8 + its Strength modifier bludgeoning, piercing or slashing damage.\n\n"}],"3":[{"featuretext":"Gift of Life\n\nWhen you reach 3rd level, your companion has learned to be selfless and giving, sacrificing part of its life energy to heal you or your companions.\n\nYour guardian can use a bonus action to deal damage to itself, in turn healing a creature of its choice within 5 feet of it. This damage ignores temporary hit points, immunities and resistances. The creature regains hit points equal to the damage dealt.\n\n"}],"7":[{"featuretext":"Inspiring Heal\n\nAt 7th level, you know how to mend wounds and inspire your guardian to perform better in combat.\n\nYou learn the healing word spell. You always have it prepared, and it doesn't count against the number of spells you can prepare each day. It counts as a soul binder spell for you.\n\nAdditionally, whenever you cast healing word on your guardian, it can use its reaction to make a melee weapon attack.\n\n"}],"11":[{"featuretext":"Edicts of Radiance\n\nStarting at 11th level, you can command your guardian with a voice that can pierce the heavens. The following commands are added to your Edict options:\n\nBlinding Light. You command your guardian to unleash its inner radiant light. On its turn it can use its action to release its blinding energy. Creatures of its choice within 15 feet of it must succeed on a Constitution saving throw or be blinded until the end of your next turn.\n\nSpread Your Wings. Your words inspire your guardian to fly as high as the sky. It has a flying speed of 60 feet and it doesn't provoke opportunity attacks until the start of your next turn.\n\n"}],"15":[{"featuretext":"Death Prevention\n\nWhen you reach 15th level, your guardian have gained the powers to protect people from the grasp of death.\n\nIf a creature within 60 feet of your companion drops to 0 hit points or fails a death saving throw, your guardian can use its reaction to teleport to an unoccupied space within 5 feet of that creature and breathe new life into them. The creature regains 10d12 hit points.\n\nOnce you use this feature, you can't do so again until you finish a long rest.\n\n"}]}},{"name":"Oath of the Watcher","class":"Paladin","previewtext":"Paladins who vow the Oath of the Watchers seek to protect the moral realm from the predations of extraplanar creatures, many of which can lay waste to mortal soldiers. Thus, the Watchers hone their minds, spirits, and bodies to be the ultimate weapons against such threats.\n\nPaladins who follow the Watchers' oath are ever vigilant in spotting the influence of extraplanar forces, often establishing a network of spies and informant to gather information on suspected cults. To a Watch, keeping a healthy suspicion and awareness about one's surroundings is as natural as wearing armor in battle.\n\n","level":{"3":[{"featuretext":"Channel Divinity\n\nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\nAdbjure the Extraplanar You can use your Channel Divinity to castigate unwordly beings. As an action, you present your holy symbol and each elemental, fey, fiend, or aberration within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.\n\nWatcher's Will You can use your Channel Divinity to invest your presence with the warding power of your faith. As an action, you can choose a number of creatures you can see within 30 feet of you, up to a number equal to your Charisma modifier (minimum of one creature). For 1 minute, all the chosen creatures have advantage on Intelligence, Wisdom, and Charisma saving throws.\n\n"},{"featuretext":"Aura of the Sentinel\n\nYou emit an aura of alertness while you aren't incapacitated. When you and any creature of your choice within 10 feet of you rolls initiative, you each gain a bonus to initiative equal to your Charisma modifier (minimum of +1).\n\nAt 18th level, the range of this aura increases to 30 feet.\n\n"}],"15":[{"featuretext":"Vigilant Rebuke\n\nAt 15th level, you've learned how to magically chastise anyone who dares cast unwanted spells at you and your wards. Whenever you or a creature you can see within 30 feet of you succeeds on a saving throw against a spell, you can use your reaction to deal 2d8 + your Charisma modifier force damage to the spellcaster.\n\n"},{"featuretext":"Mortal Bulwark\n\nYou manifest a spark of your diety's power in defense of your sacred oath. As a bonus action, you gain the following benefits for 1 minute:\n\n• You gain truesight in a 120-foot radius.\n\n• You have advantage on attack rolls against elementals, fey, fiends, and aberrations.\n\n• When you hit a creature with an attack and deal damage to it, you can also force it to make a Charisma saving throw. On a failed save, the creature is magically banished to its native plane of existence if it's currently not there. On a successful save, the creature can't be banished by this feature for 24 hours.\n\nOnce you use this bonus action, you can't use it again until you finish a long rest.\n\n"}]}},{"name":"Rune Knight","class":"Fighter","level":{"3":[{"featuretext":"Rune\tMagic\r\n3rd-level\tRune\tKnight\tfeature\r\nYou\tlearn\thow\tto\tuse\trunes\tto\tenhance\tyour\t\r\ngear.\tWhen\tyou\tgain\tthis\tfeature,\tyou\tlearn\thow\t\r\nto\tinscribe\ttwo\trunes\tof\tyour\tchoice\ton\tweapons,\t\r\narmor,\tor\tshields (see\t“Rune\tOptions”).Whenever\tyou\tfinish\ta\tlong\trest,\tyou\tcan\ttouch\t\r\na\tnumber\tof\tobjects equal\tto\tthe\tnumber\tof\t\r\nrunes\tyou\tknow, and\tyou\tinscribe\ta\tdifferent\t\r\nrune\tonto\teach\tof\tthe\tobjects.\tTo\tbe\teligible,\tan\t\r\nobject\tmust\tbe\ta\tweapon,\ta\tsuit\tof\tarmor,\tor\ta\t\r\nshield.\r\nYour\trune\tremains on\tan\tobject\tuntil\tyou\tfinish\t\r\na\tlong\trest,\tand\tan\tobject\tcan\tbear\tonly\tone\tof\t\r\nyour\trunes.\r\nEach\ttime\tyou\tgain\ta\tlevel\tin\tthis\tclass,\tyou\tcan\t\r\nreplace\tone\trune\tyou\tknow\twith\ta\tdifferent\tone."},{"menu":{"name":"Rune\tOptions","selections":"2","entries":[{"name":"Haug\t(Hill\tRune).","effects":[{"featuretext":"This\trune’s\tmagic\tbestows\ta\t\r\nresilience\treminiscent\tof\ta\thill\tgiant.\tWhile\t\r\nwearing\tor\tcarrying\tan\tobject\tinscribed\twith\tthis\t\r\nrune,\tyou\thave\tadvantage\ton\tsaving\tthrows\t\r\nagainst\tbeing\tpoisoned,\tand\tyou\thave\tresistance\t\r\nagainst\tpoison\tdamage.\r\nIn\taddition,\tyou\tcan\tinvoke the rune as\ta\tbonus\t\r\naction,\tgaining\tresistance\tto\tbludgeoning,\t\r\npiercing,\tand\tslashing\tdamage\tfor\t1\tminute. Once\t\r\nyou\tinvoke\tthe\trune,\tyou\tcan’t\tdo\tso\tagain\tuntil\t\r\nyou\tfinish\ta\tshort\tor\tlong\trest."}]},{"name":"Ild\t(Fire\tRune). ","effects":[{"featuretext":" This\trune’s\tmagic\tchannels\tthe\t\r\nmasterful\tcraftsmanship of\tfire\tgiant smiths.\t\r\nWhile\twearing\tor\tcarrying\tan\tobject\tinscribed\t\r\nwith\tthis\trune,\tyour\tproficiency\tbonus\tis\tdoubled\t\r\nfor\tany\tability\tcheck\tyou\tmake\tthat\tuses\tyour\t\r\nproficiency\twith\ta\ttool.\r\nIn\taddition,\twhen\tyou\thit\ta\tcreature\twith\ta\t\r\nweapon\tattack,\tyou\tcan\tinvoke\tthe\trune\tto\t\r\nsummon\tfiery\tshackles:\tthe\ttarget\tmust\tsucceed\t\r\non\ta\tStrength\tsaving\tthrow\tor\tbe\trestrained\tfor\t1\t\r\nminute.\tWhile\trestrained\tby\tthe\tshackles,\tthe\t\r\ntarget\ttakes\t2d6\tfire\tdamage\tat\tthe\tstart\tof\teach\t\r\nof\tits\tturns.\tThe\ttarget\tcan\trepeat\tthe\tsaving\t\r\nthrow\tat\tthe\tend\tof\teach\tof\tits\tturns,\tbanishing\t\r\nthe\tshackles\ton\ta\tsuccess. Once\tyou\tinvoke\tthe\t\r\nrune,\tyou\tcan’t\tdo\tso\tagain\tuntil\tyou\tfinish\ta\t\r\nshort\tor\tlong\trest."}]},{"name":"Ise\t(Frost\tRune). ","effects":[{"featuretext":"This\trune’s\tmagic\tevokes a\t\r\nfrost\tgiant’s\tstoic\tcalm.\tWhile\twearing\tor\t\r\ncarrying\tan\tobject\tinscribed\twith\tthis\trune,\tyou\t\r\nhave\tadvantage\ton\tWisdom\t(Animal\tHandling)\t\r\nchecks\tand\tCharisma\t(Intimidation)\tchecks.\r\nIn\taddition,\tyou\tcan\tinvoke\tthe\trune\tas\ta\tbonus\t\r\naction\tto\tincrease\tyour\tStrength\tscore\tby\t2\tfor\t\r\n10\tminutes.\tThis\tincrease\tcan\tcause\tyour\tscore\t\r\nto\texceed\t20,\tbut\tnot\t30. Once\tyou\tinvoke\tthe\t\r\nrune,\tyou\tcan’t\tdo\tso\tagain\tuntil\tyou\tfinish\ta\t\r\nshort\tor\tlong\trest."}]},{"name":"Skye\t(Cloud\tRune)","effects":[{"featuretext":"This\trune’s\tmagic\t\r\nemulates\tthe\tdeceptiveness\tof\ta\tcloud\tgiant.\t\r\nWhile\twearing\tor\tcarrying\tan\tobject\tinscribed\t\r\nwith\tthis\trune,\tyou\thave\tadvantage\ton\tDexterity\t\r\n(Sleight\tof\tHand)\tchecks\tand\tCharisma\t\r\n(Deception)\tchecks.\r\nIn\taddition,\twhen\tyou\tor\ta\tcreature\tyou can\t\r\nsee\twithin\t30\tfeet\tof\tyou\tis\thit\tby\tan\tattack\troll,\t\r\nyou\tcan\tuse\tyour\treaction\tto\tinvoke\tthe\trune\tand\t\r\ncause\tthat\tattack\tto\ttarget\ta\tdifferent\tcreature\t\r\nwithin\t30\tfeet\tof\tyou\t(other\tthan\tthe\tattacker),\t\r\nusing\tthe\tsame\troll.\tThis\tmagic\tcan\ttransfer\tthe\t\r\nattack\tregardless\tof\tthe\tattack’s\trange.\tOnce\tyou\t\r\ninvoke\tthe\trune,\tyou\tcan’t\tdo\tso\tagain\tuntil\tyou\t\r\nfinish\ta\tshort\tor\tlong\trest."}]},{"name":"Stein\t(Stone\tRune). ","effects":[{"featuretext":"This\trune’s\tmagic\t\r\nchannels\tthe\tinsightfulness\tof\ta\tstone\tgiant.\r\nWhile\twearing\tor\tcarrying\tan\tobject\tinscribed\t\r\nwith\tthis\trune,\tyou\thave\tadvantage\ton\tWisdom\t\r\n(Insight)\tchecks,\tand you\thave\tdarkvision\tout\tto\t\r\na\trange\tof\t60\tfeet.\tIf\tyou\talready\thave\tdarkvision,\t\r\nits\trange\tincreases\tby\t30\tfeet.\r\nIn\taddition,\twhen\ta\tcreature\tyou\tcan\tsee\tends\t\r\nits\tturn\twithin\t30\tfeet\tof\tyou, you\tcan\tuse\tyour\t\r\nreaction\tto invoke\tthe\trune and force\tthe\t\r\ncreature\tto\tmake a\tWisdom\tsaving\tthrow.\tUnless\t\r\nthe\tsave\tsucceeds,\tthe\tcreature is charmed\tby\t\r\nyou\tfor\t1\tminute.\tWhile\tcharmed in this\tway,\tthe\t\r\ncreature\thas\ta\tspeed\tof\t0\tand\tis\tincapacitated,\t\r\ndescending into\ta\tdreamy stupor.\tThe\teffect\tends\t\r\nif\tthe\tcharmed\tcreature\ttakes\tany\tdamage\tor\tif\t\r\nsomeone\telse\tuses\tan\taction\tto\tshake\tthe\t\r\ncreature\tout\tof\tits\thaze. Once\tyou\tinvoke\tthe\t\r\nrune,\tyou\tcan’t\tdo\tso\tagain\tuntil\tyou\tfinish\ta\t\r\nshort\tor\tlong\trest."}]},{"name":"Uvar\t(Storm\tRune). ","effects":[{"featuretext":"Using\tthis\trune,\tyou\tcan\t\r\nglimpse\tthe\tfuture\tlike\ta\tstorm\tgiant.\tWhile\t\r\nwearing\tor\tcarrying\tan\tobject\tinscribed\twith\tthis\t\r\nrune,\tyou\thave\tadvantage\ton\tIntelligence\t\r\n(Arcana)\tchecks,\tand\tyou\tcan’t\tbe\tsurprised\tas\t\r\nlong\tas\tyou\tare\tnot\tincapacitated.\r\nIn\taddition,\tyou\tcan\tinvoke\tthe\trune\tas\ta\tbonus\t\r\naction\tto\tenter\ta\tprophetic\tstate for\t1\tminute oruntil\tyou’re\tincapacitated.\tUntil\tthe\tstate ends,\t\r\nwhen\tyou\tor\tanother\tcreature\tyou\tcan\tsee\twithin\t\r\n60\tfeet\tof\tyou\tmakes\tan\tattack\troll,\ta\tsaving\t\r\nthrow,\tor\tan ability\tcheck,\tyou\tcan\tuse\tyour\t\r\nreaction\tto\tcause\tthe\troll\tto\thave\tadvantage\tor\t\r\ndisadvantage. Once\tyou\tinvoke\tthe\trune,\tyou\t\r\ncan’t\tdo\tso\tagain\tuntil\tyou\tfinish\ta\tshort\tor\tlong\t\r\nrest."}]}]}},{"featuretext":"Giant\tMight\n3rd-level\tRune\tKnight\tfeature\r\nYou\tcan\timbue yourself\twith\tthe\tmight\tof\tgiants.\r\nAs\ta\tbonus\taction,\tyou\tmagically gain\tthe\t\r\nfollowing\tbenefits,\twhich\tlast\tfor\t1\tminute:\r\n• If\tyou\tare\tsmaller\tthan\tLarge,\tyou\tbecome\t\r\nLarge, along\twith\tanything\tyou\tare\twearing.\tIf\t\r\nyou\tlack\tthe\troom\tto\tbecome\tLarge,\tyour\tsize\t\r\ndoesn’t\tchange.\r\n• You\thave\tadvantage\ton\tStrength\tchecks\tand\t\r\nStrength\tsaving\tthrows.\r\n• Your weapon\tattacks\tdeal\tan\textra\t1d6\t\r\ndamage.\r\nYou\tcan\tuse\tthis\tfeature\ttwice,\tand\tyou\tregain\t\r\nall\texpended\tuses\tof\tit\twhen\tyou\tfinish\ta\tlong\t\r\nrest."}],"7":[{"featuretext":"Defensive\tRunes\n7th-level\tRune\tKnight\tfeature\r\nYou\tlearn\tto\tinvoke\tyour\trune\tmagic\tto\tprotect\t\r\nyour\tallies.\tWhen another creature\tyou\tcan\tsee\t\r\nwithin\t60\tfeet\tof\tyou\tis\thit\tby\tan\tattack\troll,\tyou\t\r\ncan\tuse\tyour\treaction\tto\tgrant a\tbonus\tto\tthe\t\r\ncreature’s\tAC against\tthat\tattack.\tThe\tbonus\r\nequals\t1\t+ your\tIntelligence\tmodifier\t(minimum\t\r\nof\t+2).\r\nIn\taddition,\tyou\tlearn\tone\tnew\trune\tof\tyour\t\r\nchoice\tfrom\tthe\tRune\tMagic\tfeature (for\ta\ttotal\tof\t\r\nthree)."}],"10":[{"featuretext":"Great\tStature\n10th-level\tRune\tKnight\tfeature\r\nThe\tmagic\tof\tyour\trunes\tpermanently\talters\tyou.\t\r\nWhen\tyou\tgain\tthis\tfeature,\troll\t3d4.\tYou\tgrow\ta\t\r\nnumber\tof\tinches\tin\theight\tequal\tto\tthe\troll.\t\r\nMoreover,\tthe\textra\tdamage\tyou\tdeal\twith your\t\r\nGiant\tMight\tfeature\tincreases\tto\t1d8.\r\nIn\taddition,\tyou\tlearn\tone\tnew\trune\tof\tyour\t\r\nchoice\tfrom\tyour\tRune\tMagic\tfeature (for\ta\ttotal\t\r\nof\tfour)."}],"15":[{"featuretext":"Rune\tMagic\tMastery\n15th-level\tRune\tKnight\tfeature\r\nYou\tcan\tinvoke\teach\trune you\tknow from\tyour\t\r\nRune\tMagic\tfeature\ttwice,\trather\tthan\tonce,\tand\t\r\nyou\tregain\tall\texpended\tuses\twhen\tyou\tfinish\ta\t\r\nshort\tor\tlong\trest.\r\nIn\taddition,\tyou\tlearn\tone\tnew\trune\tof\tyour\t\r\nchoice\tfrom\tthe\tRune\tMagic\tfeature (for\ta\ttotal\tof\t\r\nfive)."}],"18":[{"featuretext":"Blessing\tof\tthe\tAll\tFather\n18th-level\tRune\tKnight\tfeature\r\nYou\tlearn\thow\tto\tshare\tyour\trune\tmagic\twith\t\r\nyour\tallies.\tWhen\tyou\tuse your\tGiant\tMight\t\r\nfeature, you\tcan\tchoose\tone\twilling\tcreature\tyou\t\r\ncan\tsee\twithin\t60\tfeet\tof\tyou.\tThe\tchosen\t\r\ncreature\talso\tgains\tthe\tbenefits\tof\tyour\tGiant\t\r\nMight\tfeature."}]}},{"name":"Oath of the Hellsworn","class":"Paladin","level":{"3":[{"featuretext":"CHANNEL DIVINITY\nWhen you take this oath at 3rd level. you gain\nthe following two Channel Divinity options,\nHellfire Weapon. As an action, you can\nwreathe a weapon that you are holding with the\nfires of hell, using your Channel Divinity. For 1\nminute, you add your Charisma modifier in fire\ndamage to the damage dealt by an attack from\nthat weapon (with a minimum bonus of +1), The\nweapon also emits bright light in a 10-foot radius\nand dim light 10 feet beyond that. If the weapon\nis not already magical, it becomes magical for\nthe duration.\nWhen you first use this Channel Divinity or as\nan action on a later turn, you may immediately\nend this effect by slamming your weapon into the\nground, unleashing a line of hellfire 30 feet long\nand 5 feet wide in the direction you are facing.\nEach creature in the line must make a Dexteritysaving throw against your spell save DC. A\ncreature takes 4d6 fire damage on a failed save,\nor half as much damage on a successful one. Al\n9th level this damage increases to 6d6, and at\n17th level the damage increases to 8d6.\nYou may otherwise end this effect with no\naction on your turn. If you are no longer holding\nor carrying this weapon, or if you fall uncon-\nscious, this effect ends.\nTurn Adversary. As an action. you presenta\nholy symbol of your contract-holder and speak\nan indictment of the enemies of Hell, using your\nChannel Divinity. Each aberration, celestial, el-\nemental, or non-lawful fiend that can see or hear\nyou within 30 feet of you must make a Wisdom\nsaving throw. If the creature fails ils saving\nthrow, it is turned for 1 minute or until it takes\ndamage.\nA turned creature must spend its turns trying\nto move as far away from you as it can, and it\ncan't willingly move to a space within 30 feet of\nyou. It also can't take reactions. For its action.it\ncan use only the Dash action or try to escape\nfrom an effect that prevents it from moving. If\nthere's nowhere to move the creature can use\nthe Dodge action"},{"featuretext":"FIENDISH SMITE\nAt 3rd level, your Divine Smite no longer deals\nradiant damage, and instead deals your choice of\neither fire or necrotic damage. You may choose\nwhich damage type to use each time you use\nyour Divine Smite feature."}],"7":[{"featuretext":"HELLGATE\nBeginning at 7th level, you can use your connec-\nlion to your contract to pull you and your allies\nthrough Hell itself, reappearing in a more tacti-\ncally advantageous location. As a bonus action.\nyou may teleport any willing, friendly creatures\nwithin a 10 foot radius of you (including your\nsell) to another location within 10 feet of your\noriginal position. Participants may occasionally\nfind this experience disturbing. You require a\nshort rest before you may use this ability again.\nAt 18th level, the distances listed in this ability\nincrease to 30 feet."}],"15":[{"featuretext":"BRIMSTONE BLESSING\nStarting at 15th level, you can channel the power\nof your contract to imbue you with an unnatural\nvitality. As a bonus action on your turn, you can\ngain an amount of temporary hit points equal to\nyour Charisma modifier (minimum 1).\nAdditionally, no matter what you say, magic\nthat would determine if you are telling the truth\nindicates you are being truthful, if you so choose,\nand you can't be compelled to tell the truth by\nmagic."}],"20":[{"featuretext":"INFERNAL INHERITOR\nAt 20th level, your contract nears completion,\nand you can assume the mantle of your contract-\nholder, fully commanding an aspect of their\npower. This immense power partially transforms\nyou, toughens your skin, and causes you to grow\na foot or two taller and sprout horns and claws.\nmaking you perceptibly reminiscent of your\ncontract-holder\nYou may transform using an action on your\nturn. If you do, you gain the following benefits for\n1 minute:\nDarkvision out to 120 feet, or increase any\nexisting Darkvision you have by 120 feet.\n• As a bonus action on your turn, you may make\nan attack with your claws, which are consid-\nered a finesse weapon with which you have\nproficiency. These claws deal 1do plus your\nStrength or Dexterity modifier slashing\ndamage on a hit. You may make this attack\neven if both of your hands are otherwise\noccupied.\n. Whenever you deal damage. you deal an\nadditional 2do fire damage.\n· Damage you deal ignores resistance and\nimmunity\n• You have resistance to bludgeoning, piercing-\nand slashing damage from nonmagical\nweapons that are not silver.\nOnce you use this feature, you can't use it again\nuntil you finish a long resi."}]}},{"name":"Thug","class":"Fighter","level":{"3":[{"featuretext":"STREETSMARTS\nWhen you choose this archetype at 3rd level you gain\nproficiency in the Stealth skill and two of the following:\nDeception, Insight, Intimidation, Performanoe. Sleight of\nHand disguise kit, forgery kit, poisoner's kit, or thieves' tools.\nIf you already have proficiency in Stealth, choose an\nadditional proficiency from the list above.\nYour proficiency bonus is doubled for any ability check you\nmake that uses the Stealth proficiency or any of the tool\nproficiencies above,\n\nTHIEVES' CANT\nAlso at 3rd level you gain the rogue class feature of the same\nname."}],"7":[{"featuretext":"BACKSTAB\nBeginning at 7th level, whenever you take the Attack action\non your turn, you can make one extra attack against one\nsurprised creature"}],"10":[{"featuretext":"DIRTY FIGHTING\nStarting at 10th level you have advantage on any ability check\nyou make to perform a special attack action in combat (such\nas grappling or shoving see PHB 195)"}],"15":[{"featuretext":"EYES BEHIND YOUR BACK\nBy 15th level backstabbing has become such a second nature\nto you that you are never caught with your guard down.\nIf you are surprised at the beginning of combat and aren't\nincapacitated, you can act normally on your first turn.\nHowever, you can't use your Backstab ability when you are\nsurprised"}],"18":[{"featuretext":"CHEATING MOVE\nStarting at 18th level before rolling the d20 for an attack roll.\nyou can choose to expend one use of Action Surge to score a\n20. Such an attack is always a critical hit."}]}},{"name":"way of the living weapon","class":"Monk","level":{"3":[{"featuretext":"Fists of Bone and Steel\n\nAt 3rd level, when you choose this tradition, your Martial Arts damage die increases for unarmed strikes. You can roll a d6 in place of the normal damage for your unarmed strike. This die changes to a d8 at 5th level; a d10 at 11th level; and a d12 at 17th level. This increased damage can only be applied to an unarmed strike, and not to a monk weapon.\n\n"},{"featuretext":"Martial Discipline\n\nStarting at 3rd level, when you adopt this tradition, choose a discipline and gain its feature.\n\nForged Heart. Your unarmed strikes are considered adamantine weapons. In addition, when you hit a creature with an unarmed attack, you can spend 1 ki point to cause it to make a Strength saving throw. On a failed save, the creature takes 2d6 additional damage of the same type as the unarmed strike and can be pushed up to 15 feet away from you. On a successful save, the creature only takes 1d6 points of additional damage and is not pushed back.\n\nNightmare Shroud. When you hit a creature with an unarmed attack, you can spend 1 ki point to assail it with fear, causing it to make a Wisdom saving throw. On a failed save, it takes 1d6 points of psychic damage and becomes frightened of you until the end of your next turn. If a creature succeeds on this save, they are immune to the fear effect of this ability for 24 hours.\n\nTraveler’s Blade. Your reach extends by 5 feet. Additionally, at the start of your turn you can expend up to 4 ki points to extend your reach further. For every point of ki you spend, your reach extends by an additional 5 feet until the end of your turn.\n\nWeretouched. Once per turn, when you hit a creature with an unarmed attack, you can spend 1 ki point to rend your target and inflict deep bleeding wounds. At the start of each of the creature’s turns for the next minute, it takes 1d4 points of slashing damage from this effect. The effect ends early if the creature has one or more hit points restored, if any creature uses its action to expend one use of a healer’s kit, or makes a successful Wisdom (Medicine) check with a DC equal to your ki save DC.\nWhen you reach 6th level, this slashing damage counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\n"},{"featuretext":"Mutable Strike\n\nYou have the power to alter your natural weapons, growing claws or reinforcing your fists. Starting at 3rd level, when you use Martial Arts to make an unarmed strike, you can choose whether you inflict slashing, bludgeoning, or piercing damage with the attack.\n\n"}],"6":[{"featuretext":"Manifest Blow\n\nStarting at 6th level, choose one of the following damage types when you finish a long rest: bludgeoning, piercing, slashing, cold, lightning, necrotic, psychic, or thunder. On your turn, the first creature you hit with an unarmed strike takes an additional 1d6 points of damage of that type. If you select bludgeoning, piercing, or slashing damage, it benefits from your Ki-Empowered Strikes class feature and counts as magical damage. Nightmare Shroud monks typically inflict psychic damage with this ability, Forged Heart monks enhance their bludgeoning damage, and Weretouched grow sharper claws. However, you can choose any damage type, regardless of your discipline(s).\n\n"}],"11":[{"featuretext":"Reflexive Adaptation\n\nStarting at 11th level, when you make a Strength (Athletics) or Dexterity (Acrobatics) check, you can spend 1 ki point to roll an additional d20. You can choose to use this ability after you roll the check, but before the outcome is determined. You choose which of the d20s is used for the ability check, omitting the highest if this check was rolled with disadvantage.\nIn addition, the extra damage dealt by the Manifest Blow class feature increases to 2d6.\n\n"}],"17":[{"featuretext":"Perfect Form\n\nAt 17th level, you transform your body to become a weapon of war. You gain a feature based on a discipline of your choice. You can choose the same discipline you selected at 3rd level or a different one.\n\nForged Heart. When you are hit by an attack, you can use your reaction to add your Wisdom modifier (minimum of 1) to your AC, including against the triggering attack. This effect lasts until the start of your next turn.\n\nNightmare Shroud. When you damage a creature with your Manifest Blow, excess psionic energy ripples to up to 3 different creatures of your choice within 30 feet. Those creatures take an amount of psychic damage equal to half of your monk level.\n\nTraveler’s Blade. When you deal piercing or slashing damage to a creature with an unarmed strike, it takes an additional 1d8 poison damage and must succeed on a Constitution saving throw against your ki save DC or be poisoned until the end of its next turn.\n\nWeretouched. When you use your Flurry of Blows, you can make three unarmed strikes as a bonus action instead of two. You have advantage on these attacks.\n\n"}]}},{"name":"The Bulwark","class":"Fighter","level":{"3":[{"featuretext":"Shield Smith\nWhen you adopt this specialization at 3rd level\n, you gain\nproficiency with Mason's Tools, Smith's tools or\nWoodcarver's Tools\nRedoubt\nAt 10th level, your Guardian Point dice becomes a dó.\nand the damage of your shield increases by one step.\nbecoming a do, or a d8 when used with a free hand."},{"featuretext":"Bastion\nStarting at 3rd level, you learn to use your defensive\nmight for more than just protection, when an attack\nmisses you, you gain one Guard Point represented by a\nd4, up to a maximum equal to your 1+ your Constitution\nmodifier (minimum of 2). These points last for 1 minute\nYou can use these dice in the following manners:\n. As a reaction to taking damage, you can expend any\nnumber of Guard Points, rolling the d4s and reducing\nthe damage by an equal amount.\nWhen a creature that you can see within 30 feet of you\nmakes an attack roll, you can use your reaction to\nexpend one Guard Point, rolling the die and\nsubtracting the number rolled from the creature's roll.\n. When you make an attack with your shield, you can\nexpend any number of Guard Points, adding the\nnumber rolled to the damage you deal,\nShield Bash\nAdditionally, at 3rd level, you learn to use your shield as a\nweapon. You gain proficiency in attacks made with\nShields, they deal 104 + your Strength bludgeoning\ndamage on a hit, or 1d6 if you have you other hand free"}],"7":[{"featuretext":"Shield Throw\nBeginning at 7th level, your proficiency with the shield\nreaches new heights, you may now treat your shield as a\nthrow weapon, with a range of 20\/60. The shield always\nreturns to your hand after the attack.\nMagical Aegis\nAt 7th level, if your shield has a magical bonus, you may\nnow apply the bonus to your attack and damage rolls, and\nthe shield count as magical for the purpose of overcoming\nresistance and immunity to nonmagical attacks and\ndamage."}],"10":[{"featuretext":"Redoubt\nAt 10th level, your Guardian Point dice becomes a dó.\nand the damage of your shield increases by one step.\nbecoming a do, or a d8 when used with a free hand."}],"15":[{"featuretext":"Torce Barrier\nShield Bash damage type\nYou may use your Shield Smith tools to alter\nyour shield during a long rest, adding spikes,\nor blades, causing the damage type to\nchoose to piercing or slashing.\nWhen you reach 15th level, you can, as a bonus action,\ncreate an area of safety for your allies. lasts for 1 minute\nor until you're incapacitated. For the duration, you and\nyour allies within 30 feet of you gain the benefits of half\ncover and have advantage on Strength saving throws.\nOnce you use this feature, you can't do so again until\nyou finish a long rest or until after you use your Second\nWind feature"}],"18":[{"featuretext":"Stronghold\nAr 18th level, your mastery with the shield allows you to\nsoften even the mightiest of blows. While you are\nconscious and wielding a shield, you reduce any\nbludgeoning, piercing, slashing, force, radiant and\nthunder damage by an amount equal to your proficiency\nbonus + your Constitution modifier"}]}},{"name":"Path of Arcane Fury","class":"Barbarian","spellprogression":"third","level":{"3":[{"featuretext":"WEATHFUL INCANTATIONS\nAt 3rd level you learn to channel small amounts of magic in spite of\nyour anger. You can cast and concentrate on cantrips while raging\nCasting a spell that forces a surving throw counts as an attack for the\npurposes of continuing rage. Once per turn while raging, you may\nadd your Rage Damage bonus to the damage roll of a spell\nAssign two sorcerer spells of Ist level or higher you know as\nrampage spells. You can cast and maintain concentration om\nrampage spells while ruging. You can assign additional sorcerer\nspells you know as rampage spells as shown in the Path of the\nArcane Fury Spellcasting table. You can reassign rampage Spells\nwhen you finish a short or long rest."}],"6":[{"featuretext":"ARCANE STRIKE\nStarting 6th level your inherent magical ability manifestas pure\nmagic energy when you strike. When you hit a creature with a melee\nweapon attack, you deal an additional 1d4 force damage.\nOnce per long rest, you can attempt to channel your arcane power\nwhen you rage. If you do so. for the duration of your rage you deal an\nadditional 304 force damage instead. When your rage ends\nSuffer one level of exhaustion\nIn addition, when you use your Reckless Allack feature, you also\ngain advantage on spell attacks. When you cast a cantrip as an\naction, you can make one melee weapon attack as part of the same\naction, cither before or after the casting of the contrip.\nSpell attack modifier your proficiency bonus +your\nConstitution modifier\nRitual Casting. You can cast any sorcerer spell you know as a ritual\nif that spell has the ritual tag\nSpellcasting Focus. You can use a simple or martial weapon as a\nspellcasting focus for your sorcerer spells."}],"10":[{"featuretext":"SORCEROUS STAMINA\nBeginning at 10th level your exposure to the arcane hardens your\ndefence againsi the more magical types of damage. While raging.\nyou have resistance to force lychic and thunder damage.\nWhen you enter your rage, or as a bonus action while raging, you\ncan expend a spell slot of Ist level or higher to gain resistance to\none type of damage per level of the spell slot expended. These\nresistances last for the duration of your race or until you use this\nfeature again."}],"14":[{"featuretext":"FORTUNATE RECOVERY\nAt 14th level you can channel your pure battle prowess into power\nfor your spells. Whenever you soorc a critical hit on a hostile\ncreature or reduce a hostile creature to his points, you recover one\n1st or 2nd level spell slot. If you have no expended 1st or And level\nslots to recover your next malee weapon attack deals an additional\n5d4 force damage."}]}},{"name":"Quickshot","class":"Rogue","level":{"3":[{"featuretext":"QUICK TRICKS\nWhen you choose this archetype at 3rd level you begin to\nIran how to master thrown weapons and can perform quick\ntricks while using them\nYou learn three quick tricks of your choice, mary of which\nenlance attack in same way. However, you can use only\nonc trick per attack. You Icarn onc aditional trick of your\ncho oe at 7th, 10th, and 15th level isach time you learn new a\ntrick, you can also replace on trick you know with a different\nOne\nYou have a number of quick tricks you can use equal to\nyour Sneak Attack die, and must finish a short or long rest to\nregain them"},{"featuretext":"SHARP STRIKER\nAl 3rd level you can draw or stowa thrown weapon with a\nfree action and attacking at long range\ndoes no impose disadvantage"}],"9":[{"featuretext":"STEADY HANDS\nAt 9th level you can throw a weapon wlaik an enemy is\nwithin 5 feet without taking clisadvantage on the attack roll\nFurther, you can forego your full ment to eatly your\na im. While aiming you double your proficiency bonus to your\nfirst thrown weapon attack made this turn."}],"13":[{"featuretext":"SHARPENED SENSES\nStarting at 13th level you gain proficiency with the\nAmatics and Perption skills If you are already proficient\nwith these skills, you add couble your proficiency bonus.\nAdditionally, you may engage in two weapon lighting with\nyour thrown weapons, as if you had the Two-Weapon Fighting\nstyle. You can add your ability modifier in the damage of the\noft-hand thrown weapon."}],"17":[{"featuretext":"QUICK SHOT\nMt 17th level while aiming as a result of your Steady Henda\nfeature, you can throw a scoond weapon as a part of your\naimed attack and are able to sneak attack with it, even if you\nhave already sneak attackel Ding saadik anakitional 3\/6\nto the ancak attack damage of both thrown weapon attacks.\nCitat cand le denta."}]}},{"name":"Aberrant Mind","class":"Sorcerer","level":{"1":[{"featuretext":"Starting at 1st level, your aberrant origin protects you from harm. Your body might have a coating of viscous slime, tough hide, scales, or an invisible psionic barrier (choose the form of protection when you gain this feature). Whatever form the protection takes, your AC equals 13 + your Dexterity modifier while you aren’t wearing armor."}],"6":[{"featuretext":"Beginning at 6th level, when you cast any of the spells gained from your Psionic Spells feature, you can cast it by expending a spell slot as normal or by spending a number of sorcery points equal to the spell’s level. If you cast the spell using sorcery points, it requires no components."},{"featuretext":"At 6th level, you gain resistance to psychic damage, and you have advantage on saving throws against being charmed or frightened."}],"14":[{"featuretext":"Beginning at 14th level, you can unleash the aberrant truth hidden within your flesh. As a bonus action, you can spend 1 or more sorcery points to magically transform your body for 1 minute. For each sorcery point you spend, you can gain one of the following benefits of your choice, the effects of which last until the transformation ends:\n\n• You gain a swimming speed equal to your walking speed and the ability to breathe water. Gills grow from your neck or fan out from behind your ears, your fingers become webbed, or you grow lashing cilia that extend through your clothing.\n• You gain a flying speed equal to your walking speed and can hover. As you fly, your skin glistens with mucus.\n• Your body, along with any equipment you are wearing or carrying, becomes slimy and pliable. You can move through any space as narrow as 1 inch without squeezing, and you can spend 5 feet of movement to escape from nonmagical restraints or being grappled.\n• Your eyes turn black or become writhing sensory tendrils. You are aware of the location of any hidden or invisible creature within 60 feet of you.\n\n"}],"18":[{"featuretext":"At 18th level, you become the focal point of a reality-warping anomaly. As an action, you can magically radiate a transparent, 20-foot-radius aura for 1 minute. This might take the form of a sphere of rippling psychic energy, a fluctuating amoebic gel, an extrusion of ephemeral parasites, or some other manifestation. Other creatures treat the aura as difficult terrain, and when they start their turn in it, they take 2d10 psychic damage. When you activate this feature, you can choose any number of creatures you can see to be unaffected by the aura.\n\nAs a bonus action, you can end the aura early. If you do so, you and any number of creatures you choose within the aura are teleported to a location you can see within 1 mile of you. Each creature must appear within 20 feet of you and in an unoccupied space. An unwilling creature that succeeds on a Charisma saving throw against your spell save DC is not teleported.\n\nOnce you use this feature, you can’t use it again until you finish a long rest.\n\n"}]}},{"name":"Hero Born","class":"Sorcerer","spellcastingability":"charisma","level":{"1":[{"featuretext":"BRAVE SOUL\nWhen you choose this origin at 1st level you soul remembers\nthe ways of war. You gain proficiency with simple weapons\nand martial meloc weapons.\nIn addition, this power imbues you with memories of ages\npast. You gain praticiency in the History skill\nHERO'S BIRTHRIGHT\nA: Ist level your power animates you in battle, allowing you to\ndefleci blows and wild weapons that you otherwise could\nnot. While you are wearing no armor and not wiclding a\nshiekh your AC equals 10+ your Dexterity modifier + your\nCharisma modific.\nDuring a long rest you can touch one melee weapon that\nYou are proficient with and that lacks the two banded\nproperty. That wapon is infused with your power and\nbecomes a heroic weapoo, which can be used as a\nspellcasting focus for your sorcerer spells When you attack\nwith your heroic weapon, you can use your Charisma\nmodifier, instead of Strength or Dexterity, for the attack and\ndamage rolls. You can't attack in this way if you are wearing\nheavy armor or using a shick and you can caly have ono\nheroic weapon at a time."}],"6":[{"featuretext":"SPELLBOUND STRIKES\nStarting at 6th level you begin to master magical combat. The\nfint creature you hit on each of your turns with a weapon\nattack takes extra damage equal to half your sorcerer level of\nthe same type dealt by the weapon. Ako on your turn, you can\nSpend sorcery points to enhance one melde weapon attack\nwith a Spellbound Strike. You learn two of the following\nStrikers. You leam one more at 14th and 18th level\nFleroic Strike. After you make your attack, you spend 1\nsorcery point to make other weapon attack as a bonus\naction\nEthereul Strike. Alter you make your attack you can spend\ncither I sorcery point to take the Disengage action is a bonus\naction, or 2 sorcery points to take the Dodge action as a bonus\naction.\nGlorious Strike. If your attack hits a creature, you can\nSpend 2 sorcery points to restore hit poenis equal to your\nCharisma modifier to 2 creatures of your choice within 10 feet\nof you.\nResounding Strike. If your attack hits a creature, you can\nspend 2 sorcery points to force it to make a Strength saving\nthrow. W it fails, it is knocked prone or pushed 10 feet away\nfrom you (our choice)"}],"14":[{"featuretext":"ARCANE WILL\nBeginning at 14th level you can hames the excess energy of\nyour magic into a bristling forcefield While you maintain\nconcentration on a spell you gain a bonito your Constitution\nsaving throws equal to your Charisma modifier\nWhen a creature hits you with an attack while you maintain\nconcentration on a spell you can use your reaction to deal\nId 10 force damage to it. If the attack breaks your\nconcentration, this damnge Increases to 1d10+hall your\nsorcerer level. You must be able to see a creature to use this\nreaction against it"}],"18":[{"featuretext":"LIVING LEGEND\nUpon reaching 18th level you fully embody the power and\nresolve of your herole ancestor. When you casi a sorcerer\nspell you sain temporary hit points equal to the spell level\nyour Charisma modifier. These liit poituls are lost after 10\nminutes\nIn addition, the cost of all your Spellbound Striker is\nfcduoed by 1 sorcery point."}]}},{"name":"The Undying","class":"Warlock","level":{"1":[{"featuretext":"Among the Dead\n\nStarting at 1st level, you learn the Spare the Dying cantrip, which counts as a warlock cantrip for you. You also have advantage on saving throws against any disease.\n\nAdditionally, undead have difficulty harming you. If an undead targets you directly with an attack or a harmful spell, that creature must make a Wisdom saving throw against your spell save DC (an undead needn't make the save when it includes you in an area effect, such as the explosion of Fireball). On a failed save, the creature must choose a new target or forfeit targeting someone instead of you, potentially wasting the attack or spell. On a successful save, the creature is immune to this effect for 24 hours. An undead is also immune to this effect for 24 hours if you target it with an attack or a harmful spell.\n"}],"6":[{"featuretext":"Defy Death\n\nStarting at 6th level, you can give yourself vitality when you cheat death or when you help someone else cheat it. You can regain hit points equal to 1d8 + your Constitution modifier (minimum of 1 hit point) when you succeed on a death saving throw or when you stabilize a creature with Spare the Dying.\n\nOnce you use this feature, you can't use it again until you finish a long rest.\n"}],"10":[{"featuretext":"Undying Nature\n\nBeginning at 10th level, you can hold your breath indefinitely, and you don't require food, water, or sleep, although you still require rest to reduce exhaustion and still benefit from finishing short and long rests.\n\nIn addition, you age at a slower rate. For every 10 years that pass, your body ages only 1 year, and you are immune to being magically aged.\n\n"}],"14":[{"featuretext":"Indestructible Life\n\nWhen you reach 14th level, you partake of some of the true secrets of the Undying. On your turn, you can use a bonus action to regain hit points equal to 1d8 + your warlock level. Additionally, if you put a severed body part of yours back in place when you use this feature, the part reattaches.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.\n\n"}]}},{"name":"Way of the Seirei","class":"Monk","level":{"3":[{"featuretext":"PLANAR SPIRIT\nYour training has called the attention of an extraplanar spirit\nthat helps you in combat. When you gain this feature at 3rd\nlevel, determine the spirit's appearance and a damage type\nfrom the \"Damage Types\" list (PHB, 196) associated with\nyour spirit. You determine the spirits appearance. As a bonus\naction, you can spend 2 ki points to manifest the spirit in your\nspace. The spirit is an incorporeal, magical entity and can\noccupy the same space as you. On your turn, you can\nmentally command your spirit to move up to 30ft in any\ndirection (no action required) If your spirit is ever more than\n15ft away from you at the end of your turn, it teleports back to\nyour space.\nThe spirits lasts until you take a short or long rest or you\ndismiss it as a bonus action. Your Spirit counts as magical\nfor the purposes of Dispell Magic and Anti Magic\nBarrier The Spell Level is equal to your Monk level\nrounded up (maximum of 9th level Spell)\nYou can use your spirit in the following ways:\n- Once per turn, when you luit with a melee attack\nmade with a monk weapon or an unarmed strike,\nyou can deal an extra 1d4 damage of the spirit\ntype. This damage changes as you gain monk\nlevels, as shown in the Martial Arts column of\nthe Monk table.\n- When you make a melee attack, any of your\nattacks can originate from you or your spirit.\nWhen you make an attack from the spirit, the\ndamage dealt by it is of the spirit's type.\n• When a creature that you can see within 5ft of\nyour spirit moves at least 5ft away from it, you can\nuse your reaction to make an opportunity attack against\nthat creature from your spirit.\n"},{"featuretext":"PLANAR FLURRY\nAlso at third level, when you hit a creature with one of the\nattacks granted by your flurry of blows, you can deal Planar\nSpirit's extra damage again."}],"6":[{"featuretext":"PLANAR ATTUNEMENT\nAt Gth level your connection to your spirit's nature has\ndeepened. You gain resistance to your spirit's damage type, in\naddition, when you deal your spirit's damage type, you ignore\nresistance to that damage.\nWhen you reach 17th level in this class, you also ignore\nimmunity to that damage type."}],"11":[{"featuretext":"PLANAR PROTECTOR\nAt 11th level, your spirit can protect you or your allies from\nharm. When you or a creature the spirit can see within 30ft of\nyou takes damage, you can use your reaction to send the\nspirit to their aid The target gains immunity to the triggering\ndamage and your spirit disappears."}],"17":[{"featuretext":"PLANAR EMPOWERMENT\nAt 17th level, you can funnel your ki into your spirit to give it\nextra power\nWhen you use Planar Spirit, you can spend extra ki points\nto empowerit. For every 3 extra ki points you spend the extra\ndamage from Planar Spirit increases by 1d10 (as shown in\nthe Martial Arts column on the Monk Table) to a maximum of\n9 extra ki points.\nPLANAR EMPOWERMENT CONVERTION\nAmount of extra ki amount of extra planar spirit\npoints dice\n1 extra die\n5\n2 extra dice\n3 extra dice\n11\n4 extra dice"}]}},{"name":"Meditating Soul","class":"Sorcerer","level":{"1":[{"featuretext":"MAGICAL ARTS\nAt 1st level you have learned martial arts alongside\nspellcasting, so you have discovered how to better defend\nyourself while casting your spells. While you aren't wearing\narmor or wielding a shield, you gain the following bencfits:\nYou can use a bonus action on your turn to take the Dodge\naction immediately before or after you cast a spell of 1st\nlevel or higher\n• You can replace the material components (those without a\ncost) of a spell with a somatic component represented by\nan appropriate martial arts technique instead (casting\ntimes longer than an action or bonus action would be\nrepresented by long martial arts demonstrations\nthroughout the casting time)."},{"featuretext":"SOUL FIST TECHNIQUE\nStarting at 1st level your practice of martial arts gives you\nbetter control over the untamed magic raging inside you.\nWith that newfound control you have learned how to meld\nyour magical power into your marital arts to practice a new\nfighting style known as the soul fist technique. While you\naren't wearing armor or wielding a shield you gain the\nfollowing benefits:\nYou can use your action to attack with an enhanced punch\nor kick powered by your magical energy (this is a unique\naction and not a new option for the attack action. The\nsoul strike is a melee spell attack with a range of 5 feet.\nYou are proficient with it, and you add your Charisma\nmodifier to the attack and damage rolls. Its damage is\nbludgeoning, and its damage die is a d&\nThis dic changes as you gain Sorcerer levels. The\ndamage of the soul strike changes to 2d8 at level 5 to 3d8\nat level 11, and to 4d8 at level 17\n. If you make a soul strike on your turn, you gain a +2 bonus\nto AC until the start of your next turn, while you aren't\nincapacitated\n• When a hostile creature's movement provokes an\nopportunity attack from you, you can use your reaction to\nmake 1 soul strike on that creature, rather than making an\nopportunity attack"}],"6":[{"featuretext":"DISCIPLE OF METAMAGICS\nAt 6th level, you become inspired by your ability to twist your\nspells to suit your needs, so you start personalizing your soul\nfist technique. You gain metamagic disciplines based on your\nchosen Metamagic options. These metamagic disciplines are\ndetailed at the end of the subclass description. Different\nmetamagic disciplines can be used on the same turn with no\nrestrictions outside how many sorcery points you have left\n(For example, you can use both the Careful Spell and\nHeightened Spell disciplines on the same soul strike so long\nyou meet the requirements for cach of them). You can't cast\nspells other than cantrips the turn you use a metamagic\ndiscipline"},{"featuretext":"METAMAGIC DISCIPLINES\nThe Disciple of Metamagics feture lets you learn disciplines if\nyou have the corresponding Metamagic options.\n\nCareful Spell When you target a hostile creature with\nyour soul strike, you can spend 1 sorcery point to gain the\nbenefit of the Disengage action. When you reach 14th level of\nSorccrcr, your walking speed incrcascs by 10 feet until the\nend of the current turn as well\n\nDistant Spell. When you make a soul strike on your tum,\nyou can spend 1 sorcery point to make your reach for it is 5\nfect grcater than normal When you reach 14th level of\nSorcerer, your reach for the soul strike on your turn is 25 fect\ngreater than normal instead.\n\nEmpowered Spell. When you hit a target with your soul\nstrike, you can spend sorcery points (5 max) to add 1d6 to the\ndamage roll for each sorcery point spent. When you reach\n14th level of Sorcerer, you now add 1d8 to the damage roll\nfor each sorcery point spent instead.\n\nExtended Spell As a bonus action, you can spend 2\nsorcery points to spend I Hit Die to heal yourself. Roll the\ndie, add your Constitution modifier, and regain a number of\nhit points equal to the total (minimum of 1) When you reach\n14th level of Sorcerer, you gain temporary hit points equal to\ndouble the amount of hit points recovered as well.\n\nHeightened Spell When you hit a creature with your soul\nstrike, you can spend 3 sorcery points to give the target\ndisadvantage on their next saving throw until the start of your\nnext turn.\n\nQuickened Spell You can spend 2 sorcery points to use\nyour soul strike with a bonus action.\n\nSeeking Spell As a bonus action, you can spend 2 sorcery\npoints to gain advantage on your next soul strike attack roll\nWhen you reach 14th level of Sorcerer, your next soul strike\nignores half cover and three-quarters cover.\n\nSubtle Spell. As a bonus action, you can spend 1 sorcery\npoint to gain proficiency in the Acrobatics, Stcalth, and Slight\nof Hand skills if you don't already have it until the start of\nyour next turn. When you reach 14th level of Sorcerer, your\nproficiency bonus is doubled for any ability check you make\nthat uses these proficiencies, but you cannot benefit from a\nsimilar feature, such as Expertise, that doubles your\nproficiency bonus for Acrobatics, Stealth, or Slight of Hand\n\nTransmuted Spell When you hit a target with your soul\nstrike. you can spend 1 sorcery point to change your soul\nstrike's damage type from bludgeoning to acid, cold, fire,\nlightning, poison, or thunder damage till the end of your next\nturn. When you reach 14th level in Sorcerer, your soul strike's\ndamage type remains changed for 1 minute instead.\n\nTwinned Spell When you use your action to use your soul\nstrike, you can spend 1 sorcery point to make 2 soul fists\nstrikes instead of just 1."}],"14":[{"featuretext":"MASTERY OF BODY AND SOUL\nAt level 14, you have mastered the soul fist technique. All your\ntraining of your body and soul has now bore fruit, so you gain\nthe following benefits:\n• You gain proficiency in Dexterity or Wisdom saving\nthrows (your choice)\nYou suffer none of the frailty of old age, and you cannot be\naged magically. You can still die of old age however,"}],"18":[{"featuretext":"AWAKENING OF ASTRAL POWER\nAt level 18 you can unlock the subconscious restraints you\nplaced on your magical power to prevent it from getting out of\ncontrol. Now that you have full control over your magic with\nno restrictions on them, you can use it to enhance your soul\nfist technique's power to reach your full potential\nAs a bonus action, you can spend 10 sorcery points to gain\nthe following benefits for 1 minute while you are not\nincapacitated:\n• You summon three copies of your astral self to appear\nalongside you and assist in battle. You gain the effects of a\nmirror image spell, but the duplicates can now affect\ncreatures that relies on senses other than sight, such as\nblindsight, or if it can perceive illusions as false, as with\ntrucsight.\n• You gain resistance to bludgeoning, piercing, and slashing\ndamage from nonmagical weapons.\nYour soul strike now has a +3 bonus to attack and damage\nrolls."}]}},{"name":"Wild Card","class":"Rogue","level":{"3":[{"featuretext":"Tricks Up the Sleeve\n\nYour penchant for games has afforded you the ability to subtly manipulate fortune to your favor. When you choose this archetype at 3rd level, you learn the Guidance cantrip. Starting at 9th level, it has a range of 30 feet for you, and you can cast it as a bonus action.\n\n"},{"featuretext":"Wild Card’s Gambit\n\nAlso at 3rd level, you gain proficiency with one of the following gaming sets: dice set, dragonchess set, or playing card set.\n\nThe gaming set you choose grants you a Wild Card’s Gambit, as detailed below. If you are proficient in multiple types of gaming sets, you must choose which gambit to use when you gain this feature. You can change your choice of gambit whenever you gain a level in this class.\n\nLoaded Dice: You gain a pool of d6s equal to the number of d6s you roll for your Sneak Attack damage. (Your pool starts with 2d6 at 3rd level, and increases to 3d6 at 5th level, and so on.) When a creature targets you with an attack, you can use your reaction to spend one die from the pool and subtract the number rolled from the attack. You can choose to use this feature after the creature makes its roll, but before the DM determines whether the attack roll hits or misses. Starting at 9th level you can spend up to two dice from the pool at once, and starting at 17th level you can spend up to three dice at once. You regain all expended dice from your loaded dice pool when you complete a long rest.\n\nDragonchess: Your prowess of the chessboard has made you a skilled tactician on the battlefield. As a bonus action on your turn, you can execute one of the following chess maneuvers. You can use a bonus action in this way a number of times equal to your Charisma modifier (minimum of once), and regain all uses after a long rest.\n\nDragon: Choose a creature you can see within 30 feet of you. The first time that creature makes a successful attack roll before the start of your next turn, they deal extra damage equal to your level in this class.\n\nGriffon: Your movement speed increases by 10 feet, and your movement does not provoke opportunity attacks. These benefits last until the start of your next turn.\n\nSylph: You and all friendly creatures within 5 feet of you have advantage on Dexterity saving throws until the start of your next turn.\n\nPlaying Cards: You have developed a fighting style based around the cartomancy of the Serpent Isles. You have your own deck of enchanted cards, and can make their edges razor-sharp with a flick of your wrist. If you have not yet used your Sneak Attack this turn, you can use your action to take one of these cards and attack a creature within 30 feet with it. The attack roll for this feature uses your Dexterity modifier, and on a hit, it deals slashing damage equal 1d4 + your Dexterity modifier. When you roll for damage, look at the number rolled on the d4. The attack gains a random effect based on the number rolled, as detailed in the Wild Card Suit table below. You can attack using a card in this manner a number of times equal to your Charisma modifier (minimum of once), and regain all uses after a long rest.\n\nWild Card Suit TableDamage die (d4)Suit1Blade: Roll your Sneak Attack damage and add it to your razor card’s damage. At the start of its next turn, the target takes additional damage equal to half the Sneak Attack damage rolled.2Shackle: Until the start of your next turn, the target’s speed is halved. It can’t make more than one attack on its turn while its speed is reduced in this way.3Heart: Roll your Sneak Attack damage and add it to your razor card’s damage. You also immediately regain a number of hit points equal to the half the damage dealt. Any excess hit points regains become temporary hit points.4Wild Ace: This card morphs suits depending on the dealer’s wishes. Choose Blade, Shackle, or Heart. The card then immediately gains the suit’s respective effect."}],"9":[{"featuretext":"Shifting the Odds\n\nStarting at 9th level, you are acutely aware of how to quit when you’re ahead, vanishing in a flash when the odds begin to turn against you. As a bonus action, you can disappear with a dramatic flourish. Each creature within 10 feet of you must make a Dexterity saving throw (DC 8 + your proficiency bonus + your Charisma modifier), taking 4d10 force damage on a failed save or half as much on a successful one.\n\nYou then teleport yourself to an unoccupied space that you can see within 120 feet of your original location. Once you have used this ability, you cannot use it again until you have finished a short or long rest.\n\n"}],"13":[{"featuretext":"Twist of Fate\n\nAt 13th level, your mastery over the game table hones your speed and cunning in combat. After rolling initiative but before the first turn of combat, you can choose to swap places in the initiative order with one creature you can see. If the creature is one of your allies, that ally must agree to swapping initiative with you.\n\n"}],"17":[{"featuretext":"Joker Wild\n\nAt 17th level, your mastery over chance encompasses even your own form, allowing you to exist between potential realities. As a bonus action on your turn, you can take on an incorporeal form, during which you gain the following benefits:\n\nYou regain expended power for your Wild Card’s Gambit feature:\n\nCards. You regain all spent uses of that feature.\n\nDragonchess. You regain all spent uses of that feature.\n\nDice. You regain all spent dice.\n\nYour movement speed is doubled.\n\nYou gain resistance to all damage, and are immune to the grappled, paralyzed, stunned, and restrained conditions.\n\nYou can move through objects and creatures as if they were difficult terrain. If you end your turn inside a creature, the creature takes 1d10 force damage and is shunted into an adjacent space within 5 feet of their original location.\n\nThis incorporeal state lasts for one minute, or until you are incapacitated. Once you use this feature, you cannot use it again until you complete a long rest.\n\n"}]}},{"name":"Gunsmith","displayname":"Gunsmith","class":"Artificer","previewtext":"A master of engineering, you forge a firearm powered by a combination of science and magic.","spellprogression":"third","spellcastingability":"intelligence","level":{"1":[{"addtoolproficiencies":["Smith's Tools"]},{"addspell":{"name":"Mending","spelllevel":"0"}},{"featuretextwithbullet":"Thunder Cannon: You forge a deadly firearm using a combination of arcane magic and your knowledge of engineering and metallurgy. This firearm is called a Thunder Cannon. It is a ferocious weapon that fires leaden bullets that can punch through armor with ease. You are proficient with the Thunder Cannon. The firearm is a two-handed ranged weapon that deals 2d6 piercing damage. Its normal range is 150 feet, and its maximum range if 500 feet. Once fired, it must be reloaded as a bonus action. If you lose your Thunder Cannon, you can create a new one over the course of three days of work (eight hours each day) by expending 100 gp worth of metal and other raw materials."},{"featuretextwithbullet":"Arcane Magazine: You have a leather bag used to carry your tools and ammunition for your Thunder Cannon. Your Arcane Magazine includes the powders, lead shot, and other materials needed to keep that weapon functioning. You can use the Arcane Magazine to produce ammunition for your gun. At the end of each long rest, you can magically produce 40 rounds of ammunition with this magazine. After each short rest, you can produce 10 rounds. If you lose your Arcane Magazine, you can create a new one as part of a long rest, using 25 gp of leather and other raw materials."}],"3":[{"featuretextwithbullet":"Thunder Monger: As an action, you can make a special attack with your Thunder Cannon that deals an extra 1d6 thunder damage on a hit. This extra damage increases by 1d6 when you reach certain levels in this class: 5th level (2d6), 7th level (3d6), 9th level (4d6), 11th level (5d6), 13th level (6d6), 15th level (7d6), 17th level (8d6), and 19th level (9d6)."}],"9":[{"featuretextwithbullet":"Blast Wave: As an action, you can make a special attack with it. Rather than making an attack roll, you unleash force energy in a 15-foot cone from the gun. Each creature in that area must make a Strength saving throw with a DC of 8 + your proficiency bonus + your Intelligence modifier. On a failed saving throw, a target takes 2d6 force damage and is pushed 10 feet away from you. This damage increases by 1d6 when you reach certain levels in this class: 13th level (3d6) and 17th level (4d6)."}],"14":[{"featuretextwithbullet":"Piercing Round: As an action, you can make a special attack with it. Rather than making an attack roll, you cause the gun to unleash a bolt of lightning, 5-feet wide and 30-feet long. Each creature in that area must make Dexterity saving throws with a DC of 8 + your proficiency bonus + your Intelligence modifier. On a failed saving throw, a target takes 4d6 lightning damage. This damage increases to 6d6 when you reach 19th level in this class."}],"17":[{"featuretextwithbullet":"Explosive Round: As an action, you can make a special attack with it. Rather than making an attack roll, you launch an explosive round from the gun. The round detonates in a 30-foot radius sphere at a point within range. Each creature in that area must make a Dexterity saving throw with a DC of 8 + your proficiency bonus + your Intelligence modifier. On a failed saving throw, a target takes 4d8 fire damage."}]}},{"name":"Alchemist","displayname":"Alchemist","class":"Artificer","previewtext":"An alchemist is an expert at combining exotic reagents to produce a variety of materials, from healing draughts that can mend a wound in moments to clinging goo that slows creatures down.","spellprogression":"third","spellcastingability":"intelligence","level":{"1":[{"featuretextwithbullet":"Alchemist’s Satchel: You have an Alchemist’s Satchel, a bag of reagents that you use to create a variety of concoctions. The bag and its contents are both magical, and this magic allows you to pull out exactly the right materials you need for your Alchemical Formula options, described below. After you use one of those options, the bag reclaims the materials. If you lose this satchel, you can create a new one over the course of three days of work (eight hours each day) by expending 100 gp worth of leather, glass, and other raw materials."},{"featuretextwithbullet":"Alchemical Fire. As an action, you can reach into your Alchemist’s Satchel, pull out a vial of volatile liquid, and hurl the vial at a creature, object, or surface within 30 feet of you (the vial and its contents disappear if you don’t hurl the vial by the end of the current turn). On impact, the vial detonates in a 5-foot radius. Any creature in that area must succeed on a Dexterity saving throw or take 1d6 fire damage. This formula’s damage increases by 1d6 when you reach certain levels in this class: 4th level (2d6), 7th level (3d6), 10th level (4d6), 13th level (5d6), 16th level (6d6), and 19th level (7d6)."},{"featuretextwithbullet":"Alchemical Acid. As an action, you can reach into your Alchemist’s Satchel, pull out a vial of acid, and hurl the vial at a creature or object within 30 feet of you (the vial and its contents disappear if you don’t hurl the vial by the end of the current turn). The vial shatters on impact. A creature must succeed on a Dexterity saving throw or take 1d6 acid damage. An object automatically takes that damage, and the damage is maximized. This formula’s damage increases by 1d6 when you reach certain levels in this class: 3rd level (2d6), 5th level (3d6), 7th level (4d6), 9th level (5d6), 11th level (6d6), 13th level (7d6), 15th level (8d6), 17th level (9d6), and 19th level (10d6)."},{"sharedclassfeaturemenu":{"name":"Alchemical Formula","selections":"1","class":"Artificer"}}],"3":[{"sharedclassfeaturemenu":{"name":"Alchemical Formula","selections":"1","class":"Artificer"}}],"9":[{"sharedclassfeaturemenu":{"name":"Alchemical Formula","selections":"1","class":"Artificer"}}],"14":[{"sharedclassfeaturemenu":{"name":"Alchemical Formula","selections":"1","class":"Artificer"}}],"17":[{"sharedclassfeaturemenu":{"name":"Alchemical Formula","selections":"1","class":"Artificer"}}]}},{"name":"Armorer","class":"Artificer","level":{"3":[{"featuretext":"Power Armor\n\nBeginning at 3rd level, your metallurgical pursuits have led to you making armor a conduit for your artificer magic. As an action, you can turn a suit of heavy armor you are wearing into power armor, provided you have smith’s tools in hand. You gain the following benefits while wearing the power armor:\n\nIf the armor normally has a Strength requirement, the power armor lacks this requirement for you.\n\nYou can use the power armor as a spellcasting focus for your artificer spells.\n\nThe power armor attaches to you and can’t be removed against your will. It also expands to cover your entire body, and it replaces any missing limbs, functioning identically to a body part it is replacing.\n\nThe armor continues to be power armor until you doff it, you don another suit of armor, or you die.\n\n"},{"featuretext":"Armor Model\n\nBeginning at 3rd level, you can customize your power armor. When you do so, choose one of the following armor models: guardian or infiltrator. The model you choose gives you special benefits while you wear it.\n\nEach model includes a special weapon. When you attack with that weapon, you can use your Intelligence modifier, instead of Strength or Dexterity, for the attack and damage rolls. You can change your power armor's model whenever you finish a short or long rest, provided you have smith's tools in hand.\n\nGuardian\n\nYou design your armor to be in the frontline of conflict. It has the following features:\n\nThunder Gauntlets. Your armored fists each count as a simple melee weapon, and each deals 1d8 thunder damage on a hit. A creature hit by the gauntlet has disadvantage on attack rolls against targets other than you until the start of your next turn, as the armor magically emits a distracting pulse when the creature attacks someone else.\n\nDefensive Field. You gain a bonus action that you can use on each of your turns to gain temporary hit points equal to your level in this class, replacing any temporary hit points you already have. You lose these temporary hit points if you doff the armor.\n\nInfiltrator\n\nYou customize your armor for subtle undertakings. It has the following features:\n\nLightning Launcher. A gemlike node appears on one of your armored fists or on the chest (your choice). It counts as a simple ranged weapon, with a normal range of 90 feet and a long range of 300 feet, and it deals 1d6 lightning damage on a hit. Once on each of your turns when you hit a creature with it, you can deal an extra 1d6 lightning damage to that target.\n\nPowered Steps. Your walking speed increases by 5 feet.\n\nSecond Skin. The armor’s weight is negligible, and it becomes formfitting and wearable under clothing. If the armor normally imposes disadvantage on Dexterity (Stealth) checks, the power armor doesn’t.\n\n"}],"5":[{"featuretext":"Extra Attack\n\nStarting at 5th level, you can attack twice, rather than once, whenever you take the Attack action on your turn.\n\n"}],"9":[{"featuretext":"Armor Modifications\n\nAt 9th level, you learn how to use your artificer infusions to specially modify the armor enhanced by your Power Armor feature. That armor now counts as separate items for the purposes of your Infuse Items feature: armor (the chest piece), boots, bracers, and a weapon. Each of those items can bear one of your infusions. In addition, the maximum number of items you can infuse at once increases by 2, but those extra items must be part of your power armor.\n\n"}],"15":[{"featuretext":"Perfected Armor\n\nAt 15th level, Your power armor gains additional benefits based on its model, as shown below.\n\nGuardian. Tinkering with your armor's energy system leads you to discover a powerful pulling force. When a creature you can see ends its turn within 30 feet of you, you can use your reaction to force the creature to succeed on a Strength saving throw against your spell save DC or be pulled up to 30 feet toward you to an unoccupied space. If you pull the target to space within 5 feet of you, you can make a melee weapon attack against it as part of this reaction.\n\nYou can use this reaction a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses of it when you finish a long rest.\n\nInfiltrator. Any creature that takes lightning damage from your Lightning Launcher glimmers with light until the start of your next turn. The glimmering creature sheds dim light in a 5 foot radius, and the next attack roll against it by a creature other than you has advantage. If that attack hits, it deals an extra 1d6 lightning damage.\n\n"}]}},{"name":"Path of the Possessed","class":"Barbarian","level":{"3":[{"featuretext":"THE DARKNESS WITHIN\nAt 3rd level, Your rage is no longer fueled by your own anger\nbut by the spirit or demon possessing you. Because of this,\nyou can no longer get Charmed or Frightened while raging.\nThe possessing spirit or demon also amplities your own\nanger. When you rage your eyes glow like a purple flame and\nyour canines slightly grow in size.\n"}],"6":[{"featuretext":"RAVENOUs FURY\nBy 6th level, The spirit or demon possessing you has formed\na bond with your weapon As an action, you can call your\nweapon to your hand and imbue it with darkness. For one\nminute it now has the throw property, after throwing or\ndropping the weapon you can use a bonus action to call\nback to your hand. You can add (your proficiency bonus - 2)d6\ndamage to your attack rolls with the weapon. The weapon\nalso emits dim light in a 10-foot radius.\n"}],"10":[{"featuretext":"GROWING DARKNESS\nAt 10th level, You get more used to the possesser and get\nsome of his abilities. You have truesight out to a range of 60\nfeet. Twice a short rest you can hurl a shadow bolt at one\ncreature within 60 feet range. Make a ranged spell attack\nagainst the target. On a hit, the target takes 2d10 damage.\n"}],"14":[{"featuretext":"ANGER UNLEASHED\nWhen you reach 14th level, You can use an action to let the\nspirit or demon possessing you empower you, releasing a\nwave of dark magic dealing 4d6 to everybody in 10 feet of\nyou. While raging your AC increases by 1, you can't be\nBlinded or Poisoned and can use your bonus action to attack\na third time. You need to take a long rest before you can use\nthis feature again.\n"}]}},{"name":"Path of the Juggernaut","class":"Barbarian","level":{"3":[{"featuretext":"Thunderous Blows\n\nStarting when you choose this path at 3rd level, your rage instills you with the strength to batter around your foes, making any battlefield your domain. Once per turn while raging, when you damage a creature with a melee attack, you can force the target to make a Strength saving throw (DC 8 + your proficiency bonus + your Strength modifier). On a failure, you push the target 5 feet away from you, and you can choose to immediately move 5 feet into the target’s previous position.\n\n"},{"featuretext":"Stance of the Mountain\n\nYou harness your fury to anchor your feet to the earth, shrugging off the blows of those who wish to topple you. Upon choosing this path at 3rd level, you cannot be knocked prone while raging unless you become unconscious.\n\n"}],"6":[{"featuretext":"Demolishing Might\n\nBeginning at 6th level, you can muster destructive force with your assault, shaking the core of even the strongest structures. All of your melee attacks gain the siege property (your attacks deal double damage to objects and structures). Your melee attacks against creatures of the construct type deal an additional 1d8 weapon damage.\n\n"}],"10":[{"featuretext":"Overwhelming Cleave\n\nUpon reaching 10th level, you wade into armies of foes, great swings of your weapon striking any who threaten you. When you make a weapon attack while raging, you can make another attack as a bonus action with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon.\n\n"}],"14":[{"featuretext":"Unstoppable\n\nStarting at 14th level, you can choose to become unstoppable when you enter a rage. If you do so, for the duration of the rage your speed cannot be reduced, and you are immune to the frightened, paralyzed, and stunned conditions. If you are frightened, paralyzed, or stunned, you can still take your bonus action to enter your rage and suspend the effects for the duration of the rage. When your rage ends, you suffer one level of exhaustion.\n\n"}]}},{"name":"School of Onomancy","displayname":"School of Onomancy","class":"Wizard","level":{"2":[{"featuretext":"Bonus Proficiencies\n\nAt 2nd level, you learn one language of your choice and gain proficiency with calligrapher’s tools.\n\nExtract Name\n\nAt 2nd level, you can magically compel a creature to divulge its true name. As a bonus action, you target one creature you can see within 60 feet of you. The target must make a Wisdom saving throw against your spell save DC. On a successful save, you discern that this magic failed, and you can’t use this feature on the target again. On a failed save, the target is charmed by you until the end of your next turn, and you mentally learn the charmed target’s name or the fact that the target lacks a name.\n\nYou can use this feature a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses of it when you finish a long rest.\n\nFateful Naming\n\nStarting at 2nd level, you can bend magic to assist or hinder creatures through the power of their true names, and even use those names as an anchor to affect others around them. The bane and bless spells are wizard spells for you, and you add them to your spellbook. You always have them prepared, yet they don’t count against the number of spells you can prepare.\n\nYou can cast either spell without expending a spell slot if you speak the true name of one target of the spell as part of casting it. You can cast the spells in this way a number of times equal to your Intelligence modifier (a minimum of once), and you regain all expended uses when you finish a long rest.\n\n"}],"6":[{"featuretext":"Resonant Utterance\n\nAt 6th level, you learn words of power called Resonants,which allow you to tailor your spells through the use of a target’s true name.\n\nResonants Known. When you gain this feature, you learn two Resonants of your choice, which are detailed in the “Resonant Options” section. Each time you gain a level in this class, you can replace one resonant you know with a different one.\n\nUsing a Resonant. You can use one Resonant when you cast a wizard spell with a spell slot and speak the true name of one creature targeted by the spell. Speaking the name is part of casting the spell.\n\nYou can use Resonants a number of times equal to half of your wizard level (round down), and you regain all expended uses when you finish a long rest.\n\nResonant Options. Here are your options when choosing a Resonant:\n\nAbsorption. When you cast a spell that deals damage to the named target, you gain 3d6 temporary hit points. The number of temporary hit points you gain increases by 1d6 when you reach 10th level (4d6) and 14th level (5d6) in this class.\n\nDevastation. If the spell requires the named creature to make a saving throw, that creature has disadvantage on the first save it makes against the spell.\n\nDissolution. The first time the named creature takes damage from the spell, that creature takes an extra 2d8 force damage. The extra force damage increases by 1d8 when you reach 10th level (3d8) and 14th level (4d8) in this class.\n\nNullification. If the named target is affected by any other spells, you know what those spells are, and you can attempt to end one of your choice by succeeding on an Intelligence check with a DC equal to 10 + the level of the chosen spell.\n\nPuppetry. The first time the named creature takes damage from the spell, you can knock the creature prone or move it up to 10 feet, either directly toward you or away from you.\n\nSympathy. If the named creature is within range of the spell, you can target the creature with the spell even if you can’t see the creature or it has total cover against the spell.\n\n"}],"10":[{"featuretext":"Durable Magic\n\nBeginning at 10th level, the magic you channel helps ward off harm. While you maintain concentration on a spell, you have a +2 bonus to AC and all saving throws.\n\nInexorable Pronouncement\n\nAt 10th level, you learn two new Resonants of your choice from your Resonant Utterance feature.\n\n"}],"14":[{"featuretext":"Relentless Naming\n\nAt 14th level, you have learned how to bypass a named creature’s defenses against certain types of damage. When you cast a spell that deals damage to a creature whose true name you speak as part of casting the spell, you can cause the spell to deal force or psychic damage to the creature, instead of the spell’s normal damage type.\n\n"}]}},{"name":"Horizon Walker","class":"Ranger","level":{"3":[{"addspell":{"name":"Protection from Evil and Good","spelllevel":"1"}},{"featuretext":"Detect Portal\n\nAt 3rd level, you gain the ability to magically sense the presence of a planar portal. As an action, you detect the distance and direction to the closest planar portal within 1 mile of you.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.\n\nSee the \"Planar Travel\" section in chapter 2 of the Dungeon Master's Guide for examples of planar portals.\n\nPlanar Warrior\n\nAt 3rd level, you learn to draw on the energy of the multiverse to augment your attacks.\n\nAs a bonus action, choose one creature you can see within 30 feet of you. The next time you hit that creature on this turn with a weapon attack, all damage dealt by the attack becomes force damage, and the creature takes an extra 1d8 force damage from the attack. When you reach 11th level in this class, the extra damage increases to 2d8.\n\n"}],"5":[{"addspell":{"name":"Misty Step","spelllevel":"2"}}],"7":[{"featuretext":"Ethereal Step\n\nAt 7th level, you learn to step through the Ethereal Plane. As a bonus action on your turn, you can cast the Etherealness spell with this feature, without expending a spell slot, but the spell ends at the end of the current turn.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest.\n\n"}],"9":[{"addspell":{"name":"Haste","spelllevel":"3"}}],"11":[{"featuretext":"Distant Strike\n\nAt 11th level, you gain the ability to pass between the planes in a blink of an eye. When you use the Attack action, you can teleport up to 10 feet before each attack to an unoccupied space you can see.\n\nIf you attack at least two different creatures with the action, you can make one additional attack with it against a third creature.\n\n"}],"13":[{"addspell":{"name":"Banishment","spelllevel":"4"}}],"15":[{"featuretext":"Spectral Defense\n\nAt 15th level, your ability to move between planes enables you to slip through the planar boundaries to lessen the harm done to you during battle. When you take damage from an attack, you can use your reaction to give yourself resistance to all of that attack's damage on this turn.\n\n"}],"17":[{"addspell":{"name":"Teleportation Circle","spelllevel":"5"}}]}},{"name":"Brute","class":"Fighter","level":{"3":[{"featuretext":"Brute Force\n\nStarting at 3rd level, you’re able to strike with your weapons with especially brutal force. Whenever you hit with a weapon that you’re proficient with and deal damage, the weapon’s damage increases by an amount based on your level in this class, as shown on the Brute Bonus Damage table.\n\nBrute Bonus DamageFighter LevelDamage Increase3rd1d410th1d616th1d820th1d10"}],"7":[{"featuretext":"Brutish Durability\n\nBeginning at 7th level, your toughness allows you to shrug off assaults that would devastate others.\n\nWhenever you make a saving throw, roll 1d6 and add the die to your saving throw total. If applying this bonus to a death saving throw increases the total to 20 or higher, you gain the benefits of rolling a 20 on the d20.\n\n"}],"15":[{"featuretext":"Devastating Critical\n\nStarting at 15th level, when you score a critical hit with a weapon attack, you gain a bonus to that weapon’s damage roll equal to your level in this class.\n\n"}],"18":[{"featuretext":"Survivor\n\nAt 18th level, you attain the pinnacle of resilience in battle. At the start of each of your turns in combat, you regain hit points equal to 5 + your Constitution modifier (minimum of 1 hit point). You don’t gain this benefit if you have 0 hit points or if you have more than half of your hit points left.\n\n"}]}},{"name":"Pact of the Ancient Dragon","class":"Warlock","spellcastingability":"charisma","level":{"1":[{"featuretext":"HOARD SENSE\nBeginning at 1st level, you inherently know the\nworth of any treasure or valuable item you can\nsee, and have advantage on Intelligence\n(Investigation) checks to find the location of\ncoinage, gems, and art items of significant worth.\nIn addition, as an action you may summon or\ndismiss a personal chest from your patron's\nhoard to or from an unoccupied point on the\nground within 5 feet of you. The chest is initially\nempty, and may hold up to 6 cubic feet of non-\nliving material (3 feet by 2 feet by 1 foot)."},{"addspell":{"name":"Shield","spelllevel":"1"}},{"addspell":{"name":"Command","spelllevel":"1"}}],"3":[{"addspell":{"name":"Locate Object","spelllevel":"2"}},{"addspell":{"name":"See Invisibility","spelllevel":"2"}}],"5":[{"addspell":{"name":"Elemental Weapon","spelllevel":"3"}},{"addspell":{"name":"Protection from Energy","spelllevel":"3"}}],"6":[{"featuretext":"ANCIENT's BREATH\nAt 6th level, you can channel the element of your\ndraconic patron, breathing it as a torrent of dam-\naging energy. Consult the Draconic Patronage\ntable and gain the damage type and breath\nweapon spread associated with the color of your\ndraconic patron. As an action on your turn, you\nmay expend a spell slot of 3rd level or higher and\nuse this breath weapon, requiring all creatures\nin this area to make a Dexterity save against\nyour spell save DC, or a Constitution save if the\nbreath deals Cold or Poison damage, taking half\ndamage if the save is successful. This ability\ndeals damage of your patron's associated type\nequal to 4d8 plus your Charisma modifier, plus\n1d8 damage per level of the spell slot above 3rd.\n"}],"7":[{"addspell":{"name":"Compulsion","spelllevel":"4"}},{"addspell":{"name":"Fire Shield","spelllevel":"4"}}],"9":[{"addspell":{"name":"Dominate Person","spelllevel":"5"}},{"addspell":{"name":"Hallow","spelllevel":"5"}}],"10":[{"featuretext":"BLOOD OF DraGONS\nStarting at 10th level, you gain resistance to the\ndamage type associated with your draconic\npatron. In addition, when you succeed on a\nsaving throw against an effect that would deal\ndamage of your patron's type, you take no\ndamage from the effect."}],"14":[{"featuretext":"DRACONIC APOTHEOSIS\nOnce you reach 14th level, you can assume the\nform of an aspect of your draconic patron for up\nto a minute. You may sprout horns, grow scales,\ngain burning draconic eyes, and take on other\nfeatures directly reminiscent of your draconic\nlord.\nYou can transform on your turn using a bonus\naction, which grants the the following abilities:\nWebbed dragon wings sprout from your back,\ngranting you a flying speed of 60 feet.\nAs a bonus action on your turn, you may level\nyour draconic gaze at a creature within 60\nfeet of you. This creature must make a\nWisdom saving throw against your spell save\nDC or become frightened of you for one\nminute. A creature affected by this repeats\nthis save at the end of each of its turns, and a\ncreature that saves against this effect may not\nbe subject to it again for 24 hours.\nWhile a creature is frightened of you, they\nhave disadvantage on saving throws against\nyour spells and abilities, and you have advan-\ntage on attack rolls against this creature\n3\/\nThe damage dice of your Ancient's Brea 3 \/3)\nincrease from d8's to d12's.\nOnce you have used this ability, you may not use\nit again until you complete a long rest."}]}},{"name":"SpellFist","class":"Sorcerer","level":{"1":[{"featuretext":"THE SPELLFIST SORCECER \nSpellfisters are ambitious sorceres who dont feel intimidated by their disadvantages, but, instead of that, practice a particular and very dangerous way of magical combat. Born with the innerent power of sorceres, but with no talent enough to use skills correctly, every spell you cast just hit melee foes. The Spellfist way is not for the powefull ones, but the ones who has no other option. \nLACK OF TALENT Since your birth, you cannot generate spells beyond your hands. All ranged spells you use become melee. If they have area of damage or effect, the area is generated from the target of the spell. If you miss the first target, the spell doesn't affect the others. If you hit the first target, it will hit the others. \nSPELL FIST As no master wanted to teach a non talented boy, you have learned to fight by your own, with magic and fists. Any time your spells or cantrips do damage and you have not a weapon equiped, you do a 1d4 + your Strength or Dexterity modifier as extra damage if the target is at your side. Add another 1d4 at level 5, 10, 15 and 20. \nSPELL FIST EXTRA DAMAGE Level Dices \n1 \n5 10 15 20 \n1d4 2d4 3d4 4d4 5d4 \nSENSE OF DANGER You are weak, you know it. Life is hard for a sorcerer that cannot keep distance from his enemies. You have been develop the ability to use dash, disengage and hide as bonus actions. Being hidden is this way does not give you advantage on you melee spell casting. Also, after taking many hits, you choose to start wearing light armor. "}],"6":[{"featuretext":"COMBAT MASTERY When you reach 6th level, you can choose between 2 combat styles. Focusing on casting as an Arcane Fighter or using a weapon as a extension of yourself as a Spellblade. \nARCANE FIGTHER Certainly you are not the most powerful caster, but probably the fastest. Allow you to use a spell or cantrip as an additional chain action if your first spell hit the target successfully. You may choose another target for the additonal spell. \nSPELLBLADER \nNow you are able to use a one handed melee weapon and maintain Spell fist feature. The damage of the weapon becomes magical damage and you are able to use a spell or cantrip as additional chain action if your weapon hit the enemy susscessfully. You may choose another target for the additonal spell. "}],"14":[{"featuretext":"ARCANE PROTECTION At level 14, your arcane power come not just from your hands, but your entire body. Any time a foe hits you with weapons or magic, you may spend a sorcerer point to reduce the damage to half. "}],"18":[{"featuretext":"COUNTER ATTACK At level 18 you learn how to improve your body and mind by your arcane powers. When a foe attacks you and it misses, you may react using a cantrip if the foe is at your melee range. If the attacker is out of your range, you can use your reaction to move close to him by a magic leap. Is the attacker is out of your range and you cannot see him or it is stealthed, you don't react. "}]}},{"name":"Ascendent Dragon","class":"Monk","level":{"3":[{"featuretext":"Draconic Disciple\n\nAt 3rd-level you can channel your draconic ki to imbue your unarmed strikes with the essence of a dragon’s breath and to use your connection with draconic creatures to magnify your presence. You gain the following benefits:\n\nWhen you damage a target with an unarmed strike, you can change the damage type to acid, cold, fire, lightning, or poison.\n\nIf you can’t already, you learn to speak, read, and write Draconic.\n\nIf you fail a Charisma (Intimidation) or Charisma (Persuasion) check, you can use your reaction to reroll the check, as you tap into the mighty presence of dragons. Once this feature turns a failure into a success, you can’t use it again until you finish a long rest.\n\nBreath of the Dragon\n\nAt 3rd-level you can channel your ki into destructive waves of energy like the dragons you emulate. When you take the Attack action on your turn, you can replace one of the attacks with an exhalation of draconic energy in either a 20-foot cone or a 30-foot line that is 5 feet wide (your choice). Choose a damage type: acid, cold, fire, lightning, or poison. Each creature in the area must make a Dexterity saving throw against your ki save DC, taking damage of the chosen type equal to two rolls of your Martial Arts die on a failure, or half as much damage on a success.\n\nAt 11th level, the damage of your breath increases to three rolls of your Martial Arts die.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nWhile you have no uses available, you can spend 1 ki point to use this feature again.\n\n"}],"6":[{"featuretext":"Wings Unfurled\nAt 6th-level when you use your Step of the Wind, you can unfurl spectral draconic wings from your back that vanish at the end of your turn. While the wings exist, you have a flying speed equal to your walking speed.\n\nYou can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nWhile you have no uses available, you can spend 1 additional ki point when you activate Step of the Wind to use this feature again."}],"11":[{"featuretext":"Aspect of the Wyrm\nWhen you reach 11th-level the power of your draconic ki now radiates from you, protecting your allies from harm and punishing any who raise arms against them. As a bonus action, you can create an aura of draconic power that radiates 30 feet from you for 1 minute. Choose acid, cold, fire, lightning, or poison damage, and for the duration, you gain the following effects:\n\nYou and your allies within your aura gain resistance to the chosen damage type.\nWaves of destructive energy flow out from you and your allies when any of you are attacked. When you or one of your allies in the aura is hit by an attack made by another creature within the aura, the target that was hit can use their reaction to deal an amount of damage of the chosen type equal to one roll of your Martial Arts die to the attacker.\nOnce you use this bonus action, you can’t use it again until you finish a long rest, unless you expend 4 ki points to use it again."}],"17":[{"featuretext":"Ascendant Aspect\nAt 17th-level your draconic ki reaches its peak. You gain the following benefits:\n\nYou gain blindsight out to 30 feet. Within that range, you can effectively see anything that isn’t behind total cover, even if you’re blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.\nWhen you damage a creature with your Breath of the Dragon, the energy clings to the target. At the start of each of the creature’s turns, it takes damage of the type your breath dealt equal to one roll of your Martial Arts die. At the end of its turn, the creature can repeat the save, ending the effect on itself on a success.\nWhen you activate your Aspect of the Wyrm, draconic fury explodes from you. Choose any number of creatures you can see within your aura. Those creatures each take 4d10 acid, cold, fire, lightning, or poison damage (your choice)."}]}},{"name":"PHYSICIAN","class":"Artificer","level":{"3":[{"featuretext":"MEDICAL SCHOOL\n\n3rd level Physician feature\n\nYou gain proficiency in Medicine and with the Herbalism kit.\n\nAdditionally, you are immune to disease.\n\nDIAGNOSIS\n\n3rd level Physician feature\n\nYou gain the ability to mend and heal wounds. You have a pool of dun equal to 1+ your artificer level As a bonus action, target a creature you can see within 60 feet of you, spending dice from the pool Roll the dice you spend and add them together, the target regains a number of his points equal to the total\n\nThe maximum number of dice you can spend at once equals your intelligence modifier and your pool regains all expended dice when you finish a long rest"}],"5":[{"featuretext":"HARM-A-CIST\n\nSih-level Physician feature\n\nUsing your Diagnosis feature or casting a spell which restores hit points causes your next damage dealing spell to deal additional necrotic damage equal to half your Artificer level (rounded down)\n\nThis additional damage can only be applied once per creature per turn. This feature doesn't stack"}],"9":[{"featuretext":"PHYSICAL EXAMINATION\n\n9th-level Physician feature\n\nYou examine the physique of a creature to reveal their\n\nstrengths and weaknesses. As an action, target a creature\n\nyou can see within 60ft of you. The target must succeed on\n\nan Intelligence saving throw against your spell save DC or you learn the following attributes about it;\n\nDamage Immunities\/Resistances\/Vulnerabilities and Condition Immunities.\n\nYou can use this feature a number of times equal to your Intelligence modifier, regaining all expended uses when you finish a long rest."}],"15":[{"featuretext":"MASTER SURGEON\n\n15th-level Physician feature\n\nNo ailment is beyond your ability to heal You gain the ability to cast Regenerate, without expending a spell slot or requiring the material components. Once you do so, you cannot use this feature again until you finish a long rest."}]}},{"name":"CIRCLE OF THE ABYSS","class":"Druid","level":{"2":[{"featuretext":"DEMONIC TUTOR\n\nWhen you choose this Circle at second level, through your connection to the Abyss, you gain resistance to Fire damage. Also you learn to speak. read and write Abyssal\n\nDEMONIC WILDSHAPE\n\nWhen you choose this Circle at second level, the list of creatures whose form you can enter through Wild Shape is extended to include Demons. The Demon can have a Fly Speed even if your Druid level is 7 or lower. All other restrictions that your Beast Wild Shape have, also apply to\n\nthe Demon Wild Shape. At 18th level you may also Beast Spells also applies to Demon forms."}],"6":[{"featuretext":"DEMONIC FURY\n\nYou have the power of the Abyss at your fingertips. Starting at 6th level you can use a Bonus Action to enter\n\nDemonic Fury. It lasts for one minute, or until you are\n\nknocked unconscious. You can choose to dismiss Demonic\n\nFury as a free action.\n\nWhile Furious, your melee attacks deal an additional Id6\n\nFire damage. You are immune to the Fear condition, and if you were affected by Fear when entering Demonic Fury the condition ends. You can enter Demonic Fury a number of times equal to\n\nyour Proficiency Bonus and you regain all uses after a Long\n\nRest."}],"10":[{"featuretext":"DEMONIC TRANSFORMATION\n\nThe Abyssal energy has saturated your body to such a degree that your physical appearance begins to change. Patches of skin might become thicker and more leathery in appearance, hair might fall outto be replaced by horns or bony ridges, feet might become hoofed and limbs might look swollen and out of proportions.\n\nStarting at 10th level you gain a +1 bonus to AC (Natural) Also, while in your Demonic Fury, you have resistance to Bludgeoning, Piercing and Slashing damage from non magical sources,"}],"17":[{"featuretext":"ABYSSAL HOME\n\nWith every passing day, your bonds to the Material Plane weaken as your connection to the Abyss strengthens.\n\nStarting at 14th level when you die anywhere outside of the Abyss your body decomposes in a week's time. After this week any healing magic will not work if a part of the body is required.\n\nYour body then regrows in the Abyss in a span of 1d6\n\nwecks after that. At the end of this period you emerge in the Abyss from a meatsack fully rested but without any of your equipment. On any attempt to employ magic to resurrect you, you have the choice to accept or reject the pull of this magic.\n\nIn addition, you may cast Plane Shift shifting from the\n\nMaterial Plane to the Abyas or vice versa without the\n\nmaterial component."}]}},{"name":"Circle Of The Forged","class":"Druid","level":{"2":[{"featuretext":"Circle Forms\n\nThe rites of your circle grant you the ability to transform into more dangerous animal forms. Starting at 2nd level, you can use your Wild Shape to transform into a beast with a challenge rating as high as 1 (you ignore the Max. CR column of the Beast Shapes table, but must abide by the other limitations there).\n\nStarting at 6th level, you can transform into a beast with a challenge rating as high as your druid level divided by 3, rounded down.\n\nSkin of Steel\n\nStarting at 2nd level, while you are transformed by Wild Shape, you gain the following benefits:\n\nYou gain a +2 bonus to Armor Class.\n\nYou have advantage on saving throws against being poisoned, and you have resistance to poison damage.\n\nYou don’t need to eat, drink, or breathe.\n\nYou are immune to disease.\n\nYou don’t need to sleep, and magic can’t put you to sleep.\n\nWhile in beast form, your body is made from the same materials as a warforged; your muscles are rootlike tendrils protected by armored plates. It’s obvious to an observer that you are not a normal animal.\n\n"}],"6":[{"featuretext":"Elemental Fury\n\nStarting at 6th level, you gain the ability to imbue your attacks with elemental damage—charging your claws with electricity or unleashing flames from your fangs. When you use Wild Shape, choose one of the following damage types: acid, cold, fire, or lightning. While in your beast form, the first time you hit a creature with a melee attack on your turn, you can expend one spell slot to deal extra damage of that type to the target, in addition to the normal damage of the attack. The extra damage is 1d6 per level of the spell slot expended, to a maximum of 5d6.\n\nWhen you use this ability on a creature, your attack has an additional effect, determined by which damage type you selected when you used Wild Shape. If a creature is affected by this ability again in subsequent rounds, the effects do not stack, and the new duration replaces the old.\n\nAcid. The target must make a Constitution saving throw against your druid spell save DC. On a failed save, its AC is reduced for one minute by an amount equal to half your Wisdom modifier (minimum of 1). At the start of each of its turns for the next minute, the target can make another Constitution saving throw. On a successful save, the effect ends.\n\nCold. At the start of each of its turns for 1 minute, the target must make a Constitution saving throw against your druid spell save DC. On a failed save, their movement speed is reduced to 0 and they have disadvantage on Strength and Dexterity checks. On a successful save, the effect ends.\n\nFire. At the start of each of its turns for 1 minute, the target must make a Constitution saving throw against your druid spell save DC. On a failed save, it takes fire damage equal to your Wisdom modifier. On a successful save, the fire goes out. If the target or a creature within 5 feet of it uses an action to put out the flames, or if some other effect douses the flames (such as the target being submerged in water), the effect ends.\n\nLightning. At the start of each of its turns for 1 minute, the target must make a Constitution saving throw against your druid spell save DC. On a failed save, it loses its reaction until the start of its next turn and the first attack that it makes on its turn is made at disadvantage. On a successful save, the effect ends.\n\n"}],"10":[{"featuretext":"Adamantine Hide\n\nStarting at 10th level, while you are transformed by Wild Shape, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks. In addition, you gain the ability to use Wild Shape as a reaction when you take damage, and the damage from that attack is applied to the hit points of your beast form.\n\n"}],"14":[{"featuretext":"Constructed Perfection\nStarting at 14th level, while you are transformed by Wild Shape, you can’t be charmed, frightened, paralyzed, petrified, or poisoned. In addition, you are immune to poison damage."}]}}],"sharedclassfeatures":[{"name":"Blessed Warrior","effects":[{"sharedclassfeaturemenu":{"name":"Blessed Warrior","class":"Paladin"}},{"featuretext":"You learn two cantrips of your choice from the cleric spell list. They count as paladin spells for you, and Charisma is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the cleric spell list."}]}],"sharedclassfeaturemenus":[{"name":"Wondrous Invention (Level 2)","title":"Wondrous Invention (Level 2)","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Wondrous Invention - Bag of Holding","displayname":"Bag of Holding","previewtext":"A bag that's larger on the inside (64 cubic feet) and only ever weighs 15 pounds while holding up to 500."},{"name":"Wondrous Invention - Cap of Water Breathing","displayname":"Cap of Water Breathing","previewtext":"This cap creates a bubble around your head, allowing you to breathe underwater."},{"name":"Wondrous Invention - Driftglobe","displayname":"Driftglobe","previewtext":"A small globe that can be used to cast the Light or Daylight spells."},{"name":"Wondrous Invention - Goggles of Night","displayname":"Goggles of Night","previewtext":"These goggles grant you darkvision out to 60 feet."},{"name":"Wondrous Invention - Sending Stones","displayname":"Sending Stones","previewtext":"Small stones that can be used to communicate (through the sending spell) once a day."}]},{"name":"Wondrous Invention (Level 5)","title":"Wondrous Invention (Level 5)","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Wondrous Invention - Bag of Holding","displayname":"Bag of Holding","previewtext":"A bag that's larger on the inside (64 cubic feet) and only ever weighs 15 pounds while holding up to 500."},{"name":"Wondrous Invention - Cap of Water Breathing","displayname":"Cap of Water Breathing","previewtext":"This cap creates a bubble around your head, allowing you to breathe underwater."},{"name":"Wondrous Invention - Driftglobe","displayname":"Driftglobe","previewtext":"A small globe that can be used to cast the Light or Daylight spells."},{"name":"Wondrous Invention - Goggles of Night","displayname":"Goggles of Night","previewtext":"These goggles grant you darkvision out to 60 feet."},{"name":"Wondrous Invention - Sending Stones","displayname":"Sending Stones","previewtext":"Small stones that can be used to communicate (through the sending spell) once a day."},{"name":"Wondrous Invention - Alchemy Jug","displayname":"Alchemy Jug","previewtext":"A ceramic jug that allows you to produce various liquids once a day. See the DMG for more details."},{"name":"Wondrous Invention - Helm of Comprehending Languages","displayname":"Helm of Comprehending Languages","previewtext":"This helm allows you to cast Comprehend Languages at will."},{"name":"Wondrous Invention - Lantern of Revealing","displayname":"Lantern of Revealing","previewtext":"A lantern that allows you to cast 30 feet of bright light (and an additional 30 feet of dim) that reveals invisible creatures and objects."},{"name":"Wondrous Invention - Ring of Swimming","displayname":"Ring of Swimming","previewtext":"A ring that gives you a swimming speed of 40 feet."},{"name":"Wondrous Invention - Robe of Useful Items","displayname":"Robe of Useful Items","previewtext":"A cloak covered in patches that can be pulled off to create items. See the DMG for more details."},{"name":"Wondrous Invention - Rope of Climbing","displayname":"Rope of Climbing","previewtext":"A rope that can be commanded to move to and secure itself to a specified point."},{"name":"Wondrous Invention - Wand of Magic Detection","displayname":"Wand of Magic Detection","previewtext":"A wand that can be used to cast Detect Magic up to 3 times a day, restoring 1d3 charges at dawn."},{"name":"Wondrous Invention - Wand of Secrets","displayname":"Wand of Secrets","previewtext":"A wand that can be used to find secret doors or traps up to 3 times a day, restoring 1d3 charges at dawn."}]},{"name":"Wondrous Invention (Level 10)","title":"Wondrous Invention (Level 10)","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Wondrous Invention - Bag of Holding","displayname":"Bag of Holding","previewtext":"A bag that's larger on the inside (64 cubic feet) and only ever weighs 15 pounds while holding up to 500."},{"name":"Wondrous Invention - Cap of Water Breathing","displayname":"Cap of Water Breathing","previewtext":"This cap creates a bubble around your head, allowing you to breathe underwater."},{"name":"Wondrous Invention - Driftglobe","displayname":"Driftglobe","previewtext":"A small globe that can be used to cast the Light or Daylight spells."},{"name":"Wondrous Invention - Goggles of Night","displayname":"Goggles of Night","previewtext":"These goggles grant you darkvision out to 60 feet."},{"name":"Wondrous Invention - Sending Stones","displayname":"Sending Stones","previewtext":"Small stones that can be used to communicate (through the sending spell) once a day."},{"name":"Wondrous Invention - Alchemy Jug","displayname":"Alchemy Jug","previewtext":"A ceramic jug that allows you to produce various liquids once a day. See the DMG for more details."},{"name":"Wondrous Invention - Helm of Comprehending Languages","displayname":"Helm of Comprehending Languages","previewtext":"This helm allows you to cast Comprehend Languages at will."},{"name":"Wondrous Invention - Lantern of Revealing","displayname":"Lantern of Revealing","previewtext":"A lantern that allows you to cast 30 feet of bright light (and an additional 30 feet of dim) that reveals invisible creatures and objects."},{"name":"Wondrous Invention - Ring of Swimming","displayname":"Ring of Swimming","previewtext":"A ring that gives you a swimming speed of 40 feet."},{"name":"Wondrous Invention - Robe of Useful Items","displayname":"Robe of Useful Items","previewtext":"A cloak covered in patches that can be pulled off to create items. See the DMG for more details."},{"name":"Wondrous Invention - Rope of Climbing","displayname":"Rope of Climbing","previewtext":"A rope that can be commanded to move to and secure itself to a specified point."},{"name":"Wondrous Invention - Wand of Magic Detection","displayname":"Wand of Magic Detection","previewtext":"A wand that can be used to cast Detect Magic up to 3 times a day, restoring 1d3 charges at dawn."},{"name":"Wondrous Invention - Wand of Secrets","displayname":"Wand of Secrets","previewtext":"A wand that can be used to find secret doors or traps up to 3 times a day, restoring 1d3 charges at dawn."},{"name":"Wondrous Invention - Bag of Beans","displayname":"Bag of Beans","previewtext":"A bag of small beans that have various effects when dumped or planted. See the DMG for details."},{"name":"Wondrous Invention - Chime of Opening","displayname":"Chime of Opening","previewtext":"A small chime that can open locks, doors, or containers. This item can be used up to 10 times before breaking."},{"name":"Wondrous Invention - Decanter of Endless Water","displayname":"Decanter of Endless Water","previewtext":"A small flask that can be used to pour either a gallon, 5 gallons, or a 30 gallon geyser of water. See the DMG for more details."},{"name":"Wondrous Invention - Eyes of Minute Seeing","displayname":"Eyes of Minute Seeing","previewtext":"Crystal lenses that give advantage on perception checks out to 1 foot, allowing for close examination."},{"name":"Wondrous Invention - Folding Boat","displayname":"Folding Boat","previewtext":"A small wooden box that can be expanded out to form a 10x4x2 or 24x8x6 boat."},{"name":"Wondrous Invention - Heward's Handy Haversack","displayname":"Heward's Handy Haversack","previewtext":"A backpack that stores up to 120 pounds. Pulling an item from the bag costs an action, but the wanted item will always be on top."}]},{"name":"Wondrous Invention (Level 15)","title":"Wondrous Invention (Level 15)","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Wondrous Invention - Bag of Holding","displayname":"Bag of Holding","previewtext":"A bag that's larger on the inside (64 cubic feet) and only ever weighs 15 pounds while holding up to 500."},{"name":"Wondrous Invention - Cap of Water Breathing","displayname":"Cap of Water Breathing","previewtext":"This cap creates a bubble around your head, allowing you to breathe underwater."},{"name":"Wondrous Invention - Driftglobe","displayname":"Driftglobe","previewtext":"A small globe that can be used to cast the Light or Daylight spells."},{"name":"Wondrous Invention - Goggles of Night","displayname":"Goggles of Night","previewtext":"These goggles grant you darkvision out to 60 feet."},{"name":"Wondrous Invention - Sending Stones","displayname":"Sending Stones","previewtext":"Small stones that can be used to communicate (through the sending spell) once a day."},{"name":"Wondrous Invention - Alchemy Jug","displayname":"Alchemy Jug","previewtext":"A ceramic jug that allows you to produce various liquids once a day. See the DMG for more details."},{"name":"Wondrous Invention - Helm of Comprehending Languages","displayname":"Helm of Comprehending Languages","previewtext":"This helm allows you to cast Comprehend Languages at will."},{"name":"Wondrous Invention - Lantern of Revealing","displayname":"Lantern of Revealing","previewtext":"A lantern that allows you to cast 30 feet of bright light (and an additional 30 feet of dim) that reveals invisible creatures and objects."},{"name":"Wondrous Invention - Ring of Swimming","displayname":"Ring of Swimming","previewtext":"A ring that gives you a swimming speed of 40 feet."},{"name":"Wondrous Invention - Robe of Useful Items","displayname":"Robe of Useful Items","previewtext":"A cloak covered in patches that can be pulled off to create items. See the DMG for more details."},{"name":"Wondrous Invention - Rope of Climbing","displayname":"Rope of Climbing","previewtext":"A rope that can be commanded to move to and secure itself to a specified point."},{"name":"Wondrous Invention - Wand of Magic Detection","displayname":"Wand of Magic Detection","previewtext":"A wand that can be used to cast Detect Magic up to 3 times a day, restoring 1d3 charges at dawn."},{"name":"Wondrous Invention - Wand of Secrets","displayname":"Wand of Secrets","previewtext":"A wand that can be used to find secret doors or traps up to 3 times a day, restoring 1d3 charges at dawn."},{"name":"Wondrous Invention - Bag of Beans","displayname":"Bag of Beans","previewtext":"A bag of small beans that have various effects when dumped or planted. See the DMG for details."},{"name":"Wondrous Invention - Chime of Opening","displayname":"Chime of Opening","previewtext":"A small chime that can open locks, doors, or containers. This item can be used up to 10 times before breaking."},{"name":"Wondrous Invention - Decanter of Endless Water","displayname":"Decanter of Endless Water","previewtext":"A small flask that can be used to pour either a gallon, 5 gallons, or a 30 gallon geyser of water. See the DMG for more details."},{"name":"Wondrous Invention - Eyes of Minute Seeing","displayname":"Eyes of Minute Seeing","previewtext":"Crystal lenses that give advantage on perception checks out to 1 foot, allowing for close examination."},{"name":"Wondrous Invention - Folding Boat","displayname":"Folding Boat","previewtext":"A small wooden box that can be expanded out to form a 10x4x2 or 24x8x6 boat."},{"name":"Wondrous Invention - Heward's Handy Haversack","displayname":"Heward's Handy Haversack","previewtext":"A backpack that stores up to 120 pounds. Pulling an item from the bag costs an action, but the wanted item will always be on top."},{"name":"Wondrous Invention - Boots of Striding and Springing","displayname":"Boots of Striding and Springing","previewtext":"These boots make your walking speed 30 feet and allow you to jump 3 times the normal distance."},{"name":"Wondrous Invention - Bracers of Archery","displayname":"Bracers of Archery","previewtext":"These bracers give proficiency in bows and add +2 to damage rolls made with them."},{"name":"Wondrous Invention - Brooch of Shielding","displayname":"Brooch of Shielding","previewtext":"This brooch makes you resistant to force damage and gives immunity to magic missile."},{"name":"Wondrous Invention - Broom of Flying","displayname":"Broom of Flying","previewtext":"This magical broom can carry up to 200 pounds at a flying speed of 50 or 400 with a flying speed of 30."},{"name":"Wondrous Invention - Hat of Disguise","displayname":"Hat of Disguise","previewtext":"This hat allows you to cast disguise self at will."},{"name":"Wondrous Invention - Slippers of Spider Climbing","displayname":"Slippers of Spider Climbing","previewtext":"These light shoes allow you to walk on walls and ceilings, while leaving your hands free."}]},{"name":"Wondrous Invention (Level 20)","title":"Wondrous Invention (Level 20)","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Wondrous Invention - Bag of Holding","displayname":"Bag of Holding","previewtext":"A bag that's larger on the inside (64 cubic feet) and only ever weighs 15 pounds while holding up to 500."},{"name":"Wondrous Invention - Cap of Water Breathing","displayname":"Cap of Water Breathing","previewtext":"This cap creates a bubble around your head, allowing you to breathe underwater."},{"name":"Wondrous Invention - Driftglobe","displayname":"Driftglobe","previewtext":"A small globe that can be used to cast the Light or Daylight spells."},{"name":"Wondrous Invention - Goggles of Night","displayname":"Goggles of Night","previewtext":"These goggles grant you darkvision out to 60 feet."},{"name":"Wondrous Invention - Sending Stones","displayname":"Sending Stones","previewtext":"Small stones that can be used to communicate (through the sending spell) once a day."},{"name":"Wondrous Invention - Alchemy Jug","displayname":"Alchemy Jug","previewtext":"A ceramic jug that allows you to produce various liquids once a day. See the DMG for more details."},{"name":"Wondrous Invention - Helm of Comprehending Languages","displayname":"Helm of Comprehending Languages","previewtext":"This helm allows you to cast Comprehend Languages at will."},{"name":"Wondrous Invention - Lantern of Revealing","displayname":"Lantern of Revealing","previewtext":"A lantern that allows you to cast 30 feet of bright light (and an additional 30 feet of dim) that reveals invisible creatures and objects."},{"name":"Wondrous Invention - Ring of Swimming","displayname":"Ring of Swimming","previewtext":"A ring that gives you a swimming speed of 40 feet."},{"name":"Wondrous Invention - Robe of Useful Items","displayname":"Robe of Useful Items","previewtext":"A cloak covered in patches that can be pulled off to create items. See the DMG for more details."},{"name":"Wondrous Invention - Rope of Climbing","displayname":"Rope of Climbing","previewtext":"A rope that can be commanded to move to and secure itself to a specified point."},{"name":"Wondrous Invention - Wand of Magic Detection","displayname":"Wand of Magic Detection","previewtext":"A wand that can be used to cast Detect Magic up to 3 times a day, restoring 1d3 charges at dawn."},{"name":"Wondrous Invention - Wand of Secrets","displayname":"Wand of Secrets","previewtext":"A wand that can be used to find secret doors or traps up to 3 times a day, restoring 1d3 charges at dawn."},{"name":"Wondrous Invention - Bag of Beans","displayname":"Bag of Beans","previewtext":"A bag of small beans that have various effects when dumped or planted. See the DMG for details."},{"name":"Wondrous Invention - Chime of Opening","displayname":"Chime of Opening","previewtext":"A small chime that can open locks, doors, or containers. This item can be used up to 10 times before breaking."},{"name":"Wondrous Invention - Decanter of Endless Water","displayname":"Decanter of Endless Water","previewtext":"A small flask that can be used to pour either a gallon, 5 gallons, or a 30 gallon geyser of water. See the DMG for more details."},{"name":"Wondrous Invention - Eyes of Minute Seeing","displayname":"Eyes of Minute Seeing","previewtext":"Crystal lenses that give advantage on perception checks out to 1 foot, allowing for close examination."},{"name":"Wondrous Invention - Folding Boat","displayname":"Folding Boat","previewtext":"A small wooden box that can be expanded out to form a 10x4x2 or 24x8x6 boat."},{"name":"Wondrous Invention - Heward's Handy Haversack","displayname":"Heward's Handy Haversack","previewtext":"A backpack that stores up to 120 pounds. Pulling an item from the bag costs an action, but the wanted item will always be on top."},{"name":"Wondrous Invention - Boots of Striding and Springing","displayname":"Boots of Striding and Springing","previewtext":"These boots make your walking speed 30 feet and allow you to jump 3 times the normal distance."},{"name":"Wondrous Invention - Bracers of Archery","displayname":"Bracers of Archery","previewtext":"These bracers give proficiency in bows and add +2 to damage rolls made with them."},{"name":"Wondrous Invention - Brooch of Shielding","displayname":"Brooch of Shielding","previewtext":"This brooch makes you resistant to force damage and gives immunity to magic missile."},{"name":"Wondrous Invention - Broom of Flying","displayname":"Broom of Flying","previewtext":"This magical broom can carry up to 200 pounds at a flying speed of 50 or 400 with a flying speed of 30."},{"name":"Wondrous Invention - Hat of Disguise","displayname":"Hat of Disguise","previewtext":"This hat allows you to cast disguise self at will."},{"name":"Wondrous Invention - Slippers of Spider Climbing","displayname":"Slippers of Spider Climbing","previewtext":"These light shoes allow you to walk on walls and ceilings, while leaving your hands free."},{"name":"Wondrous Invention - Eyes of the Eagle","displayname":"Eyes of the Eagle","previewtext":"These crystal lenses give you advantage on perception checks that rely on sight and allow you to make out details on objects and creatures far away."},{"name":"Wondrous Invention - Gem of Brightness","displayname":"Gem of Brightness","previewtext":"A small gem that allows you to cast varying degrees of light, to either illuminate an area or blind foes. See the DMG for more details."},{"name":"Wondrous Invention - Gloves of Missile Snaring","displayname":"Gloves of Missile Snaring","previewtext":"These gloves allow you to reduce damage from ranged weapon attacks by 1d10+1, catching the projectile if damage is reduced to 0."},{"name":"Wondrous Invention - Gloves of Swimming and Climbing","displayname":"Gloves of Swimming and Climbing","previewtext":"When wearing these gloves, swimming and climbing don't cost extra movement, and you have +5 to athletics roles to do either."},{"name":"Wondrous Invention - Ring of Jumping","displayname":"Ring of Jumping","previewtext":"This ring allows you to cast Jump on yourself as a bonus action."},{"name":"Wondrous Invention - Ring of Mind Shielding","displayname":"Ring of Mind Shielding","previewtext":"While wearing this ring, your thoughts cannot be read, people can't magically tell if you're lying, and telepathy only works if you allow it. You can also use an action to make the ring invisible."},{"name":"Wondrous Invention - Wings of Flying","displayname":"Wings of Flying","previewtext":"This cloak can turn into wings that allow you to fly at a speed of 60 feet for 1 hour. Once used, they can't be used again for 1d12 hours."}]},{"name":"Alchemical Formula","title":"Alchemical Formula","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Healing Draught","displayname":"Healing Draught","previewtext":"As an action, you can reach into your Alchemist’s Satchel and pull out a vial of healing liquid. A creature can drink it as an action to regain 1d8 hit points. The vial then disappears. Once a creature regains hit points from this alchemical formula, the creature can’t do so again until it finishes a long rest. If not used, the vial and its contents disappear after 1 hour. While the vial exists, you can’t use this formula. This formula’s healing increases by 1d8 when you reach certain levels in this class: 3rd level (2d8), 5th level (3d8), 7th level (4d8), 9th level (5d8), 11th level (6d8), 13th level (7d8), 15th level (8d8), 17th level (9d8), and 19th level (10d8)."},{"name":"Smoke Stick","displayname":"Smoke Stick","previewtext":"As an action, you can reach into your Alchemist’s Satchel and pull out a stick that produces a thick plume of smoke. You can hold on to the stick or throw it to a point up to 30 feet away as part of the action used to produce it. The area in a 10-foot radius around the stick is filled with thick smoke that blocks vision, including darkvision. The stick and smoke persist for 1 minute and then disappear. After using this formula, you can’t do so again for 1 minute."},{"name":"Swift Step Draught","displayname":"Swift Step Draught","previewtext":"As a bonus action, you can reach into your Alchemist’s Satchel and pull out a vial filled with a bubbling, brown liquid. As an action, a creature can drink it. Doing so increases the creature’s speed by 20 feet for 1 minute, and the vial disappears. If not used, the vial and its contents disappear after 1 minute. After using this formula, you can’t do so again for 1 minute."},{"name":"Tanglefoot Bag","displayname":"Tanglefoot Bag","previewtext":"As an action, you can reach into your Alchemist’s Satchel and pull out a bag filled with writhing, sticky black tar and hurl it at a point on the ground within 30 feet of you (the bag and its contents disappear if you don’t hurl the bag by the end of the current turn). The bag bursts on impact and covers the ground in a 5- foot radius with sticky goo. That area becomes difficult terrain for 1 minute, and any creature that starts its turn on the ground in that area has its speed halved for that turn. After using this formula, you can’t do so again for 1 minute."},{"name":"Thunderstone","displayname":"Thunderstone","previewtext":"As an action, you can reach into your Alchemist’s Satchel and pull out a crystalline shard and hurl it at a creature, object, or surface within 30 feet of you (the shard disappears if you don’t hurl it by the end of the current turn). The shard shatters on impact with a blast of concussive energy. Each creature within 10 feet of the point of impact must succeed on a Constitution saving throw or be knocked prone and pushed 10 feet away from that point."}]}],"feats":[{"name":"Silver-Tongued","displayname":"Silver-Tongued","effects":[{"modifyabilityscore":{"charisma":"1"}},{"featuretext":"• You\tgain\tproficiency\tin\tthe\tDeception\tskill.\tIf\t\r\nyou\tare\talready\tproficient\tin\tthe\tskill,\tyou\tadd\t\r\ndouble\tyour\tproficiency\tbonus\tto\tchecks\tyou\t\r\nmake\twith\tit.\r\n• When\tyou\ttake\tthe\tAttack\taction\ton\tyour\tturn,\t\r\nyou\tcan\treplace\tone\tattack\twith\tan\tattempt\tto\t\r\ndeceive\tone\thumanoid\tyou\tcan\tsee\twithin\t30\t\r\nfeet\tof\tyou\tthat\tcan\tsee\tand\thear\tyou.\tMake\ta\t\r\nCharisma\t(Deception)\tcheck\tcontested\tby\tthe\t\r\ntarget’s\tWisdom\t(Insight)\tcheck.\tIf\tyour\tcheck\t\r\nsucceeds,\tyour\tmovement\tdoesn’t\tprovoke\t\r\nopportunity\tattacks\tfrom\tthe\ttarget\tand\tyour\t\r\nattack\trolls\tagainst\tit\thave\tadvantage;\tboth\t\r\nbenefits\tlast\tuntil\tthe\tend\tof\tyour\tnext\tturn\tor\t\r\nuntil\tyou\tuse\tthis\tability\ton\ta\tdifferent\ttarget.\tIf\t\r\nyour\tcheck\tfails,\tthe\ttarget\tcan’t\tbe\tdeceived\tby\t\r\nyou\tin\tthis\tway\tfor\t1\thour."}]}],"weapons":[]}