{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"CIRCLE OF THE ABYSS","class":"Druid","level":{"2":[{"featuretext":"DEMONIC TUTOR\n\nWhen you choose this Circle at second level, through your connection to the Abyss, you gain resistance to Fire damage. Also you learn to speak. read and write Abyssal\n\nDEMONIC WILDSHAPE\n\nWhen you choose this Circle at second level, the list of creatures whose form you can enter through Wild Shape is extended to include Demons. The Demon can have a Fly Speed even if your Druid level is 7 or lower. All other restrictions that your Beast Wild Shape have, also apply to\n\nthe Demon Wild Shape. At 18th level you may also Beast Spells also applies to Demon forms."}],"6":[{"featuretext":"DEMONIC FURY\n\nYou have the power of the Abyss at your fingertips. Starting at 6th level you can use a Bonus Action to enter\n\nDemonic Fury. It lasts for one minute, or until you are\n\nknocked unconscious. You can choose to dismiss Demonic\n\nFury as a free action.\n\nWhile Furious, your melee attacks deal an additional Id6\n\nFire damage. You are immune to the Fear condition, and if you were affected by Fear when entering Demonic Fury the condition ends. You can enter Demonic Fury a number of times equal to\n\nyour Proficiency Bonus and you regain all uses after a Long\n\nRest."}],"10":[{"featuretext":"DEMONIC TRANSFORMATION\n\nThe Abyssal energy has saturated your body to such a degree that your physical appearance begins to change. Patches of skin might become thicker and more leathery in appearance, hair might fall outto be replaced by horns or bony ridges, feet might become hoofed and limbs might look swollen and out of proportions.\n\nStarting at 10th level you gain a +1 bonus to AC (Natural) Also, while in your Demonic Fury, you have resistance to Bludgeoning, Piercing and Slashing damage from non magical sources,"}],"17":[{"featuretext":"ABYSSAL HOME\n\nWith every passing day, your bonds to the Material Plane weaken as your connection to the Abyss strengthens.\n\nStarting at 14th level when you die anywhere outside of the Abyss your body decomposes in a week's time. After this week any healing magic will not work if a part of the body is required.\n\nYour body then regrows in the Abyss in a span of 1d6\n\nwecks after that. At the end of this period you emerge in the Abyss from a meatsack fully rested but without any of your equipment. On any attempt to employ magic to resurrect you, you have the choice to accept or reject the pull of this magic.\n\nIn addition, you may cast Plane Shift shifting from the\n\nMaterial Plane to the Abyas or vice versa without the\n\nmaterial component."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}