{
  "Eldritch Invocations": [
    {
      "name": "Cloak of the Raven",
      "prerequisite": "15th level, Pact of the Cloak feature",
      "description": "You can use a bonus action on your turn to cause large, raven-like wings to sprout out of your cloak. While you wear the winged cloak, you gain a flying speed equal to your current speed. You can dismiss the wings using another bonus action."
    },
    {
      "name": "Ghost-Iron Chains",
      "prerequisite": "5th level, Pact of the Chain feature",
      "description": "Your familiar becomes ghostly in appearance, and gains the ability to become incorporeal. Your familiar can move through other creatures and objects as if they were difficult terrain, but if it ends its turn inside an object it is immediately dismissed to its pocket dimension."
    },
    {
      "name": "Mantle of the Everlasting",
      "prerequisite": "Pact of the Cloak feature",
      "description": "You gain proficiency with medium and heavy armor."
    },
    {
      "name": "March of the Restless",
      "prerequisite": "5th level",
      "description": "You can cast animate dead using a warlock spell slot. You can do so twice, and regain both uses when you complete a long rest."
    },
    {
      "name": "Mirror Blade",
      "prerequisite": "Pact of the Blade feature",
      "description": "When you conjure a one-handed weapon as your pact weapon and have nothing in your other hand, you can conjure a shadowy copy of the weapon in your other hand. You can perform two-weapon fighting with these weapons, even if the weapons aren't light, and you can perform the somatic components of spells while both your hands are wielding your pact weapons. While the second weapon counts as magical, it does not inherit any magical properties from the weapon it was copied from."
    },
    {
      "name": "Pact of Blood",
      "prerequisite": "7th level",
      "description": "You can cast blood seal at will as a 2nd-level spell, without expending a spell slot or material components. You still need to pay the hemomancy cost as normal."
    },
    {
      "name": "Sanguine Seeker",
      "prerequisite": "eldritch blast cantrip",
      "description": "When you reduce a creature to 0 hit points with eldritch blast, you can cause the beam to continue through the creature, taking on a crimson hue. Select a new target within range and make a ranged spell attack against it. That creature takes force damage equal to any excess damage left over from the previous attack, plus an additional 1d4 necrotic damage."
    },
    {
      "name": "Tales of the Crimson Tome",
      "prerequisite": "Pact of the Tome feature",
      "description": "You can drop a pinch of humanoid blood into your book of shadows, and then ask one question aloud. Over the next minute, the blood manipulates itself into a language of your choice, answering your question in the process. The answer is provided using the knowledge of the humanoid that provided the blood, and is answered in less than 25 words. The blood must be from a living humanoid, and needs to be dropped into the book within a minute of it leaving the body."
    },
    {
      "name": "Veil of the Night",
      "prerequisite": "9th level,
