{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Arcane Archer","displayname":"Arcane Archer","class":"Fighter","previewtext":"Conjure magic infused arrows","spellcastingability":"intelligence","level":{"3":[{"featuretextwithbullet":"Magic Arrow: Whenever you fire a nonmagical arrow from a shortbow or longbow, you can make it a +1 magic arrow. The magic fades after it hits or misses the target."},{"featuretextwithbullet":"Arcane Shot: You learn 2 Arcane Shot options. Once per turn when you fire a nonmagical arrow from a shortbow or longbow, you can apply an Arcane Shot. You can decide to use it once you know that your arrow has hit the target, unless the Arcane Shot doesn't involve an attack roll. If an option requires a saving throw, the DC is 8 + proficiency + Int mod. \n You have 2 uses of this ability (indicated on the resource page of the app) and regain them on a short or long rest. You learn additional Arcane Shot options at later levels."},{"sharedclassfeaturemenu":{"name":"Arcane Shot","selections":"2","class":"Fighter"}},{"skillmenu":{"skills":["Arcana","Nature"],"selections":"1","title":"Arcane Archer's Lore"}},{"setresource":{"name":"Arcane Shot","displayname":"Arcane Shot","amount":"2","reset":"shortrest","spendable":"true"}}],"7":[{"featuretextwithbullet":"Curving Shot: When you make an attack roll with a magic arrow and miss, you can use a bonus action to reroll the attack roll against a different target withing 60ft of the original target."},{"sharedclassfeaturemenu":{"name":"Arcane Shot","selections":"1","class":"Fighter"}}],"15":[{"featuretextwithbullet":"Ever-Ready Shot: If you roll initiative and have no uses of Arcane Shot remaining, you regain one use of it."},{"sharedclassfeaturemenu":{"name":"Arcane Shot","selections":"1","class":"Fighter"}}],"10":[{"sharedclassfeaturemenu":{"name":"Arcane Shot","selections":"1","class":"Fighter"}}],"18":[{"sharedclassfeaturemenu":{"name":"Arcane Shot","selections":"1","class":"Fighter"}}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[{"name":"Arcane Shot","title":"Arcane Shot","selections":"2","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":":"},"entries":[{"name":"Banishing Arrow","displayname":"Banishing Arrow","previewtext":"If this arrow hits a creature, it must succeed on a Charisma saving through or be banished to a harmless location. While banished, its speed is 0, and it is incapacitated. At the end of its next turn, it reappears in the space it vacated, or nearby. \n Once you reach level 18 in this class, the target also takes 2d6 force damage."},{"name":"Brute Bane Arrow","displayname":"Brute Bane Arrow","previewtext":"If this arrow hits a creature, it takes an extra 2d6 necrotic damage, and must make a Constitution saving throw. On a failed save, the damage from the target's attacks deal half damage until the start of your next turn.  \n Once you reach level 18 in this class, the damage increases to 4d6."},{"name":"Bursting Arrow","displayname":"Bursting Arrow","previewtext":"If this arrow hits a creature, the target and each creature within 10ft of it also take 2d6 force damage. \n Once you reach level 18 in this class, the damage increases to 4d6."},{"name":"Grasping Arrow","displayname":"Grasping Arrow","previewtext":"If this arrow hits a creature, it takes an extra 2d6 poison damage, its speed is reduced by 10ft, and it takes 2d6 slashing damage the first time on each turn it moves 1ft or more without teleporting. The target or nearby creature can use an action to make a Strength (Athletics) check vs your Arcane Shot DC to remove the brambles. Otherwise they last 1 minute.  \n Once you reach level 18 in this class, the damage of both effects increases to 4d6."},{"name":"Mind Scrambling Arrow","displayname":"Mind Scrambling Arrow","previewtext":"If this arrow hits a creature, it takes an extra 2d6 psychic damage. Additionally, the target makes a Wisdom saving throw. If it fails, choose an ally. The target can't attack the chosen ally or include it in a harmful area of effect until the start of your next turn. The effect ends early if the ally deals any damage to the target.  \n Once you reach level 18 in this class, the damage increases to 4d6."},{"name":"Piercing Arrow","displayname":"Piercing Arrow","previewtext":"When using this feature, you don't make an attack roll. Instead, you shoot an arrow that fies across a space 1ft wide and 30ft long. The arrow passes through objects, ignoring cover. Each creature in the line must make a Dexterity saving throw. On a failed save, a target takes normal damage from the arrow, plus an extra 1d6. Half damage on a sucessful save. \n Once you reach level 18 in this class, the damage increases to 2d6."},{"name":"Seeking Arrow","displayname":"Seeking Arrow","previewtext":"When using this feature, you don't make an attack roll. Instead, choose one creature you have seen in the past minute. The arrow curve to the target, ignoring half and three quarters cover. If the target is within range, they must make a Dexterity saving throw. On a failed save, the target takes normal damage from the arrow, plus an extra 1d6, and you learn the target's location. Half damage on a sucessful save and you don't learn the location. \n Once you reach level 18 in this class, the damage increases to 2d6."},{"name":"Shadow Arrow","displayname":"Shadow Arrow","previewtext":"If this arrow hits a creature, it takes an extra 2d6 psychic damage and it must succeed on a Wisdom saving throw or it is unable to see anything farther than 5ft until the start of your next turn.  \n Once you reach level 18 in this class, the damage increases to 4d6."}]}],"feats":[],"weapons":[]}
