{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Gunslinger","displayname":"Gunslinger","class":"Fighter","previewtext":"Specializes in firearms ","level":{"3":[{"featuretextwithbullet":"Fighter Archetype: Gunslinger"},{"featuretextwithbullet":"Gunsmith - You can use Tinker's Tools to craft ammo, repair firearms, or design new ones. "},{"featuretextwithbullet":"Grit Points:"},{"featuretext":"    -Max Grit points equal to Wis mod. Regain all Grit after short or long rest"},{"featuretext":"    -Regain 1 Grit point on a critical hit. (crit must be from an attack roll, not granted via status effect)"},{"featuretext":"    -Regain 1 Grit point when dealing the final blow to an enemy."},{"setresource":{"name":"Grit Points","displayname":"Grit","amount":"wisdommodifier","reset":"shortrest","spendable":"true"}},{"showresource":"Grit Points"},{"featuretextwithbullet":"Deadeye Shot - Spend 1 Grit point to gain advantage on the next attack roll made with a firearm this round."},{"addweaponproficiencies":["Firearms (See Chart)"]}],"7":[{"featuretextwithbullet":"Quickdraw:"},{"featuretext":"    -Add proficiency bonus to initiative.\n    - You can stow and draw a firearm with the same object interaction."},{"setinitiativeproficiency":"true"},{"featuretextwithbullet":"Violent Shot - Spend 1 or more Grit points before making an attack roll. For each Grit spent, add +2 to the weapon's misfire score. If the attack hits, the damage is increased by 1 die per Grit."}],"10":[{"featuretextwithbullet":"Trick Shot - Spend 1 Grit point before attacking to target a body part, giving the attack an effect in addition to the normal damage. DC: 8 + Proficiency + Dex Mod. Effects for each body part:"},{"featuretext":"    -Head: Target makes a Con save or has disadvantage on all attacks until the end of their next turn. "},{"featuretext":"    -Arms: Target makes a Str save or drops a held item."},{"featuretext":"    -Torso: Target is pushed 10 ft away from you. "},{"featuretext":"    -Legs\/Wings: Target makes Str save or knocked prone."},{"setspellcastingability":"Dexterity"}],"15":[{"featuretextwithbullet":"Lightning Reload: Can now reload a firearm as a bonus action. "},{"featuretextwithbullet":"Piercing Shot - Spend 1 Grit point before making an attack. If the attack hits, make an attack roll against every creature in a line within the weapon's first range value. The firearm can only misfire on the initial shot."}],"18":[{"featuretextwithbullet":"Vicious Intent - Your attacks with firearms score critical hits on a roll of 19 or 20."},{"featuretextwithbullet":"Hemorrhaging Critical: When you score a critical hit with a firearm, the target takes extra damage equal to half of the attack's damage at the end of its next turn."}],"all":[{"ifthenelse":{"if":[{"archetype":{"name":"Gunslinger","class":"Fighter"}}],"then":[{"setresource":{"name":"Grit Points","displayname":"Grit","amount":"wisdommodifier","reset":"shortrest","spendable":"true"}}]}}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
