{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Hero Born","class":"Sorcerer","spellcastingability":"charisma","level":{"1":[{"featuretext":"BRAVE SOUL\nWhen you choose this origin at 1st level you soul remembers\nthe ways of war. You gain proficiency with simple weapons\nand martial meloc weapons.\nIn addition, this power imbues you with memories of ages\npast. You gain praticiency in the History skill\nHERO'S BIRTHRIGHT\nA: Ist level your power animates you in battle, allowing you to\ndefleci blows and wild weapons that you otherwise could\nnot. While you are wearing no armor and not wiclding a\nshiekh your AC equals 10+ your Dexterity modifier + your\nCharisma modific.\nDuring a long rest you can touch one melee weapon that\nYou are proficient with and that lacks the two banded\nproperty. That wapon is infused with your power and\nbecomes a heroic weapoo, which can be used as a\nspellcasting focus for your sorcerer spells When you attack\nwith your heroic weapon, you can use your Charisma\nmodifier, instead of Strength or Dexterity, for the attack and\ndamage rolls. You can't attack in this way if you are wearing\nheavy armor or using a shick and you can caly have ono\nheroic weapon at a time."}],"6":[{"featuretext":"SPELLBOUND STRIKES\nStarting at 6th level you begin to master magical combat. The\nfint creature you hit on each of your turns with a weapon\nattack takes extra damage equal to half your sorcerer level of\nthe same type dealt by the weapon. Ako on your turn, you can\nSpend sorcery points to enhance one melde weapon attack\nwith a Spellbound Strike. You learn two of the following\nStrikers. You leam one more at 14th and 18th level\nFleroic Strike. After you make your attack, you spend 1\nsorcery point to make other weapon attack as a bonus\naction\nEthereul Strike. Alter you make your attack you can spend\ncither I sorcery point to take the Disengage action is a bonus\naction, or 2 sorcery points to take the Dodge action as a bonus\naction.\nGlorious Strike. If your attack hits a creature, you can\nSpend 2 sorcery points to restore hit poenis equal to your\nCharisma modifier to 2 creatures of your choice within 10 feet\nof you.\nResounding Strike. If your attack hits a creature, you can\nspend 2 sorcery points to force it to make a Strength saving\nthrow. W it fails, it is knocked prone or pushed 10 feet away\nfrom you (our choice)"}],"14":[{"featuretext":"ARCANE WILL\nBeginning at 14th level you can hames the excess energy of\nyour magic into a bristling forcefield While you maintain\nconcentration on a spell you gain a bonito your Constitution\nsaving throws equal to your Charisma modifier\nWhen a creature hits you with an attack while you maintain\nconcentration on a spell you can use your reaction to deal\nId 10 force damage to it. If the attack breaks your\nconcentration, this damnge Increases to 1d10+hall your\nsorcerer level. You must be able to see a creature to use this\nreaction against it"}],"18":[{"featuretext":"LIVING LEGEND\nUpon reaching 18th level you fully embody the power and\nresolve of your herole ancestor. When you casi a sorcerer\nspell you sain temporary hit points equal to the spell level\nyour Charisma modifier. These liit poituls are lost after 10\nminutes\nIn addition, the cost of all your Spellbound Striker is\nfcduoed by 1 sorcery point."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}