{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Horizon Walker","class":"Ranger","level":{"3":[{"addspell":{"name":"Protection from Evil and Good","spelllevel":"1"}},{"featuretext":"Detect Portal\n\nAt 3rd level, you gain the ability to magically sense the presence of a planar portal. As an action, you detect the distance and direction to the closest planar portal within 1 mile of you.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.\n\nSee the \"Planar Travel\" section in chapter 2 of the Dungeon Master's Guide for examples of planar portals.\n\nPlanar Warrior\n\nAt 3rd level, you learn to draw on the energy of the multiverse to augment your attacks.\n\nAs a bonus action, choose one creature you can see within 30 feet of you. The next time you hit that creature on this turn with a weapon attack, all damage dealt by the attack becomes force damage, and the creature takes an extra 1d8 force damage from the attack. When you reach 11th level in this class, the extra damage increases to 2d8.\n\n"}],"5":[{"addspell":{"name":"Misty Step","spelllevel":"2"}}],"7":[{"featuretext":"Ethereal Step\n\nAt 7th level, you learn to step through the Ethereal Plane. As a bonus action on your turn, you can cast the Etherealness spell with this feature, without expending a spell slot, but the spell ends at the end of the current turn.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest.\n\n"}],"9":[{"addspell":{"name":"Haste","spelllevel":"3"}}],"11":[{"featuretext":"Distant Strike\n\nAt 11th level, you gain the ability to pass between the planes in a blink of an eye. When you use the Attack action, you can teleport up to 10 feet before each attack to an unoccupied space you can see.\n\nIf you attack at least two different creatures with the action, you can make one additional attack with it against a third creature.\n\n"}],"13":[{"addspell":{"name":"Banishment","spelllevel":"4"}}],"15":[{"featuretext":"Spectral Defense\n\nAt 15th level, your ability to move between planes enables you to slip through the planar boundaries to lessen the harm done to you during battle. When you take damage from an attack, you can use your reaction to give yourself resistance to all of that attack's damage on this turn.\n\n"}],"17":[{"addspell":{"name":"Teleportation Circle","spelllevel":"5"}}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}