{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Meditating Soul","class":"Sorcerer","level":{"1":[{"featuretext":"MAGICAL ARTS\nAt 1st level you have learned martial arts alongside\nspellcasting, so you have discovered how to better defend\nyourself while casting your spells. While you aren't wearing\narmor or wielding a shield, you gain the following bencfits:\nYou can use a bonus action on your turn to take the Dodge\naction immediately before or after you cast a spell of 1st\nlevel or higher\n• You can replace the material components (those without a\ncost) of a spell with a somatic component represented by\nan appropriate martial arts technique instead (casting\ntimes longer than an action or bonus action would be\nrepresented by long martial arts demonstrations\nthroughout the casting time)."},{"featuretext":"SOUL FIST TECHNIQUE\nStarting at 1st level your practice of martial arts gives you\nbetter control over the untamed magic raging inside you.\nWith that newfound control you have learned how to meld\nyour magical power into your marital arts to practice a new\nfighting style known as the soul fist technique. While you\naren't wearing armor or wielding a shield you gain the\nfollowing benefits:\nYou can use your action to attack with an enhanced punch\nor kick powered by your magical energy (this is a unique\naction and not a new option for the attack action. The\nsoul strike is a melee spell attack with a range of 5 feet.\nYou are proficient with it, and you add your Charisma\nmodifier to the attack and damage rolls. Its damage is\nbludgeoning, and its damage die is a d&\nThis dic changes as you gain Sorcerer levels. The\ndamage of the soul strike changes to 2d8 at level 5 to 3d8\nat level 11, and to 4d8 at level 17\n. If you make a soul strike on your turn, you gain a +2 bonus\nto AC until the start of your next turn, while you aren't\nincapacitated\n• When a hostile creature's movement provokes an\nopportunity attack from you, you can use your reaction to\nmake 1 soul strike on that creature, rather than making an\nopportunity attack"}],"6":[{"featuretext":"DISCIPLE OF METAMAGICS\nAt 6th level, you become inspired by your ability to twist your\nspells to suit your needs, so you start personalizing your soul\nfist technique. You gain metamagic disciplines based on your\nchosen Metamagic options. These metamagic disciplines are\ndetailed at the end of the subclass description. Different\nmetamagic disciplines can be used on the same turn with no\nrestrictions outside how many sorcery points you have left\n(For example, you can use both the Careful Spell and\nHeightened Spell disciplines on the same soul strike so long\nyou meet the requirements for cach of them). You can't cast\nspells other than cantrips the turn you use a metamagic\ndiscipline"},{"featuretext":"METAMAGIC DISCIPLINES\nThe Disciple of Metamagics feture lets you learn disciplines if\nyou have the corresponding Metamagic options.\n\nCareful Spell When you target a hostile creature with\nyour soul strike, you can spend 1 sorcery point to gain the\nbenefit of the Disengage action. When you reach 14th level of\nSorccrcr, your walking speed incrcascs by 10 feet until the\nend of the current turn as well\n\nDistant Spell. When you make a soul strike on your tum,\nyou can spend 1 sorcery point to make your reach for it is 5\nfect grcater than normal When you reach 14th level of\nSorcerer, your reach for the soul strike on your turn is 25 fect\ngreater than normal instead.\n\nEmpowered Spell. When you hit a target with your soul\nstrike, you can spend sorcery points (5 max) to add 1d6 to the\ndamage roll for each sorcery point spent. When you reach\n14th level of Sorcerer, you now add 1d8 to the damage roll\nfor each sorcery point spent instead.\n\nExtended Spell As a bonus action, you can spend 2\nsorcery points to spend I Hit Die to heal yourself. Roll the\ndie, add your Constitution modifier, and regain a number of\nhit points equal to the total (minimum of 1) When you reach\n14th level of Sorcerer, you gain temporary hit points equal to\ndouble the amount of hit points recovered as well.\n\nHeightened Spell When you hit a creature with your soul\nstrike, you can spend 3 sorcery points to give the target\ndisadvantage on their next saving throw until the start of your\nnext turn.\n\nQuickened Spell You can spend 2 sorcery points to use\nyour soul strike with a bonus action.\n\nSeeking Spell As a bonus action, you can spend 2 sorcery\npoints to gain advantage on your next soul strike attack roll\nWhen you reach 14th level of Sorcerer, your next soul strike\nignores half cover and three-quarters cover.\n\nSubtle Spell. As a bonus action, you can spend 1 sorcery\npoint to gain proficiency in the Acrobatics, Stcalth, and Slight\nof Hand skills if you don't already have it until the start of\nyour next turn. When you reach 14th level of Sorcerer, your\nproficiency bonus is doubled for any ability check you make\nthat uses these proficiencies, but you cannot benefit from a\nsimilar feature, such as Expertise, that doubles your\nproficiency bonus for Acrobatics, Stealth, or Slight of Hand\n\nTransmuted Spell When you hit a target with your soul\nstrike. you can spend 1 sorcery point to change your soul\nstrike's damage type from bludgeoning to acid, cold, fire,\nlightning, poison, or thunder damage till the end of your next\nturn. When you reach 14th level in Sorcerer, your soul strike's\ndamage type remains changed for 1 minute instead.\n\nTwinned Spell When you use your action to use your soul\nstrike, you can spend 1 sorcery point to make 2 soul fists\nstrikes instead of just 1."}],"14":[{"featuretext":"MASTERY OF BODY AND SOUL\nAt level 14, you have mastered the soul fist technique. All your\ntraining of your body and soul has now bore fruit, so you gain\nthe following benefits:\n• You gain proficiency in Dexterity or Wisdom saving\nthrows (your choice)\nYou suffer none of the frailty of old age, and you cannot be\naged magically. You can still die of old age however,"}],"18":[{"featuretext":"AWAKENING OF ASTRAL POWER\nAt level 18 you can unlock the subconscious restraints you\nplaced on your magical power to prevent it from getting out of\ncontrol. Now that you have full control over your magic with\nno restrictions on them, you can use it to enhance your soul\nfist technique's power to reach your full potential\nAs a bonus action, you can spend 10 sorcery points to gain\nthe following benefits for 1 minute while you are not\nincapacitated:\n• You summon three copies of your astral self to appear\nalongside you and assist in battle. You gain the effects of a\nmirror image spell, but the duplicates can now affect\ncreatures that relies on senses other than sight, such as\nblindsight, or if it can perceive illusions as false, as with\ntrucsight.\n• You gain resistance to bludgeoning, piercing, and slashing\ndamage from nonmagical weapons.\nYour soul strike now has a +3 bonus to attack and damage\nrolls."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}