{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Oath of the Unconquered","class":"Paladin","previewtext":"Unbreakable and Dominating","spellprogression":"half","spellcastingability":"charisma","level":{"3":[{"featuretext":"CHANNEL DIVINITY \nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options. Adamantine Bulwark. Anytime you take damage from an attack or spell, you can use your reaction and your channel divinity to reduce all damage you take by an amount equal to three times your paladin level Unstoppable Charge. You can spend an action to use your channel divinity to move up to your speed in a straight line. You can move through enemy creatures, and the first enemy creature of up to one size larger than you or smaller that you come in contact with must succeed on a strength saving throw or take bludgeoning damage equal to 2d8 + your paladin level, and be forcefully moved along with you until you finish your movement. Each other creature whose space you, or the creature you are pushing, pass through during this action must succeed on a dexterity saving throw or be knocked prone. "}],"5":[{"addspell":{"name":"Warding bond, Enlarge\/Reduce","spelllevel":"2"}}],"7":[{"featuretext":"AURA OF IRON\nBeginning at 7th level, you emanate so many protective magics that it is almost palpable. You and friendly creatures within 10 feet of you reduce all damage taken by an amount equal to your Charisma modifier (minimum 1). You reduce damage this way before resistances have been calculated. At 18th level, the range of this aura increases to 30 feet. "}],"9":[{"addspell":{"name":"Beacon of Hope, Wind Wall","spelllevel":"3"}}],"13":[{"addspell":{"name":"Resilient Sphere, Freedom of Movement","spelllevel":"4"}}],"15":[{"featuretext":"LIVING FORTRESS\nAt 15th level, you have come to embody many qualities of an actual fortress. You can no longer be forcefully moved by spell effects, or by abilites used by creatures that are one size larger than you or smaller. Additionally, allies who are within 5 feet of you, and are of your size or smaller, gain the benefits of half cover."}],"17":[{"addspell":{"name":"Passwall, Stonewall","spelllevel":"5"}}],"20":[{"featuretext":"UNBREAKABLE DEFENDER\nAt 20th level, you can use an action to create an additional, secondary layer of armor made of solidified radiant energy that appears over your form. For one minute you gain the following benefits: \n• If an attack or spell that deals damage would damage you for 15 hit points or less, you ignore it. • Anytime a hostile creature makes a ranged attack against an allied creature within your Aura of Iron, you can roll a d6. On a 4 or higher, you become the target of the attack instead. • Allied creatures within 30ft of you always gain the benefits of half cover. \nOnce you use this feature, you can't use it again until you finish a long rest. "}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
