{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Oath of the Hellsworn","class":"Paladin","level":{"3":[{"featuretext":"CHANNEL DIVINITY\nWhen you take this oath at 3rd level. you gain\nthe following two Channel Divinity options,\nHellfire Weapon. As an action, you can\nwreathe a weapon that you are holding with the\nfires of hell, using your Channel Divinity. For 1\nminute, you add your Charisma modifier in fire\ndamage to the damage dealt by an attack from\nthat weapon (with a minimum bonus of +1), The\nweapon also emits bright light in a 10-foot radius\nand dim light 10 feet beyond that. If the weapon\nis not already magical, it becomes magical for\nthe duration.\nWhen you first use this Channel Divinity or as\nan action on a later turn, you may immediately\nend this effect by slamming your weapon into the\nground, unleashing a line of hellfire 30 feet long\nand 5 feet wide in the direction you are facing.\nEach creature in the line must make a Dexteritysaving throw against your spell save DC. A\ncreature takes 4d6 fire damage on a failed save,\nor half as much damage on a successful one. Al\n9th level this damage increases to 6d6, and at\n17th level the damage increases to 8d6.\nYou may otherwise end this effect with no\naction on your turn. If you are no longer holding\nor carrying this weapon, or if you fall uncon-\nscious, this effect ends.\nTurn Adversary. As an action. you presenta\nholy symbol of your contract-holder and speak\nan indictment of the enemies of Hell, using your\nChannel Divinity. Each aberration, celestial, el-\nemental, or non-lawful fiend that can see or hear\nyou within 30 feet of you must make a Wisdom\nsaving throw. If the creature fails ils saving\nthrow, it is turned for 1 minute or until it takes\ndamage.\nA turned creature must spend its turns trying\nto move as far away from you as it can, and it\ncan't willingly move to a space within 30 feet of\nyou. It also can't take reactions. For its action.it\ncan use only the Dash action or try to escape\nfrom an effect that prevents it from moving. If\nthere's nowhere to move the creature can use\nthe Dodge action"},{"featuretext":"FIENDISH SMITE\nAt 3rd level, your Divine Smite no longer deals\nradiant damage, and instead deals your choice of\neither fire or necrotic damage. You may choose\nwhich damage type to use each time you use\nyour Divine Smite feature."}],"7":[{"featuretext":"HELLGATE\nBeginning at 7th level, you can use your connec-\nlion to your contract to pull you and your allies\nthrough Hell itself, reappearing in a more tacti-\ncally advantageous location. As a bonus action.\nyou may teleport any willing, friendly creatures\nwithin a 10 foot radius of you (including your\nsell) to another location within 10 feet of your\noriginal position. Participants may occasionally\nfind this experience disturbing. You require a\nshort rest before you may use this ability again.\nAt 18th level, the distances listed in this ability\nincrease to 30 feet."}],"15":[{"featuretext":"BRIMSTONE BLESSING\nStarting at 15th level, you can channel the power\nof your contract to imbue you with an unnatural\nvitality. As a bonus action on your turn, you can\ngain an amount of temporary hit points equal to\nyour Charisma modifier (minimum 1).\nAdditionally, no matter what you say, magic\nthat would determine if you are telling the truth\nindicates you are being truthful, if you so choose,\nand you can't be compelled to tell the truth by\nmagic."}],"20":[{"featuretext":"INFERNAL INHERITOR\nAt 20th level, your contract nears completion,\nand you can assume the mantle of your contract-\nholder, fully commanding an aspect of their\npower. This immense power partially transforms\nyou, toughens your skin, and causes you to grow\na foot or two taller and sprout horns and claws.\nmaking you perceptibly reminiscent of your\ncontract-holder\nYou may transform using an action on your\nturn. If you do, you gain the following benefits for\n1 minute:\nDarkvision out to 120 feet, or increase any\nexisting Darkvision you have by 120 feet.\n• As a bonus action on your turn, you may make\nan attack with your claws, which are consid-\nered a finesse weapon with which you have\nproficiency. These claws deal 1do plus your\nStrength or Dexterity modifier slashing\ndamage on a hit. You may make this attack\neven if both of your hands are otherwise\noccupied.\n. Whenever you deal damage. you deal an\nadditional 2do fire damage.\n· Damage you deal ignores resistance and\nimmunity\n• You have resistance to bludgeoning, piercing-\nand slashing damage from nonmagical\nweapons that are not silver.\nOnce you use this feature, you can't use it again\nuntil you finish a long resi."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}