{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Oath of Treachery","class":"Paladin","spellcastingability":"charisma","level":{"3":[{"featuretext":"Channel Divinity\n\nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\nConjure Duplicate. As an action, you create a visual illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space of your choice that you can see within 30 feet of you. The illusion looks exactly like you; it is silent; it is your size, is insubstantial, and doesn’t occupy its space; and it is unaffected by attacks and damage. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but the illusion must remain within 120 feet of you.\n\nFor the duration, you can cast spells as though you were in the illusion’s space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how uncanny the illusion is.\n\nPoison Strike. You can use your Channel Divinity to make a weapon deadlier. As a bonus action, you touch one weapon or piece of ammunition and conjure a special poison on it. The poison lasts for 1 minute. The next time you hit a target with an attack using that weapon or ammunition, the target takes poison damage immediately after the attack. The poison damage equals 2d10 + your paladin level, or 20 + your paladin level if you had advantage on the attack roll.\n"}],"7":[{"featuretext":"Aura of Treachery\n\nStarting at 7th level, you emanate an aura of discord, which gives you the following benefits.\n\nCull the Herd. You have advantage on melee attack rolls against any creature that has one or more of its allies within 5 feet of it.\n\nTreacherous Strike. If a creature within 5 feet of you misses you with a melee attack, you can use your reaction to force the attacker to reroll that attack against a creature of your choice that is also within 5 feet of the attacker. The ability fails and is wasted if the attacker is immune to being charmed. You can use this ability three times, and regain expended uses of it when you finish a short or long rest.\n\n"}],"15":[{"featuretext":"Blackguard's Escape\n\nAt 15th level, you have the ability to slip away from your foes. Immediately after you are hit by an attack, you can use your reaction to turn invisible and teleport up to 60 feet to a spot you can see. You remain invisible until the end of your next turn or until you attack, deal damage, or force a creature to make a saving throw. Once you use this feature, you must finish a short or long rest before you can use it again."}],"20":[{"featuretext":"Icon of Deceit\n\nAt 20th level, you gain the ability to emanate feelings of treachery. As an action, you can magically become an avatar of deceit, gaining the following benefits for 1 minute:\n\n• You are invisible.\n\n• If a creature damages you on its turn, it must succeed on a Wisdom saving throw (DC equal to your spell save DC) or you control its next action, provided that you aren’t incapacitated when it takes the action. A creature automatically succeeds on the save if the creature is immune to being charmed.\n\n• If you have advantage on an attack roll, you gain a bonus to its damage roll equal to your paladin level.\n\nOnce you use this feature, you can’t use it again until you finish a long rest.\n\n"}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
