{"backgrounds":[],"races":[{"name":"half orc\/half elf","displayname":"half orc\/half elf","abilityscorebonuses":[{"strength":"1","constitution":"1","intelligence":"1"}],"speed":"30","languages":["Orc","Elvish","Common"]}],"subraces":[],"classes":[{"name":"Soul Binder","hitdie":"6","armorproficiencies":["Light Armor"],"weaponproficiencies":["Simple Weapons"],"toolproficiencies":["One type of musical instrument","One type of artisan's tools"],"equipment":[{"selection":[{"weapon":{"name":"Dagger","quantity":"2"}},{"weapon":{"type":"simple"}},{"weapon":{"type":"martial"}}]},{"selection":["priest pack","scholar's pack"]},{"selection":[{"armor":{"name":"Leather"}},""]}],"saveproficiencies":["constitution","charisma"],"classskills":["animal handling","arcana","history","insight","intimidation","nature","persuasion"],"skillcount":"2","spellprogression":"half","spellcastingability":"charisma","multiclass":{"abilityscoreprerequisites":[{"greaterthanorequal":{"first":"charismascore","second":"14"}}]},"level":{"1":[{"archetypemenu":""}],"2":[{"featuretext":"Edict\n\nYou have gotten better control over your companion and can give it more complicated commands. You can use a bonus action to speak a command to your companion. It must be able to hear you for the command to take effect. \nAt 2nd level, you learn the following commands:\n\nStrike. You command your companion to attack with extra ferocity. The next time your companion hits another creature with an attack this turn, that attack deals extra 2d6 damage.\n\nToughen Up. You command your companion to toughen up and be ready to withstand even more blows. Your companion gains 2d6 temporary hit points that last for 10 minutes.\n\nBlock. You command your companion to evade or block incoming attacks rather than taking them. Until the end of your next turn your companion can add your Charisma modifier to any saving throw it has to make, and add half your Charimsa modifier (rounded up) to its AC.\n\nMove. You tell your companion that it needs to move fast, or move safely. When given this command your companion can take the Disengage or Dash action as a bonus action on this turn.\n\nYou can use this feature a number of times equal to your Charisma modifier (minimum of 1), regaining all uses on a long rest.\n\nThe amount of dice for the \"Strike\" and \"Toughen Up\" edict increase as you gain levels in this class, increasing to 3d6 at 5th level, 4d6 at 11th level and 5d6 at 17th level.\n\n"}],"3":[{"featuretext":"Magic Item Absorption\n\nWhen you reach 3rd level, the soul binder can perform a special ritual to merge a magic item into its companion during a short rest. Merging with an item requires physical contact between the soul binder, the item and the companion.\n\nCertain items have prerequisites. The companion must meet any prerequisite for the item to successfully merge with it. Your companion cannot merge with items requiring a class prerequisite. If the short rest is interrupted, the merging fails. Otherwise, at the end of the short rest, the item merges into the companion.\n\nWhile merged, the companion gains an intuitive understanding of how to activate any magical properties of the item, including any necessary Command words. Your companion can use the magical properties of the item and apply the effects to its natural weapons and natural armor, but doesn't get the benefit of the armor or weapon itself. It can only have one weapon merged at a time, and one piece of armor. The companions natural weapons can only benefit from one of the merged items, and you can change this on a short rest, the same goes for its natural armor. If it absorbs a weapon, its attacks becomes magical.\n\nExample: if you bind a +1 Plate armor to your companion it gains +1 to its AC, but not the benefits of wearing Plate armor. Each merged item within the creature counts as an attunement for the soul binder, regardless if whether the item required attunement. Attempting to merge with more than three items fails automatically. The soul binder can voluntarily end the merge by spending another short rest focused on the item, unless the item is cursed.\n\nIf the companion dies, all the merges items are expelled from its corpse on the ground around it.\n\n"}],"4":[{"abilityscoreimprovement":""}],"5":[{"featuretext":"Advanced Offense\n\nBeginning at 5th level, you and your companion have improved your skill in combat and work even better together. You gain one of the following features of your choice:\n\nCompanion Extra Attack. Your companion can attack twice instead of once, whenever it takes the Attack action on its turn.\n\nExpert Commanding. There is no longer any restrictions for whenever you or your companion can take the Attack action or cast a spell with a casting time of 1 action as long as it is a soul binder spell.\n\nAt 11th level you get the other feature that you didn't pick at 5th level.\n\nSoul Linked Casting\n\nYou and your companion are of the same soul, and you can channel magic through your link.\n\nAt 5th level, when you cast a spell targeting yourself, you can choose to also have the spell affect your companion if the companion is within 60 feet of you. If you lose concentration on the spell, you both lose the effect, and you must make concentration checks also if your companion takes damage, as if you took that amount of damage.\n\n"}],"6":[{"featuretext":"Soul Infused Attacks\n\nStarting at 6th level, your companions attacks count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\nCompanion's Protection\n\nWhen you reach 6th level your companion's defense is better than ever, avoiding everything from traps to spells. It gains proficiency in all saving throws. Additionally, it has advantage on Intelligence and Charisma saving throws when you are within 100 feet of it and it can see you.\n\n"}],"7":[{"featuretext":"Project Senses\n\nBeginning at 7th level you can project your mind into your companion. As an action, you can see through your companion’s eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses that the companion has. During this time, you are deaf and blind with regard to your own senses. While you are seeing with your companion's eyes you can also choose to speak though it with your own voice being projected from its mouth.\n\n"}],"8":[{"abilityscoreimprovement":""}],"9":[{"featuretext":"Resting Voice\n\nBeginning at 9th level you now regain all uses of your edicts on a short or long rest.\n\n"}],"10":[{"featuretext":"Countermeasure\n\nAt 10th level, your companion is very protective of you and will harm anyone who seeks to hurt you. When you are targeted by an attack, your companion can take one of the following reactions:\n\nRevenge. The companion can use its reaction to make one attack against the enemy if it is within range.\n\nRoar. It uses its reaction to let out a frightful roar to impose disadvantage on the attack roll as long as the attacker is within 30 feet of it and is not deafened.\n\nBody Shield. If your companion is within 5 feet of you when the attack is made, it can use its reaction to redirect the attack to target the companion instead.\n\n"}],"12":[{"abilityscoreimprovement":""}],"14":[{"featuretext":"Soul Purification\n\nWhen you reach 14th level you can use your soul energy to flush out any negative effects currently impeding your companion.\n\nIf your companion is affected by a magical effect that allows it to make a saving throw at the start or end of its turns, or as an action, you can use your action to allow your companion to immediately attempt to make the saving throw even if it has already done so on said turn.\n\n"}],"16":[{"abilityscoreimprovement":""}],"18":[{"featuretext":"Resonating Voice\n\nAt 18th level you use your magic to command your companion with a voice that resonates with your shared soul bond.\n\nWhen you use an edict you can select another edict you know and have that affect your companion as well.\n\n"}],"20":[{"abilityscoreimprovement":""}]}}],"archetypes":[{"name":"Oath of the Unconquered","class":"Paladin","previewtext":"Unbreakable and Dominating","spellprogression":"half","spellcastingability":"charisma","level":{"3":[{"featuretext":"CHANNEL DIVINITY \nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options. Adamantine Bulwark. Anytime you take damage from an attack or spell, you can use your reaction and your channel divinity to reduce all damage you take by an amount equal to three times your paladin level Unstoppable Charge. You can spend an action to use your channel divinity to move up to your speed in a straight line. You can move through enemy creatures, and the first enemy creature of up to one size larger than you or smaller that you come in contact with must succeed on a strength saving throw or take bludgeoning damage equal to 2d8 + your paladin level, and be forcefully moved along with you until you finish your movement. Each other creature whose space you, or the creature you are pushing, pass through during this action must succeed on a dexterity saving throw or be knocked prone. "}],"5":[{"addspell":{"name":"Warding bond, Enlarge\/Reduce","spelllevel":"2"}}],"7":[{"featuretext":"AURA OF IRON\nBeginning at 7th level, you emanate so many protective magics that it is almost palpable. You and friendly creatures within 10 feet of you reduce all damage taken by an amount equal to your Charisma modifier (minimum 1). You reduce damage this way before resistances have been calculated. At 18th level, the range of this aura increases to 30 feet. "}],"9":[{"addspell":{"name":"Beacon of Hope, Wind Wall","spelllevel":"3"}}],"13":[{"addspell":{"name":"Resilient Sphere, Freedom of Movement","spelllevel":"4"}}],"15":[{"featuretext":"LIVING FORTRESS\nAt 15th level, you have come to embody many qualities of an actual fortress. You can no longer be forcefully moved by spell effects, or by abilites used by creatures that are one size larger than you or smaller. Additionally, allies who are within 5 feet of you, and are of your size or smaller, gain the benefits of half cover."}],"17":[{"addspell":{"name":"Passwall, Stonewall","spelllevel":"5"}}],"20":[{"featuretext":"UNBREAKABLE DEFENDER\nAt 20th level, you can use an action to create an additional, secondary layer of armor made of solidified radiant energy that appears over your form. For one minute you gain the following benefits: \n• If an attack or spell that deals damage would damage you for 15 hit points or less, you ignore it. • Anytime a hostile creature makes a ranged attack against an allied creature within your Aura of Iron, you can roll a d6. On a 4 or higher, you become the target of the attack instead. • Allied creatures within 30ft of you always gain the benefits of half cover. \nOnce you use this feature, you can't use it again until you finish a long rest. "}]}},{"name":"Monster Slayer","displayname":"Monster Slayer","class":"Fighter","level":{"3":[{"featuretext":"Combat Superiority\n\nWhen you choose this archetype at 3rd level, you gain a set of abilities that are fueled by special dice called superiority dice.\n\nSuperiority Dice. You have four superiority dice, which are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\n\nYou gain another superiority die at 7th level and one more at 15th level.\n\nUsing Superiority Dice. You can expend superiority dice to gain a number of different benefits:\n\n• Precision Attack. When you make a weapon attack against a creature, you can expend one superiority die to add it to the attack roll. You can use this ability before or after making the attack roll, but before any of the effects of the attack are applied.\n\n• Sharpened Attack. When you damage a creature with a weapon attack, you can expend one superiority die to add it to the damage roll. You can use this ability after rolling damage. If the attack causes the target to make a Constitution saving throw to maintain concentration, it has disadvantage on that save.\n\n• Sharpened Senses. When you make a Wisdom (Perception) check to detect a hidden creature or object, or a Wisdom (Insight) check to determine if someone is lying to you, you can expend one superiority die to add it to the roll. You can use this feature after seeing the total but before learning if you succeeded or failed.\n\n• Superior Willpower. When you make an Intelligence, a Wisdom, or a Charisma saving throw, you can expend one superiority die to add it to the roll. You can use this feature only before you learn if the save succeeded or failed.\n\n"},{"featuretext":"Bonus Proficiencies\n\nWhen you choose this archetype at 3rd level, you gain proficiency in two of the following skills of your choice: Arcana, History, Insight, Investigation, Nature, or Perception. You can gain proficiency with a tool of your choice in place of one skill choice."},{"featuretext":"Hunter's Mysticism\n\nAt 3rd level, your study of the supernatural gives you a limited ability to use magic. You can cast Detect Magic as a ritual. You can cast Protection from Evil and Good, but you cannot cast it again with this feature until you finish a long rest. Wisdom is your spellcasting ability for these spells.\n\nIn addition, you gain the ability to speak one of the following languages of your choice: Abyssal, Celestial, or Infernal.\n\n"}],"7":[{"featuretext":"Monster Slayer\n\nAt 7th level, whenever you expend superiority dice to add to a damage roll, you can expend up to two dice instead of just one, adding both to the roll. Both dice are expended as normal. If the target of your attack is an aberration, a fey, a fiend, or an undead, you deal maximum damage with both dice, instead of rolling them."}],"10":[{"featuretext":"Improved Combat Superiority\n\nAt 10th level, your superiority dice turn into d10s. At 18th level, they turn into d12s."}],"15":[{"featuretext":"Relentless\n\nStarting at 15th level, when you roll initiative and have no superiority dice remaining, you regain one superiority die."}]}},{"name":"Vampiric Bloodline","displayname":"Vampiric Bloodline","class":"Sorcerer","previewtext":"Your innate magic stems from the mingling of your bloodline with the blood of a vampire. Some sorcerers with this origin can trace their powers back to an ancient bargain with a powerful vampire. When a vampire takes particular interest in a mortal being, they may allow that humanoid to have a taste of their blood. This ritual is seldom practiced, and few vampires would ever even dare to try it. But this is not the only way to gain this origin, as many of these sorcerers can trace their powers to a near-death experience with a vampire. Whatever the case, vampiric magic permeates your blood, and your very being. Vampiric sorcerers most often try to hide their ancestry, since their origins can make them as reviled as the vampires that spawned them. However, a select few embrace their vampiric ancestry, and may even seek to become true vampires in death.","spellprogression":"full","spellcastingability":"charisma","level":{"1":[{"featuretext":"Denizen of the Night\n\nStarting when you choose this origin at 1st level, you gain darkvision out to a range of 30 feet, as described in chapter 8 of the PHB."},{"featuretext":"Martial Prowess\n\nAlso at 1st level, your vampiric ancestry grants you increased effectiveness in melee combat. Your unarmed strikes use a d6 as their damage die, and use your Charisma instead of Strength for their attack and damage rolls. Additionally, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class."}],"6":[{"featuretext":"Vampiric Regeneration\n\nAt 6th level, you gain a semblance of the regenerative abilities of a vampire. At the start of each of your turns, you gain a number of temporary hit points equal to half your Sorcerer level. The amount of temporary hit points gained is halved when you are in sunlight or running water."},{"featuretext":"Extra Attack\n\nStarting at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. Additionally, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage, and use a d8 as their damage die."}],"14":[{"featuretext":"Shapechanger\n\nStarting at 14th level, you can use your action to polymorph into a Tiny bat or back into your true form. While in bat form, you can't speak, attack, or cast spells, your walking speed is 5 feet, and you have a flying speed of 30 feet. Your statistics, other than your size and speed, are unchanged. Anything you are wearing or carrying transforms with you."}],"18":[{"featuretext":"Misty Escape\n\nAt 18th level, you gain the ability to escape from death as a cloud of mist. When you would be reduced to 0 hit points, you can use your reaction and spend 5 sorcery points to instead be reduced to 1 hit point and immediately cast gaseous form on yourself without expending a spell slot or material components."}]}},{"name":"Nightstalker","class":"Revised Ranger"},{"name":"Arcane Thrower","displayname":"Arcane Thrower","class":"Fighter","level":{"3":[{"featuretext":"Returning Weapon\n\nWhen you take choose this archetype at 3rd level you may take one hour to carve runes into any melee weapon of your choice with which you are proficient in order to bond it to you. You may summon this weapon back to your hand instantaneously, even between attacks, causing the weapon to dissolve wherever it is and reform in your hand. Additionally, you may throw this weapon using it's normal damage die at a range of 30\/60 if it does not have the thrown property. You may only ever have one returning weapon as it is bound to your soul, and if it is destroyed then you take 5d10 psychic damage. You may bond with a new weapon whenever you want, but doing so takes an extra hour of time to remove the runes from your previous weapon. You don't need to spend extra time if your weapon was destroyed."}],"7":[{"featuretext":"Arcane Impact\n\nThrough your battles with your returning weapon you have learned how to make it more effective by using it as a conduit for pure Arcane energy. At 7th level when you make a ranged attack with your returning weapon you may choose to make it explode with magical energy on impact, dealing an its normal damage as force and extra damage equal to 1d6 + the distance thrown divided by 10 force damage (round up) to the target and creatures within a 5 foot radius. This doesn't destroy the weapon, but you must retrieve it by reforming it in your hand. You can add this damage to melee attacks, but if you do so then you will take the sum total of the damage dealt since the weapon explodes in your hand."}],"10":[{"featuretext":"Arcane Seeking\n\nStarting at 10th level the runes on your returning weapon allow it to seek out cowards who hide from your mighty chucks. Your returning weapon now negates the armor class bonus granted by any level of cover or shields but only when making ranged attacks."}],"15":[{"featuretext":"Extended Range\n\nBeginning at 15th level the runes on your returning weapon allow it to sail through the air further and faster, making it's range 40\/80 and increasing Arcane Impact's extra damage to 1d10 + distance thrown divided by 5 (round up)."}],"18":[{"featuretext":"Ranged Dominance\n\nAt level 18 your throwing ability is without equal, and you want other, lesser, ranged combatants to know. Whenever a ranged attack is made that you can see, you may use your reaction to throw your returning weapon at it, reducing its damage by however much damage you roll or destroying it completely. Additionally, you gain advantage on attack rolls on the creature who made the ranged attack until the end of your next turn"}]}},{"name":"Soul Knife","displayname":"Soul Knife","class":"Monk","previewtext":"Monks of the Way of the Soul Knife are deadly assassins and bounty hunters. They use their psionic talents to manifest psychic blades that tear through their enemies’ bodies and auras. Their talents extend beyond combat, as their ability to perceive auras allows them to track down foes and see through their deceptions.","level":{"3":[{"featuretext":"Soul Knives\n\nStarting when you choose this tradition at 3rd level, you can use your psionic energy to manifest blades that disrupt your foes’ minds.\n\nYour unarmed strikes deal your choice of psychic, piercing, slashing, or bludgeoning damage each time you hit.\n\nIn addition, you can use a bonus action to increase the reach of your unarmed strikes by 30 feet until the end of your turn."},{"featuretext":"Psychic Slash\n\nAt 3rd level, when you channel ki into your attacks you augment your soul knives to inflict devastating psionic blows.\n\nWhenever you hit a creature with one of the attacks granted by your Flurry of Blows and that attack inflicts psychic damage, you can impose one of the following effects on the target:\n\nLife Drain. You gain temporary hit points equal to half the damage your attack deals.\n\nInvoke Terror. The target must succeed on a Wisdom saving throw or become frightened of you until the end of your next turn.\n\nInvoke Wrath. The target suffers disadvantage on all attack rolls against targets other than you until the end of your next turn.\n\nAstral Slide. You teleport the target up to 10 feet to a destination you can see.\n\nSynaptic Overload. The target gains vulnerability to psychic damage until the end of your next turn.\n\n"}],"6":[{"featuretext":"Aura Sight\n\nAt 6th level, you gain the ability to perceive the auras of other creatures.\n\nAs an action, select a creature that you can see. That creature makes a Wisdom saving throw, though it has no knowledge that you forced it to attempt this saving throw. On a failed save, you learn if the creature shares any aspects of its alignment with you, its current hit points, and its current attitude and intentions toward you or one other creature, object, or location of your choice. In addition, for the next 24 hours or until you use this ability again, you can use an action to determine the creature’s distance and direction from you.\n\nIf a creature succeeds on its saving throw against this ability, you cannot use this ability against that creature again until you complete a long rest.\n\n"}],"11":[{"featuretext":"\nSpectral Blades\n\nAt 11th level, you can cause your blades to phase through physical objects and defenses.\n\nOnce during your turn, you can choose to forego one unarmed strike in place of forcing a creature within the reach of that attack to make a Dexterity saving throw against your ki save DC. On a failed saving throw, the creature takes psychic damage equal to that of your unarmed strike, or half that damage if it succeeds.\n\n"}],"17":[{"featuretext":"Psychic Form\n\nAt 17th level, you can transform your physical body into the same psychic energy that comprises your soul knives. As a bonus action, you assume a psychic form, which grants the following benefits:\n\n• You have resistance to all damage.\n• You have a fly speed of 30 feet.\n• You can move through other creatures and objects as if they were difficult terrain. You take 5 force damage if you end your turn inside an object.\n\nThis benefit lasts for 1 minute. You cannot use it again until you complete a long rest.\n\n"}]}},{"name":"Oath of Treachery","class":"Paladin","spellcastingability":"charisma","level":{"3":[{"featuretext":"Channel Divinity\n\nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\nConjure Duplicate. As an action, you create a visual illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space of your choice that you can see within 30 feet of you. The illusion looks exactly like you; it is silent; it is your size, is insubstantial, and doesn’t occupy its space; and it is unaffected by attacks and damage. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but the illusion must remain within 120 feet of you.\n\nFor the duration, you can cast spells as though you were in the illusion’s space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how uncanny the illusion is.\n\nPoison Strike. You can use your Channel Divinity to make a weapon deadlier. As a bonus action, you touch one weapon or piece of ammunition and conjure a special poison on it. The poison lasts for 1 minute. The next time you hit a target with an attack using that weapon or ammunition, the target takes poison damage immediately after the attack. The poison damage equals 2d10 + your paladin level, or 20 + your paladin level if you had advantage on the attack roll.\n"}],"7":[{"featuretext":"Aura of Treachery\n\nStarting at 7th level, you emanate an aura of discord, which gives you the following benefits.\n\nCull the Herd. You have advantage on melee attack rolls against any creature that has one or more of its allies within 5 feet of it.\n\nTreacherous Strike. If a creature within 5 feet of you misses you with a melee attack, you can use your reaction to force the attacker to reroll that attack against a creature of your choice that is also within 5 feet of the attacker. The ability fails and is wasted if the attacker is immune to being charmed. You can use this ability three times, and regain expended uses of it when you finish a short or long rest.\n\n"}],"15":[{"featuretext":"Blackguard's Escape\n\nAt 15th level, you have the ability to slip away from your foes. Immediately after you are hit by an attack, you can use your reaction to turn invisible and teleport up to 60 feet to a spot you can see. You remain invisible until the end of your next turn or until you attack, deal damage, or force a creature to make a saving throw. Once you use this feature, you must finish a short or long rest before you can use it again."}],"20":[{"featuretext":"Icon of Deceit\n\nAt 20th level, you gain the ability to emanate feelings of treachery. As an action, you can magically become an avatar of deceit, gaining the following benefits for 1 minute:\n\n• You are invisible.\n\n• If a creature damages you on its turn, it must succeed on a Wisdom saving throw (DC equal to your spell save DC) or you control its next action, provided that you aren’t incapacitated when it takes the action. A creature automatically succeeds on the save if the creature is immune to being charmed.\n\n• If you have advantage on an attack roll, you gain a bonus to its damage roll equal to your paladin level.\n\nOnce you use this feature, you can’t use it again until you finish a long rest.\n\n"}]}},{"name":"Shadow","class":"Rogue","level":{"3":[{"featuretext":"Bonus Cantrips\n\n\r\nWhen you choose this archetype at 3rd level, you gain the \r\numbraturgy † cantrip and the dueling shadows † cantrip. \r\nCharisma is your spellcasting ability for these spells."},{"featuretext":"Severed Shadow\n\nStarting at 3rd level, you can separate your shadow from your \r\nbody, creating a shadowy replica of yourself and causing you to \r\nno longer cast a shadow. This replica is completely opaque and \r\nsolid, and looks like a three-dimensional silhouette of yourself. \r\n As an action, you may separate your shadow and then move it \r\nup to 30 feet as part of the same action. The shadow shares your \r\nstatistics, and can perform all movements that you would be able \r\nto, making ability checks for any movements that would normally \r\nrequire them, but it cannot take any actions. The shadow is \r\nsusceptible to saving throws and attacks, including opportunity \r\nattacks, and it shares your AC. If it takes any damage, it instantly disappears. Your separated shadow can count as an enemy of a \r\nhostile creature for the purpose of granting sneak attack.\r\n On subsequent turns while you are separated from your shadow \r\nby less than 120 feet, you may move it another 30 feet (no action \r\nrequired). As a bonus action on your turn, you may choose to \r\nteleport to the location of your shadow, reuniting yourself with it. \r\nYou can also reunite with your shadow by moving into its space.\r\n Once you teleport to your shadow, you can’t teleport to it again \r\nuntil you complete a short or long rest."}],"9":[{"featuretext":"Deceiving Darkness\n\nStarting at 9th level, you have advantage on Dexterity (Stealth) \r\nchecks if you are in dim light or darkness."}],"13":[{"featuretext":"Shadow Simulacrum\n\nAt 13th level, you gain greater control over your shadow. When \r\nyour shadow is separated from you, you can use your bonus \r\naction to have it perform the Help action, and your shadow can \r\nalso manipulate objects weighing up to 25 pounds."}],"17":[{"featuretext":"Master of Shadows\n\nWhen you reach 17th level, you have gained ultimate control over \r\nyour shadow. When you sever your shadow, you can control its \r\nmovement as long as it is within 500 feet, and you may use your \r\nbonus action to switch from using its senses to using your own, or \r\nback again. Additionally, you no longer have to complete a short \r\nor long rest before teleporting to it again."}]}},{"name":"Way of the Astral Self","class":"Monk","level":{"3":[{"featuretext":"Arms of the Astral Self\n\nAt 3rd level, your mastery of your ki allows you \r\nto summon a portion of your astral self. On your \r\nturn, you can spend 2 ki points as a bonus action \r\nto summon the arms of your astral self for 10 \r\nminutes. These spectral arms hover near your \r\nshoulders. You determine the arms’ appearance \r\nbased on the qualities of your character. \r\nWhile your astral arms are summoned, you \r\ngain the following benefits: \r\n• You can use your Wisdom modifier in place of \r\nyour Strength modifier when making Strength \r\nchecks and Strength saving throws. \r\n• The arms are monk weapons and have a reach \r\nof 10 feet. The arms deal radiant or necrotic \r\ndamage (your choice). When you attack with \r\nthe arms, you can use your Wisdom modifier \r\ninstead of your Strength or Dexterity modifier \r\nfor the attack and damage rolls. \r\n• Immediately after you use the Attack action \r\nwith your astral arms on your turn, you can \r\nmake one extra attack with your astral arms as \r\na bonus action. The number of extra attacks \r\nincreases when you reach certain levels in this \r\nclass, increasing to two at 11th level and three \r\nat 17th level."}],"6":[{"featuretext":"Visage of the Astral Self"}],"11":[{"featuretext":"Awakening of the Astral Self\n\nStarting at 11th level, you tap into the greater \r\npower of your astral self. While you have both \r\nyour astral arms and visage summoned, you gain \r\nthe following benefits. \r\nDeflect Energy. When you take acid, cold, fire, \r\nlightning, or force damage, you can use your \r\nreaction to deflect it. When you do so, the \r\ndamage you take is reduced by 1d10 + your \r\nWisdom modifier + your monk level. \r\nEmpowered Arms. Once on each of your turns \r\nwhen you hit a target with your astral arms, you \r\ncan deal extra damage to the target equal to your \r\nMartial Arts die. \r\nWord of the Spirit. When you speak through \r\nyour visage, you can direct your words to a \r\ncreature of your choice that you can see within \r\n30 feet of you, making it so only that creature \r\ncan hear you. Alternatively, you can amplify your \r\nvoice so that all creatures within 600 feet can \r\nhear you."}],"17":[{"featuretext":"Complete Astral Self\n\r\nStarting at 17th level, your connection to your \r\nastral self is complete, allowing you summon it \r\nentirely. On your turn, you can spend 10 ki \r\npoints as a bonus action to summon the arms, \r\nvisage, and body of your astral self for 10 \r\nminutes. This spectral body covers your physical \r\nform like a suit of armor, connecting with the \r\narms and visage. You determine its appearance \r\nbased on the qualities of your character. \r\nWhile your astral self is summoned, you gain \r\nthe following benefits\nArmor of the Spirit. You gain a +2 bonus to AC \r\nwhile you aren’t incapacitated. \r\nAstral Barrage. Whenever you use the Extra \r\nAttack feature to attack twice, you can instead \r\nattack three times using your astral arms. \r\nKi Consumption. When a creature within 10 \r\nfeet of you is reduced to 0 hit points, you can use \r\nyour reaction to regain ki points equal to your \r\nWisdom modifier (minimum 1)."}]}},{"name":"Path of the Sin Scarred","class":"Barbarian","previewtext":"One unfortunate night, one terrible event now defines a dark\r\npart of your soul. Unable to forgive or forget has lead to anger\r\ntaking on the form of vengeance and burning forth to destroy\r\nall who make the mistake of getting in the way of those who\r\nhave been scared.","level":{"3":[{"featuretext":"Scarred Visage\r\nAt 3rd level when you take this path you have been afflicted\r\nwith a curse either by a close encounter with a magical\r\ncreature or a heinous act you have performed. When you rage\r\nthe wounds from this event open up with your fury giving you\r\nadvantage on intimidation checks.\r\nSin save DC = 8 + proficiancy + con"},{"featuretext":"Natural Weapon\r\nAdditionally, at 3rd level, your body has begun to warp for the\r\ncurse inflicted upon you. While raging you grow a natural\r\nweapon from your body that you gain proficiency with. Chose\r\na natural weapon from below. These natural weapons all\r\nhave the finesse property.\r\nClaws: 1d8 slashing damage. On a successful attack, the\r\ncreature hit must make a Constitution saving throw\r\nagainst your sin save or take an additional 1d6 damage on\r\nthe end of its turn till it either is healed through magic or a\r\nDC10 medicine check.\r\nHorns: 1d8 piercing damage. If you move 10ft then use\r\nyour horns to attack you do 1D8 bludgeoning damage and\r\nthe creature hit must make a natural weapon saving throw\r\nor be pushed 10ft and knocked prone\r\nTail: 1d4 bludgeoning damage. You can attack with this as\r\na bonus action. Additionally, you can attack any creature\r\nthat moves within 5ft or you as a reaction.\r\nFangs: 1d8 pricing damage. On a successful hit, you gain\r\nback hit points equal to half the damage inflicted by this\r\nattack."}],"6":[{"featuretext":"Elemental Atonement\r\nAt 6th level, the magical essence of your curse can no longer\r\nbe contained within you, spilling out with your rage warping\r\nyou even further. Chose an element from the list below, when\r\nyou are raging and attack using your natural weapon you deal\r\nan additional 1d6 of that damage type. This damage\r\nincreases to 2d6 when you are at 12th level and 3d6 at 16th\r\nlevel. Additionally Natural weapons count as magical for\r\novercoming resistance to non-magical weapons.\r\nFire: Your skin becomes black like charcoal and you\r\nbellow out smoke from your mouth and nostrils.\r\nCold: You become pale as snow, your eyes become a deep\r\nblue and you cool the air around you.\r\nLightning: Your veins glow an eerie purple\/blue and you\r\nemit a faint light for 10ft.\r\nForce: Wind rushes around you and your facial feature\r\nsharped to an unnatural degree.\r\nNecrotic: Your visage becomes shrouded in a black mist\r\nand your bones are highly visible beneath your skin.\r\nRadiant: You are shrouded in a bright aura, Your eyes\r\nbecome pure white, and you emit bright light for 10ft"}],"10":[{"featuretext":"Greater Mutations\r\nAt 10th level, your curse has progressed giving you access to\r\nmore advanced mutations. Choose one mutation from the list\r\nbelow, when you rage you gain the benefits of the option\r\nchosen.\r\nWings: A pair of wings sprout from your body grating you\r\na flight speed equal to your movement speed.\r\nExtended limbs: Your arms become unnaturally long\r\ngiving weapon attacks and the claw natural weapon the\r\nreach property.\r\nNatural armour: Your body natural resilience increases\r\ngranting you +2 to your armour class.\r\nEnthralling venom: When you successfully hit a creature\r\nwith one of your natural weapons you can force it to make\r\na charisma saving throw against your Sin save DC or\r\nbecome charmed by you till the beginning of your next\r\nturn. You can do this as many times as your Constitution\r\nmodifier per long rest.\r\nBanshees shrike: You let out a bloodcurdling shrike\r\ncausing every hostile creature within 30ft of you to make a\r\nconstitution saving throw against your Sin save DC or\r\ntake 2d10 plus your constitution modifier and become\r\ndefend or take half the damage and not be defend on a\r\nsuccessful save. You can do this once per short or long\r\nrest."}],"14":[{"featuretext":"Acceptance\r\nAt 14th level, your curse has fully integrated with your body\r\nand you have become a true monster. You can choose and\r\nadditional natural weapon and your natural weapons deal\r\ndamage equal to one die higher eg. 1d8 to 1d10. Additionally,\r\nwhile raging you gain an additional ability according to what\r\nelement you had chosen for the Elemental Attonment feature.\r\nFire: Dangerous flames jet out from your body, whenever\r\na hostile creature ends its turn within 10ft must make a\r\nDexterity saving throw against your Sin save DC or take\r\n3d6 fire damage\r\nCold: The air practically freezes in your presence. Any\r\ncreature that ends its turn within 10ft of you must make a\r\nConstitution saving throw against your Sin save DC or\r\ngain one level of exhaustion. if a creature passes this save\r\nbecomes immune to this effect for 1 minute.\r\nLighting: You become like lightning itself and gain an\r\nextra 10ft of movement speed. Additionally, when you\r\nmove more than 15ft towards a creature as an action, you\r\ncan force that creature to make a dexterity saving throw\r\nagainst your Sin save DC or take 2d8 lightning damage\r\nand be knocked prone or take half damage and not be\r\nknocked prone on a successful save. You can do this as\r\nmany times as your Constitution modifier per long rest.\r\nForce: A strong wind whips around you causing ranged\r\nweapon attacks to have disadvantage against you and any\r\ncreature that ends its turn within 10ft of you must make a\r\nStrength saving throw against your Sin save DC or be\r\npushed back by 10ft.\r\nNecrotic: You become a force of entropy. When you\r\nreduce a medium or smaller humanoid or beasts hit\r\npoints to 0 you can make that creature make a\r\nconstitution saving throw against your Sin save DC or be\r\nresurrected with 1 hit point. The resurrected creature\r\nuses the statistics of a zombie and takes its turn\r\nimmediately after yours in combat. The creature obeys\r\nyour mental commands and can only take the attack\r\naction in combat and can only make 1 attack per round.\r\nThe creature remains animated for 1 hour before\r\ncrumbling to dust.\r\nRadiant: You body radiates divine light. As an action, you\r\ncan teleport to an unoccupied space within 30ft of you and\r\nany hostile creature within 10ft of the space you\r\nteleported to must make a Constitution saving throw\r\nagainst your Sin save DC or take 4d6 radiant damage and\r\nbe blinded till the start of your next turn or take half ad not\r\nbe blinded on a successful save."}]}},{"name":"Giant Soul","class":"Sorcerer","spellcastingability":"charisma","level":{"1":[{"featuretext":"Jotun Resilience\n\nThe resilience of giants flows through your body. At 1st level, your hit point maximum increases by 1, and it increases by 1 again whenever you gain a level in this class.\n\n"},{"featuretext":"Mark of the Ordning\n\nAt 1st level, you discover innate magical abilities within yourself that are based on your giant heritage. Select one of the giant types from the Mark of the Ordning table. At 1st and 3rd level, you learn the spells associated with your choice, as shown in the table. These spells count as sorcerer spells for you, but they don’t count against your number of sorcerer spells known.\n\n"}],"6":[{"featuretext":"Soul of Lost Ostoria\n\nStarting at 6th level, you gain a benefit whenever you cast one of the spells granted by your Mark of the Ordning Feature.\n\nCloud Giant. Immediately after you cast any of your Mark of the Ordning spells, you can magically teleport as a bonus action. You teleport to an unoccupied space you can see that is no farther away than a number of feet equal to 10 + your Constitution modifier.\n\nFire Giant. You gain a bonus to the damage rolls of your Mark of the Ordning spells. The bonus equals your Constitution modifier (minimum of +1).\n\nFrost Giant. Immediately after you cast any of your Mark of the Ordning spells, you gain temporary hit points equal to your Constitution modifier (minimum of 1). If the spell is Armor of Agathys, you instead increase its temporary hit points by an amount equal to your Constitution modifier (minimum of 1).\n\nHill Giant. Immediately after you cast any of your Mark of the Ordning spells, you can target up to two creatures within 5 feet of you that you can see. Each target must succeed on a Strength saving throw against your spell save DC or be pushed a number of feet away from you equal to 5 + your Constitution modifier (minimum of +1). A target can choose to fail this save.\n\nStone Giant. Immediately after you cast any of your Mark of the Ordning spells, you gain a bonus to AC equal to your Constitution modifier (minimum of +1) until the end of your next turn.\n\nStorm Giant. Immediately after you cast any of your Mark of the Ordning spells, up to three creatures of your choice that you can see within 30 feet of you take lightning damage equal to your Constitution modifier (minimum of 1).\n\n"}],"14":[{"featuretext":"Rage of Fallen Ostoria\n\nStarting at 14th level, you gain the ability to channel the souls of your ancestors into your physical form. When you start casting a sorcerer spell on your turn and expend a spell slot, you can increase your size by one category – from Medium to Large, for example. This increase lasts for 1 minute. It ends early if you die or are incapacitated. Until it ends, you gain the following benefits:\n\n• Your current hit points and your hit point maximum both increase by 1 per sorcerer level.\n• Your reach increases by 5 feet.\n• Your walking speed increases by 5 feet.\n• You have advantage on Strength checks and Strength saving throws.\n• You gain a bonus to the damage rolls of your melee weapon attacks; the bonus equals your Constitution modifier (minimum of +1).\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest.\n\n"}],"18":[{"featuretext":"Blessing of the All Father\n\nAt 18th level, your Constitution score increases by 2, up to a maximum of 22.\n\nIn addition, you can now use Rage of Fallen Ostoria twice between rests, but no more than once on a turn. If you use that feature while under its effects, its increases to your size, hit points, reach, and walking speed are cumulative.\n\n"}]}},{"name":"Bond of the Wild","class":"Soul Binder","level":{"1":[{"featuretext":"Bond of the Wild\n\nYou are in touch with nature itself and have offered something of yourself to it. In return, you are given a trusty animal companion that protects you and carries out your orders. Your bond with the beast makes you inseparable.\n\nBeast Companion\n\nMedium beast, unaligned\n\nArmor Class 11 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d8 (or 5) + its Constitution modifier per soul binder level\n\nHit Die 1d8 per soul binder level\n\nSpeed 30 ft.\n\nSTR,DEX,CON,INT,WIS,CHA( - )( - )( - )3 (-4)12 (+1)10 (+0)\n\nLanguages Understands the languages of its binder, but can't speak\n\nActions\n\nClaws. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft.,\none target. Hit: 1d8 + its Strength modifier bludgeoning, piercing or slashing damage.\n\nWarrior of the Wild\n\nWhen you choose this bond at 1st level, you gain proficiency with martial weapons and medium armor. Additionally your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.\n\nBeast Companion\n\nAlso at 1st level, you gain the company of a loyal beast. It has the appearance of your choice, uses the Beast Companion stat block and gains one of the following features of your choice:\n\nKeen Hearing and Smell. The beast has advantage on Wisdom (Perception) checks that rely on hearing or smell.\n\nSneaky. The beast has expertise in Dexterity (Stealth) checks.\n\nNocturnal. The beast gains darkvision out to a range of\n60 feet.\n\nAmphibious. The beast can breathe air and water. It also gains a swimming speed equal to its walking speed.\n\nLeaper. The beast's long jump is up to 20 feet and its high jump is up to 10 feet, with or without a running start.\n\nSpider Climb. The beast can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.\n\nBig Boned. The beast's size is Large.\n\nYou may pick one additional trait at 7th and 11th level.\n\nYou also get to allocate the following stats for your beast:\n16, 14 and 12. You can place them in the beast's Strength, Dexterity and Constitution scores.\n\nYou can communicate basic ideas to your beast with a few hand signs and nods.\n\n"}],"3":[{"featuretext":"Run With the Pack\n\nWhen you reach 3rd level, you and your beast know each other's every move and you perform best in combat when you are together. When you and your beast are within 10 feet of each other and neither of you are incapacitated, you gain the following benefits:\n\nWhen your beast hits a creature with an attack, you can use your reaction to make one weapon attack against the same creature.\n\nIf one of you is prone, it only takes 5 feet of movement to stand up again.\n\n"}],"7":[{"featuretext":"Bestial Evolution\n\nAt 7th level, your beast is infused with magic via your bond and can evolve itself in different ways. You can pick one of the following features to grant to your beast:\n\nFast Flier. Your beast gains a flying speed equal to double its walking speed. It also gains Flyby, meaning it doesn't provoke opportunity attacks when it flies out of an enemy's reach.\n\nCharger. Your beast gains an extra 15 feet walking speed. Additionally, if the beast moves at least 20 feet straight toward a target and then hits it with an attack on the same turn, the attack deals an extra 2d10 damage to the target. If the target is a creature, it must succeed on a Strength saving throw or be knocked prone.\n\nRelentless Rampager. When the beast is reduced to 0 hit points but not killed outright, it can drop to 1 hit point instead. It can't use this feature again until you finish a long rest. Additionally when the beast reduces a creature to 0 hit points with a melee attack, the beast can use its reaction to move up to half of its speed and make one attack. If it hits with that attack, it gains half of the damage dealt as temporary hit points.\n\n"}],"11":[{"featuretext":"Nature's Commands\n\nAt 11th level, you can command your beast with the guidance of nature itself. The following commands are added to your Edict options:\n\nTooth and Nail. Your beast can use its action to make a melee attack against each creature of its choice within 5 feet of it, with a separate attack roll for each target.\n\nDodge and Evade. Until the end of your next turn, whenever your beast is hit by an attack that it can see, it can use its reaction to reduce the incoming attack's damage by half.\n\n"}],"15":[{"featuretext":"Ultimate Evolution\n\nWhen you reach 15th level, your beast has surpassed any limits you could imagine. Your essence is infused within its body, pushing it to the peak of its evolution.\n\nIt gains two additional traits from your Beast Companion feature and one additional option from your Bestial Evolution feature.\n\n"}]}},{"name":"Bond of the Elements","class":"Soul Binder","level":{"1":[{"featuretext":"Bond of the Elements\n\nYou are in balance with the world, and the elements that surround you. You are so closely bonded with them that you can manifest an elemental avatar, using part of your soul to anchor it to this plane of existence.\n\nAid of the Elements\n\nWhen you choose this bond at 1st level, the elements themselves have granted you the aid of an elemental avatar, that takes on a different shape depending on which element you are attuned to. The avatar has the appearance of your choice and uses the Elemental Avatar stat block.\n\nWhen you gain this feature you may pick one of the following elemental types to attune to: fire, cold, lightning or thunder. On your turn you can change the attuned elemental type of your avatar as an action.\n\nEach element will also give your avatar a set of unique traits and a cantrip that it can cast. The different elements are detailed in the Elements table below.\n\nElemental Avatar\n\nLarge elemental, unaligned\n\nArmor Class 11 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d10 (or 6) + its Constitution modifier per soul binder level\n\nHit Die 1d10 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA16 (+3)14 (+2)14 (+2)6 (-2)12 (+1)6 (-2)\n\nSenses darkvision 60 ft.\n\nLanguages Understands the languages of its binder, but can't speak\n\nDamage Resistance: attuned elemental damage type\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d10 + its Strength modifier damage of your current attuned type.\n\nElements\n\nElement\/damage typeTraitCantripAir\/lightningThe avatar has a flying (hover) speed equal to its walking speed.gustEarth\/ThunderThe avatar can burrow through nonmagical, unworked earth and stone. While doing so, the elemental doesn't disturb the material it moves through.mold earthFire\/fireThe avatar sheds bright light in a 30-foot radius and dim light in an additional 30-feet radius.control flamesWater\/coldThe avatar has a swimming speed equal to its walking speed, and has the Amphibious trait.shape water\n\nExpanded Spell List\n\nAs your soul becomes one with the elements and nature itself, you gain access to more spells. These spells are always prepared and don't count against the number of spells you can prepare each day. They are soul binder spells for you.\n\nElements Bond Spells\n\nSpell LevelSpells\n1st absorb elements\n2nd dragon's breath\n3rd protection from energy\n4th elemental bane\n5th conjure elemental"}],"3":[{"featuretext":"Elemental Burst\n\nAt 3rd level, your avatar has learned to harness its elemental powers with great fury. As an action, it can burst elemental force all around it.\n\nEvery creature of its choice within 10 feet of it must make a saving throw which is dependent on the element of the attack, taking 3d8 damage of your current attuned elemental type on a failed save, or half as much on a successful one. Additionally, they suffer one of the following effects, dependent on what element you are attuned to:\n\nAir. Any creature within the area must succeed on a Strength saving throw or be pushed 15 feet away from the avatar.\n\nEarth. Any creature within the area must succeed on a Strength saving throw or be knocked prone.\n\nFire. Any creature within the area must succeed on a Dexterity saving throw or get charred, imposing disadvantage on their next attack.\n\nWater. Any creature within the area must succeed on a Constitution saving throw or have their speed reduced to 0 feet, until the end of your next turn.\n\nOnce your avatar has used this feature it must finish a long rest before it can do so again.\n\nThe damage of this feature increases by 1d8 as you gain levels in this class. The damage improves to 4d8 at 7th level, 5d8 at 11th level, 6d8 at 15th level and 7d8 at 18th level.\n\n"}],"7":[{"featuretext":"Boon of Nature\n\nWhen you reach 7th level, your soul is infused with the essence of nature through your avatar. As an action, you can use this power to empower your avatar. It keeps this boon for 1 minute. The boon has a different effect depending on what element you are attuned to, and the boon will not change even if you attune to a different element while it is in effect.\n\nAir. Your avatar runs swift like lightning. Its speed becomes 90 feet, and opportunity attacks against it have disadvantage.\n\nEarth. Your avatar hardens its rocky carapace. It gains temporary hit points equal to double your Charisma modifier at the start of its turns.\n\nFire. Your avatar strikes with precision. It can add your Charisma modifier to its attack rolls.\n\nWater. Your avatar freezes enemies into place. It can attempt to grapple a creature within 5 feet of it as a bonus action. While grappled by this feature, the grappled creature is also restrained. The avatar can only have one creature grappled like this at a time.\n\nOnce you have used this feature you must finish a long rest before you can do so again.\n\n"}],"11":[{"featuretext":"Edicts of the Elements\n\nAt the 11th level, you can command your avatar to unleash their elemental powers. The following commands are added to your Edict options:\n\nElemental Bolt. You command your avatar to hurl a bolt of elemental energy. It must use its reaction to send a bolt flying in a direction of your choice, flying in a 30-feet long and 5-feet wide line.\n\nWhen it hits a creature, that creature must succeed on a Dexterity saving throw or take 4d8 damage of your current attuned type and the bolt disperses. If creature does succeed, the bolt keeps flying until it hits another creature or travels its full distance.\n\nPunch of the Avatar. Your avatar gathers elemental energy in its hand, unleashing its energy when next striking a foe. If a creature is hit by your elemental's attack until the end of this turn, it takes an additional 3d8 damage of your current attuned type and must succeed on a saving throw determined by your attuned element. On a failed save it is subjected to a negative effect. The saving throw and its effect is identical to the one in your Elemental Burst feature.\n\n"}],"15":[{"featuretext":"Merged Attunement\n\nWhen you reach 15th level, your avatar can take on a form of multiple elements, combining the strength of both. You can now attune to two elements at once. Your avatar gains resistance to both damage types associated with said elements. When your elemental attacks, it can choose between the two damage types for its attacks. It does the same for its Edict options and when it uses Elemental Burst. It gains both traits and cantrips from your attuned elements. When you use your Boon of Nature feature, it gains the effects of both elements as well.\n\nWhen you use an action to change your avatar's elements, you can choose to change both at once.\n\n"}]}},{"name":"Bond of the Playful Fey","class":"Soul Binder","level":{"1":[{"featuretext":"Bond of the Playful Fey\n\nThere are places where the barrier between the Material Plane and the Feywild is thin, and sometimes creatures from one plane end up in another. Soul binders have found that creatures from the Fey make excellent companions. Maybe you got your companion as a gift from an Archfey or maybe the two of you became friends naturally and made a bond.\n\nTrickster Spirit\n\nWhen you choose this bond at 1st level, you make a bond with a playful creature from the Feywild. The fey has the appearance of your choice and uses the Fey Companion stat block. Additionally, as your soul is bonded with the creature, you learn to speak its language. You can speak, read and write Sylvan.\n\nFey Companion\n\nMedium fey, chaotic neutral\n\nArmor Class 11 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d8 (or 5) + its Constitution modifier per soul binder level\n\nHit Die 1d8 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA16 (+3)14 (+2)12 (+1)8 (-1)10 (+0)13 (+1)\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d10 + its Strength modifier bludgeoning, piercing or slashing damage.\n\nExpanded Spell List\n\nAs you bind with this magical creature from another plane, you are able to have more spells available to you. These spells are always prepared and don't count against the number of spells you can prepare each day. They are soul binder spells for you.\n\nPlayful Fey Bond Spells\n\nSpell LevelSpells\n1st faerie fire\n2nd enthrall\n3rd major image\n4th hallucinatory terrain\n5th dream"}],"3":[{"featuretext":"Trickster's Dance\n\nAt 3rd level, your companion has learned to use their illusory powers to confuse and play tricks on their enemies.\n\nWhenever your companion is hit with a melee weapon attack, it can use its reaction to reduce the damage of the attack by 1d8 + your Charisma modifier + your soul binder level.\n\nIf the damage is reduced to 0, your companion can force the enemy to make a Wisdom saving throw. On a failed save, the creature takes psychic damage equal to the original amount of damage their attack would have dealt.\n\nYour fey can use this feature a number of times equal to your Charisma modifier (minimum 1). It regains all expended uses when you finish a long rest.\n\n"}],"7":[{"featuretext":"Mystical Evasiveness\n\nWhen you reach 7th level, you have learned to channel the powers from the Feywild and can use that energy to form a protective veil over your companion.\n\nWhenever your companion is forced to make a saving throw due to a spell or another magical effect, you can use your reaction to give your companion advantage on the saving throw if you are within 30 feet of it.\n\n"}],"11":[{"featuretext":"Jester's Edicts\n\nAt 11th level, you can command your companion to pull playful maneuvers. The following commands are added to your Edict options:\n\nHide and Seek. You command your companion to hide itself from preying eyes. On its next turn it can use a bonus action to turn invisible until the start of its next turn. The invisibility is broken if the companion makes an attack or otherwise harms another creature.\n\nHop and Skip. You command your companion to blink in and out of the Fey, jumping to a different position. On its turn, your companion can use its bonus action to teleport up to 30 feet to a point that it can see.\n\n"}],"15":[{"featuretext":"Fooling Copycat\n\nWhen you reach 15th level, your companion resonates with you so well, that it can mimic your every move.\n\nAs a bonus action, your companion can create an illusion over itself that is identical you, including the clothes and equipment you are currently wearing. The illusion lasts for 10 minutes or until the companion ends it as a bonus action. While the illusion is active, the companion gains the following benefits:\n\nOn its turn it can cast soul switch without expending a spell slot or material components.\n\nWhile the two of you are within 5 feet of each other, you both have advantage on attack rolls, and creatures short of truesight have disadvantage on attacks against the two of you.\n\nThe companion can speak any of your languages using your voice.\n\nYou and your companion can communicate telepathically as long as you are on the same plane of existence\n\nOnce it has used this feature it must finish a short or long rest before it can do so again.\n\n"}]}},{"name":"Bond of the Divine","class":"Soul Binder","previewtext":"Sometimes gods grant gifts to worthy mortals. They can take all shapes and forms and you have been given a boon in the form of a friend and protector for life.\n\nSoul binders that make a bond with a celestial are often followers of the god that the celestial used to serve, traveling the world and spreading the word of that god.\n\n","level":{"1":[{"featuretext":"Guardian of the Heavens\n\nWhen you choose this bond at 1st level,, you bind your soul with a celestial creature. The celestial has the appearance of your choice and uses the Holy Guardian stat block.\n\nDivine Warrior\n\nAt 1st level you gain proficiency with medium armor and martial weapons. You can also speak, read and write Celestial. Additionally your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.\n\nHoly Guardian\n\nMedium celestial, lawful good\n\nArmor Class 13 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d10 (or 6) + its Constitution modifier per soul binder level\n\nHit Die 1d10 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA15 (+2)13 (+1)16 (+3)8 (-1)11 (+0)13 (+1)\n\nSenses darkvision 60 ft.\n\nDamage Resistances necrotic, radiant\n\nLanguages Celestial, Understands the other languages known by its binder, but can't speak them.\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d8 + its Strength modifier bludgeoning, piercing or slashing damage.\n\n"}],"3":[{"featuretext":"Gift of Life\n\nWhen you reach 3rd level, your companion has learned to be selfless and giving, sacrificing part of its life energy to heal you or your companions.\n\nYour guardian can use a bonus action to deal damage to itself, in turn healing a creature of its choice within 5 feet of it. This damage ignores temporary hit points, immunities and resistances. The creature regains hit points equal to the damage dealt.\n\n"}],"7":[{"featuretext":"Inspiring Heal\n\nAt 7th level, you know how to mend wounds and inspire your guardian to perform better in combat.\n\nYou learn the healing word spell. You always have it prepared, and it doesn't count against the number of spells you can prepare each day. It counts as a soul binder spell for you.\n\nAdditionally, whenever you cast healing word on your guardian, it can use its reaction to make a melee weapon attack.\n\n"}],"11":[{"featuretext":"Edicts of Radiance\n\nStarting at 11th level, you can command your guardian with a voice that can pierce the heavens. The following commands are added to your Edict options:\n\nBlinding Light. You command your guardian to unleash its inner radiant light. On its turn it can use its action to release its blinding energy. Creatures of its choice within 15 feet of it must succeed on a Constitution saving throw or be blinded until the end of your next turn.\n\nSpread Your Wings. Your words inspire your guardian to fly as high as the sky. It has a flying speed of 60 feet and it doesn't provoke opportunity attacks until the start of your next turn.\n\n"}],"15":[{"featuretext":"Death Prevention\n\nWhen you reach 15th level, your guardian have gained the powers to protect people from the grasp of death.\n\nIf a creature within 60 feet of your companion drops to 0 hit points or fails a death saving throw, your guardian can use its reaction to teleport to an unoccupied space within 5 feet of that creature and breathe new life into them. The creature regains 10d12 hit points.\n\nOnce you use this feature, you can't do so again until you finish a long rest.\n\n"}]}},{"name":"Oath of the Watcher","class":"Paladin","previewtext":"Paladins who vow the Oath of the Watchers seek to protect the moral realm from the predations of extraplanar creatures, many of which can lay waste to mortal soldiers. Thus, the Watchers hone their minds, spirits, and bodies to be the ultimate weapons against such threats.\n\nPaladins who follow the Watchers' oath are ever vigilant in spotting the influence of extraplanar forces, often establishing a network of spies and informant to gather information on suspected cults. To a Watch, keeping a healthy suspicion and awareness about one's surroundings is as natural as wearing armor in battle.\n\n","level":{"3":[{"featuretext":"Channel Divinity\n\nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\nAdbjure the Extraplanar You can use your Channel Divinity to castigate unwordly beings. As an action, you present your holy symbol and each elemental, fey, fiend, or aberration within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.\n\nWatcher's Will You can use your Channel Divinity to invest your presence with the warding power of your faith. As an action, you can choose a number of creatures you can see within 30 feet of you, up to a number equal to your Charisma modifier (minimum of one creature). For 1 minute, all the chosen creatures have advantage on Intelligence, Wisdom, and Charisma saving throws.\n\n"},{"featuretext":"Aura of the Sentinel\n\nYou emit an aura of alertness while you aren't incapacitated. When you and any creature of your choice within 10 feet of you rolls initiative, you each gain a bonus to initiative equal to your Charisma modifier (minimum of +1).\n\nAt 18th level, the range of this aura increases to 30 feet.\n\n"}],"15":[{"featuretext":"Vigilant Rebuke\n\nAt 15th level, you've learned how to magically chastise anyone who dares cast unwanted spells at you and your wards. Whenever you or a creature you can see within 30 feet of you succeeds on a saving throw against a spell, you can use your reaction to deal 2d8 + your Charisma modifier force damage to the spellcaster.\n\n"},{"featuretext":"Mortal Bulwark\n\nYou manifest a spark of your diety's power in defense of your sacred oath. As a bonus action, you gain the following benefits for 1 minute:\n\n• You gain truesight in a 120-foot radius.\n\n• You have advantage on attack rolls against elementals, fey, fiends, and aberrations.\n\n• When you hit a creature with an attack and deal damage to it, you can also force it to make a Charisma saving throw. On a failed save, the creature is magically banished to its native plane of existence if it's currently not there. On a successful save, the creature can't be banished by this feature for 24 hours.\n\nOnce you use this bonus action, you can't use it again until you finish a long rest.\n\n"}]}}],"sharedclassfeatures":[{"name":"Blessed Warrior","effects":[{"sharedclassfeaturemenu":{"name":"Blessed Warrior","class":"Paladin"}},{"featuretext":"You learn two cantrips of your choice from the cleric spell list. They count as paladin spells for you, and Charisma is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the cleric spell list."}]}],"sharedclassfeaturemenus":[],"feats":[{"name":"Silver-Tongued","displayname":"Silver-Tongued","effects":[{"modifyabilityscore":{"charisma":"1"}},{"featuretext":"• You\tgain\tproficiency\tin\tthe\tDeception\tskill.\tIf\t\r\nyou\tare\talready\tproficient\tin\tthe\tskill,\tyou\tadd\t\r\ndouble\tyour\tproficiency\tbonus\tto\tchecks\tyou\t\r\nmake\twith\tit.\r\n• When\tyou\ttake\tthe\tAttack\taction\ton\tyour\tturn,\t\r\nyou\tcan\treplace\tone\tattack\twith\tan\tattempt\tto\t\r\ndeceive\tone\thumanoid\tyou\tcan\tsee\twithin\t30\t\r\nfeet\tof\tyou\tthat\tcan\tsee\tand\thear\tyou.\tMake\ta\t\r\nCharisma\t(Deception)\tcheck\tcontested\tby\tthe\t\r\ntarget’s\tWisdom\t(Insight)\tcheck.\tIf\tyour\tcheck\t\r\nsucceeds,\tyour\tmovement\tdoesn’t\tprovoke\t\r\nopportunity\tattacks\tfrom\tthe\ttarget\tand\tyour\t\r\nattack\trolls\tagainst\tit\thave\tadvantage;\tboth\t\r\nbenefits\tlast\tuntil\tthe\tend\tof\tyour\tnext\tturn\tor\t\r\nuntil\tyou\tuse\tthis\tability\ton\ta\tdifferent\ttarget.\tIf\t\r\nyour\tcheck\tfails,\tthe\ttarget\tcan’t\tbe\tdeceived\tby\t\r\nyou\tin\tthis\tway\tfor\t1\thour."}]}],"weapons":[]}