{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Pact of the Ancient Dragon","class":"Warlock","spellcastingability":"charisma","level":{"1":[{"featuretext":"HOARD SENSE\nBeginning at 1st level, you inherently know the\nworth of any treasure or valuable item you can\nsee, and have advantage on Intelligence\n(Investigation) checks to find the location of\ncoinage, gems, and art items of significant worth.\nIn addition, as an action you may summon or\ndismiss a personal chest from your patron's\nhoard to or from an unoccupied point on the\nground within 5 feet of you. The chest is initially\nempty, and may hold up to 6 cubic feet of non-\nliving material (3 feet by 2 feet by 1 foot)."},{"addspell":{"name":"Shield","spelllevel":"1"}},{"addspell":{"name":"Command","spelllevel":"1"}}],"3":[{"addspell":{"name":"Locate Object","spelllevel":"2"}},{"addspell":{"name":"See Invisibility","spelllevel":"2"}}],"5":[{"addspell":{"name":"Elemental Weapon","spelllevel":"3"}},{"addspell":{"name":"Protection from Energy","spelllevel":"3"}}],"6":[{"featuretext":"ANCIENT's BREATH\nAt 6th level, you can channel the element of your\ndraconic patron, breathing it as a torrent of dam-\naging energy. Consult the Draconic Patronage\ntable and gain the damage type and breath\nweapon spread associated with the color of your\ndraconic patron. As an action on your turn, you\nmay expend a spell slot of 3rd level or higher and\nuse this breath weapon, requiring all creatures\nin this area to make a Dexterity save against\nyour spell save DC, or a Constitution save if the\nbreath deals Cold or Poison damage, taking half\ndamage if the save is successful. This ability\ndeals damage of your patron's associated type\nequal to 4d8 plus your Charisma modifier, plus\n1d8 damage per level of the spell slot above 3rd.\n"}],"7":[{"addspell":{"name":"Compulsion","spelllevel":"4"}},{"addspell":{"name":"Fire Shield","spelllevel":"4"}}],"9":[{"addspell":{"name":"Dominate Person","spelllevel":"5"}},{"addspell":{"name":"Hallow","spelllevel":"5"}}],"10":[{"featuretext":"BLOOD OF DraGONS\nStarting at 10th level, you gain resistance to the\ndamage type associated with your draconic\npatron. In addition, when you succeed on a\nsaving throw against an effect that would deal\ndamage of your patron's type, you take no\ndamage from the effect."}],"14":[{"featuretext":"DRACONIC APOTHEOSIS\nOnce you reach 14th level, you can assume the\nform of an aspect of your draconic patron for up\nto a minute. You may sprout horns, grow scales,\ngain burning draconic eyes, and take on other\nfeatures directly reminiscent of your draconic\nlord.\nYou can transform on your turn using a bonus\naction, which grants the the following abilities:\nWebbed dragon wings sprout from your back,\ngranting you a flying speed of 60 feet.\nAs a bonus action on your turn, you may level\nyour draconic gaze at a creature within 60\nfeet of you. This creature must make a\nWisdom saving throw against your spell save\nDC or become frightened of you for one\nminute. A creature affected by this repeats\nthis save at the end of each of its turns, and a\ncreature that saves against this effect may not\nbe subject to it again for 24 hours.\nWhile a creature is frightened of you, they\nhave disadvantage on saving throws against\nyour spells and abilities, and you have advan-\ntage on attack rolls against this creature\n3\/\nThe damage dice of your Ancient's Brea 3 \/3)\nincrease from d8's to d12's.\nOnce you have used this ability, you may not use\nit again until you complete a long rest."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}