{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Oath of Conquest","displayname":"Oath of Conquest","class":"Paladin","previewtext":"Devote yourself to combat and spreading fear amongst your foes.","level":{"3":[{"featuretextwithbullet":"Oath Spells - You have gained access to spells that do not count against the spells you prepare. They are added on the spell page of the app."},{"featuretextwithbullet":"Channel Divinity - Once per short rest, you may use your Channel Divinity power to activate 1 of 2 effects: Conquering Strike and Guided Strike."},{"featuretextwithbullet":"Conquering Strike - when you use the Attack action with a melee weapon and hit your target, spend your Channel Divinity to force the creature to make a Wisdom saving throw against your spellcasting DC. on a fail, the target is frightened of you for a minute. They can repeat the save at the end of their turns."},{"featuretextwithbullet":"Guided Strike - after you make an attack roll to hit, you may spend your Channel Divinity to add +10 to the roll. You must make this decision before the DM announces if the attack hits or misses."},{"addspell":{"name":"Armor of Agathys","spelllevel":"1"}},{"addspell":{"name":"Command","spelllevel":"1"}}],"7":[{"featuretextwithbullet":"Aura of Conquest - if you are not incapacitated, you have an aura that encompasses an area 10 ft in every direction from you, total cover blocks this. Enemies in the aura have disadvantage on saving throws against being frightened. "}],"15":[{"featuretextwithbullet":"Implacable Spirit - You can no longer be charmed."}],"5":[{"addspell":{"name":"Hold Person","spelllevel":"2"}},{"addspell":{"name":"Spiritual Weapon","spelllevel":"2"}}],"9":[{"addspell":{"name":"Bestow Curse","spelllevel":"3"}},{"addspell":{"name":"Fear","spelllevel":"3"}}],"13":[{"addspell":{"name":"Blight","spelllevel":"4"}},{"addspell":{"name":"Dominate Beast","spelllevel":"4"}}],"17":[{"addspell":{"name":"Dominate Person","spelllevel":"5"}},{"addspell":{"name":"Insect Plague. ","spelllevel":"5"}}],"18":[{"featuretextwithbullet":"Your aura radius has increased."},{"replacestringfromfeaturetext":{"replacementtext":"area 30 ft in every","find":"area 10 ft in every"}}],"20":[{"featuretextwithbullet":"Invincible Conquerer - Once per long rest, as an action, gain the following list of buffs:"},{"featuretext":"You have resistance to all damage."},{"featuretext":"When you take the Attack action, you can make an additional attack in that action. "},{"featuretext":"Your melee weapon attacks are critical hits on 19 or 20. "}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
