{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Path of Arcane Fury","class":"Barbarian","spellprogression":"third","level":{"3":[{"featuretext":"WEATHFUL INCANTATIONS\nAt 3rd level you learn to channel small amounts of magic in spite of\nyour anger. You can cast and concentrate on cantrips while raging\nCasting a spell that forces a surving throw counts as an attack for the\npurposes of continuing rage. Once per turn while raging, you may\nadd your Rage Damage bonus to the damage roll of a spell\nAssign two sorcerer spells of Ist level or higher you know as\nrampage spells. You can cast and maintain concentration om\nrampage spells while ruging. You can assign additional sorcerer\nspells you know as rampage spells as shown in the Path of the\nArcane Fury Spellcasting table. You can reassign rampage Spells\nwhen you finish a short or long rest."}],"6":[{"featuretext":"ARCANE STRIKE\nStarting 6th level your inherent magical ability manifestas pure\nmagic energy when you strike. When you hit a creature with a melee\nweapon attack, you deal an additional 1d4 force damage.\nOnce per long rest, you can attempt to channel your arcane power\nwhen you rage. If you do so. for the duration of your rage you deal an\nadditional 304 force damage instead. When your rage ends\nSuffer one level of exhaustion\nIn addition, when you use your Reckless Allack feature, you also\ngain advantage on spell attacks. When you cast a cantrip as an\naction, you can make one melee weapon attack as part of the same\naction, cither before or after the casting of the contrip.\nSpell attack modifier your proficiency bonus +your\nConstitution modifier\nRitual Casting. You can cast any sorcerer spell you know as a ritual\nif that spell has the ritual tag\nSpellcasting Focus. You can use a simple or martial weapon as a\nspellcasting focus for your sorcerer spells."}],"10":[{"featuretext":"SORCEROUS STAMINA\nBeginning at 10th level your exposure to the arcane hardens your\ndefence againsi the more magical types of damage. While raging.\nyou have resistance to force lychic and thunder damage.\nWhen you enter your rage, or as a bonus action while raging, you\ncan expend a spell slot of Ist level or higher to gain resistance to\none type of damage per level of the spell slot expended. These\nresistances last for the duration of your race or until you use this\nfeature again."}],"14":[{"featuretext":"FORTUNATE RECOVERY\nAt 14th level you can channel your pure battle prowess into power\nfor your spells. Whenever you soorc a critical hit on a hostile\ncreature or reduce a hostile creature to his points, you recover one\n1st or 2nd level spell slot. If you have no expended 1st or And level\nslots to recover your next malee weapon attack deals an additional\n5d4 force damage."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}