{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Path of the Sin Scarred","class":"Barbarian","previewtext":"One unfortunate night, one terrible event now defines a dark\r\npart of your soul. Unable to forgive or forget has lead to anger\r\ntaking on the form of vengeance and burning forth to destroy\r\nall who make the mistake of getting in the way of those who\r\nhave been scared.","level":{"3":[{"featuretext":"Scarred Visage\r\nAt 3rd level when you take this path you have been afflicted\r\nwith a curse either by a close encounter with a magical\r\ncreature or a heinous act you have performed. When you rage\r\nthe wounds from this event open up with your fury giving you\r\nadvantage on intimidation checks.\r\nSin save DC = 8 + proficiancy + con"},{"featuretext":"Natural Weapon\r\nAdditionally, at 3rd level, your body has begun to warp for the\r\ncurse inflicted upon you. While raging you grow a natural\r\nweapon from your body that you gain proficiency with. Chose\r\na natural weapon from below. These natural weapons all\r\nhave the finesse property.\r\nClaws: 1d8 slashing damage. On a successful attack, the\r\ncreature hit must make a Constitution saving throw\r\nagainst your sin save or take an additional 1d6 damage on\r\nthe end of its turn till it either is healed through magic or a\r\nDC10 medicine check.\r\nHorns: 1d8 piercing damage. If you move 10ft then use\r\nyour horns to attack you do 1D8 bludgeoning damage and\r\nthe creature hit must make a natural weapon saving throw\r\nor be pushed 10ft and knocked prone\r\nTail: 1d4 bludgeoning damage. You can attack with this as\r\na bonus action. Additionally, you can attack any creature\r\nthat moves within 5ft or you as a reaction.\r\nFangs: 1d8 pricing damage. On a successful hit, you gain\r\nback hit points equal to half the damage inflicted by this\r\nattack."}],"6":[{"featuretext":"Elemental Atonement\r\nAt 6th level, the magical essence of your curse can no longer\r\nbe contained within you, spilling out with your rage warping\r\nyou even further. Chose an element from the list below, when\r\nyou are raging and attack using your natural weapon you deal\r\nan additional 1d6 of that damage type. This damage\r\nincreases to 2d6 when you are at 12th level and 3d6 at 16th\r\nlevel. Additionally Natural weapons count as magical for\r\novercoming resistance to non-magical weapons.\r\nFire: Your skin becomes black like charcoal and you\r\nbellow out smoke from your mouth and nostrils.\r\nCold: You become pale as snow, your eyes become a deep\r\nblue and you cool the air around you.\r\nLightning: Your veins glow an eerie purple\/blue and you\r\nemit a faint light for 10ft.\r\nForce: Wind rushes around you and your facial feature\r\nsharped to an unnatural degree.\r\nNecrotic: Your visage becomes shrouded in a black mist\r\nand your bones are highly visible beneath your skin.\r\nRadiant: You are shrouded in a bright aura, Your eyes\r\nbecome pure white, and you emit bright light for 10ft"}],"10":[{"featuretext":"Greater Mutations\r\nAt 10th level, your curse has progressed giving you access to\r\nmore advanced mutations. Choose one mutation from the list\r\nbelow, when you rage you gain the benefits of the option\r\nchosen.\r\nWings: A pair of wings sprout from your body grating you\r\na flight speed equal to your movement speed.\r\nExtended limbs: Your arms become unnaturally long\r\ngiving weapon attacks and the claw natural weapon the\r\nreach property.\r\nNatural armour: Your body natural resilience increases\r\ngranting you +2 to your armour class.\r\nEnthralling venom: When you successfully hit a creature\r\nwith one of your natural weapons you can force it to make\r\na charisma saving throw against your Sin save DC or\r\nbecome charmed by you till the beginning of your next\r\nturn. You can do this as many times as your Constitution\r\nmodifier per long rest.\r\nBanshees shrike: You let out a bloodcurdling shrike\r\ncausing every hostile creature within 30ft of you to make a\r\nconstitution saving throw against your Sin save DC or\r\ntake 2d10 plus your constitution modifier and become\r\ndefend or take half the damage and not be defend on a\r\nsuccessful save. You can do this once per short or long\r\nrest."}],"14":[{"featuretext":"Acceptance\r\nAt 14th level, your curse has fully integrated with your body\r\nand you have become a true monster. You can choose and\r\nadditional natural weapon and your natural weapons deal\r\ndamage equal to one die higher eg. 1d8 to 1d10. Additionally,\r\nwhile raging you gain an additional ability according to what\r\nelement you had chosen for the Elemental Attonment feature.\r\nFire: Dangerous flames jet out from your body, whenever\r\na hostile creature ends its turn within 10ft must make a\r\nDexterity saving throw against your Sin save DC or take\r\n3d6 fire damage\r\nCold: The air practically freezes in your presence. Any\r\ncreature that ends its turn within 10ft of you must make a\r\nConstitution saving throw against your Sin save DC or\r\ngain one level of exhaustion. if a creature passes this save\r\nbecomes immune to this effect for 1 minute.\r\nLighting: You become like lightning itself and gain an\r\nextra 10ft of movement speed. Additionally, when you\r\nmove more than 15ft towards a creature as an action, you\r\ncan force that creature to make a dexterity saving throw\r\nagainst your Sin save DC or take 2d8 lightning damage\r\nand be knocked prone or take half damage and not be\r\nknocked prone on a successful save. You can do this as\r\nmany times as your Constitution modifier per long rest.\r\nForce: A strong wind whips around you causing ranged\r\nweapon attacks to have disadvantage against you and any\r\ncreature that ends its turn within 10ft of you must make a\r\nStrength saving throw against your Sin save DC or be\r\npushed back by 10ft.\r\nNecrotic: You become a force of entropy. When you\r\nreduce a medium or smaller humanoid or beasts hit\r\npoints to 0 you can make that creature make a\r\nconstitution saving throw against your Sin save DC or be\r\nresurrected with 1 hit point. The resurrected creature\r\nuses the statistics of a zombie and takes its turn\r\nimmediately after yours in combat. The creature obeys\r\nyour mental commands and can only take the attack\r\naction in combat and can only make 1 attack per round.\r\nThe creature remains animated for 1 hour before\r\ncrumbling to dust.\r\nRadiant: You body radiates divine light. As an action, you\r\ncan teleport to an unoccupied space within 30ft of you and\r\nany hostile creature within 10ft of the space you\r\nteleported to must make a Constitution saving throw\r\nagainst your Sin save DC or take 4d6 radiant damage and\r\nbe blinded till the start of your next turn or take half ad not\r\nbe blinded on a successful save."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}