{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"PHYSICIAN","class":"Artificer","level":{"3":[{"featuretext":"MEDICAL SCHOOL\n\n3rd level Physician feature\n\nYou gain proficiency in Medicine and with the Herbalism kit.\n\nAdditionally, you are immune to disease.\n\nDIAGNOSIS\n\n3rd level Physician feature\n\nYou gain the ability to mend and heal wounds. You have a pool of dun equal to 1+ your artificer level As a bonus action, target a creature you can see within 60 feet of you, spending dice from the pool Roll the dice you spend and add them together, the target regains a number of his points equal to the total\n\nThe maximum number of dice you can spend at once equals your intelligence modifier and your pool regains all expended dice when you finish a long rest"}],"5":[{"featuretext":"HARM-A-CIST\n\nSih-level Physician feature\n\nUsing your Diagnosis feature or casting a spell which restores hit points causes your next damage dealing spell to deal additional necrotic damage equal to half your Artificer level (rounded down)\n\nThis additional damage can only be applied once per creature per turn. This feature doesn't stack"}],"9":[{"featuretext":"PHYSICAL EXAMINATION\n\n9th-level Physician feature\n\nYou examine the physique of a creature to reveal their\n\nstrengths and weaknesses. As an action, target a creature\n\nyou can see within 60ft of you. The target must succeed on\n\nan Intelligence saving throw against your spell save DC or you learn the following attributes about it;\n\nDamage Immunities\/Resistances\/Vulnerabilities and Condition Immunities.\n\nYou can use this feature a number of times equal to your Intelligence modifier, regaining all expended uses when you finish a long rest."}],"15":[{"featuretext":"MASTER SURGEON\n\n15th-level Physician feature\n\nNo ailment is beyond your ability to heal You gain the ability to cast Regenerate, without expending a spell slot or requiring the material components. Once you do so, you cannot use this feature again until you finish a long rest."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}