{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Quickshot","class":"Rogue","level":{"3":[{"featuretext":"QUICK TRICKS\nWhen you choose this archetype at 3rd level you begin to\nIran how to master thrown weapons and can perform quick\ntricks while using them\nYou learn three quick tricks of your choice, mary of which\nenlance attack in same way. However, you can use only\nonc trick per attack. You Icarn onc aditional trick of your\ncho oe at 7th, 10th, and 15th level isach time you learn new a\ntrick, you can also replace on trick you know with a different\nOne\nYou have a number of quick tricks you can use equal to\nyour Sneak Attack die, and must finish a short or long rest to\nregain them"},{"featuretext":"SHARP STRIKER\nAl 3rd level you can draw or stowa thrown weapon with a\nfree action and attacking at long range\ndoes no impose disadvantage"}],"9":[{"featuretext":"STEADY HANDS\nAt 9th level you can throw a weapon wlaik an enemy is\nwithin 5 feet without taking clisadvantage on the attack roll\nFurther, you can forego your full ment to eatly your\na im. While aiming you double your proficiency bonus to your\nfirst thrown weapon attack made this turn."}],"13":[{"featuretext":"SHARPENED SENSES\nStarting at 13th level you gain proficiency with the\nAmatics and Perption skills If you are already proficient\nwith these skills, you add couble your proficiency bonus.\nAdditionally, you may engage in two weapon lighting with\nyour thrown weapons, as if you had the Two-Weapon Fighting\nstyle. You can add your ability modifier in the damage of the\noft-hand thrown weapon."}],"17":[{"featuretext":"QUICK SHOT\nMt 17th level while aiming as a result of your Steady Henda\nfeature, you can throw a scoond weapon as a part of your\naimed attack and are able to sneak attack with it, even if you\nhave already sneak attackel Ding saadik anakitional 3\/6\nto the ancak attack damage of both thrown weapon attacks.\nCitat cand le denta."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}