{"backgrounds":[],"races":[],"subraces":[],"classes":[{"name":"Revised Ranger","displayname":"Revised Ranger","hitdie":"10","armorproficiencies":["Light Armor","Medium Armor"],"weaponproficiencies":["Martial Weapons","Simple Weapons"],"equipment":[{"selection":[{"armor":{"name":"Scale Mail"}},{"armor":{"name":"Leather"}}]},{"selection":[{"weapon":{"name":"Shortsword","quantity":"2"}},[{"weapon":{"type":"simple","range":"melee"}},{"weapon":{"type":"simple","range":"melee"}}]]},{"selection":["Dungeoneer's Pack","Explorer's Pack"]},{"weapon":{"name":"Longbow"}},"Quiver of 20 Arrows"],"saveproficiencies":["strength","dexterity"],"classskills":["animal handling","athletics","insight","investigation","nature","perception","stealth","survival"],"skillcount":"3","spellprogression":"half","spellcastingability":"wisdom","multiclass":{"abilityscoreprerequisites":[],"armorproficiencies":["Light Armor","Medium Armor","Shield"],"weaponproficiencies":["Simple Weapons","Martial Weapons"],"skillcount":"1"},"level":{"1":[{"menu":{"name":"Favored Enemy","title":"Favored Enemy","selections":"1","hidepreviewtext":"true","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Beasts","displayname":"Favored Enemy - Beasts","previewtext":"+2 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information."},{"name":"Fey","displayname":"Favored Enemy - Fey","previewtext":"+2 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information."},{"name":"Humanoids","displayname":"Favored Enemy - Humanoids","previewtext":"+2 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information."},{"name":"Monstrosities","displayname":"Favored Enemy - Monstrosities","previewtext":"+2 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information"},{"name":"Undead","displayname":"Favored Enemy - Undead","previewtext":"+2 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information."}],"effects":[{"languagesknowntext":"One extra language, typically spoken by your Favored Enemy or creatures associated with them."}]}},{"featuretextwithbullet":"Natural Explorer: In natural environments, you gain the following benefits:\n   - You ignore difficult terrain.\n   - You have advantage on initiative rolls.\n   - On your first turn during combat, you have advantage on Attack rolls against creatures that have not yet acted.\n   In addition, you are skilled at navigating the wilderness. You gain the following benefits when traveling for an hour or more:\n   - Difficult terrain doesn't slow your group's travel.\n   - Your group can't become lost except by magical means.\n   - Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.\n   - If you are traveling alone, you can move stealthily at a normal pace.\n   - When you forage, you find twice as much food as you normally would.\n   - While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area."}],"2":[{"sharedclassfeaturemenu":{"name":"Fighting Style","selections":"1","class":"Ranger"}},{"setspellprogression":"Half"},{"setcasterlevel":"casterlevel"}],"3":[{"featuretextwithbullet":"Primeval Awareness: \n   - You can communicate simple ideas to a beast as an action, and can read its basic mood and intent. you learn it's emotional state, whether it is affected by Magic, short-term needs, and actions you can take if any to persuade to not attack. You cannot use this ability against a creature that you have attacked within the past 10 minutes.\n   - You can spend 1 uninterrupted minute in concentration to sense whether any of your favored enemies are present within 5 miles. This reveals which of your favorite enemies are present, their numbers, and the creatures general direction and distance (in miles) from you. If there are multiple groups within range, you learn this information for each group."},{"archetypemenu":""}],"4":[{"abilityscoreimprovement":""}],"6":[{"menu":{"name":"Greater Favored Enemy","title":"Greater Favored Enemy","selections":"1","hidepreviewtext":"true","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Aberrations","displayname":"Greater Favored Enemy - Aberrations","previewtext":"+4 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information; Advantage on saving throws against spells and abilities used by Aberrations."},{"name":"Celestials","displayname":"Greater Favored Enemy - Celestials","previewtext":"+4 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information; Advantage on saving throws against spells and abilities used by Celestials."},{"name":"Constructs","displayname":"Greater Favored Enemy -  Constructs","previewtext":"+4 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information; Advantage on saving throws against spells and abilities used by Constructs."},{"name":"Dragons","displayname":"Greater Favored Enemy - Dragons","previewtext":"+4 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information; Advantage on saving throws against spells and abilities used by Dragons."},{"name":"Elementals","displayname":"Greater Favored Enemy - Elementals","previewtext":"+4 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information; Advantage on saving throws against spells and abilities used by Elementals."},{"name":"Fiends","displayname":"Greater Favored Enemy - Fiends","previewtext":"+4 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information; Advantage on saving throws against spells and abilities used by Fiends."},{"name":"Giants","displayname":"Greater Favored Enemy - Giants","previewtext":"+4 damage bonus with weapon attacks; Advantage on Wisdom (Survival) checks to track; Advantage on Intelligence checks to recall information; Advantage on saving throws against spells and abilities used by Giants."}],"effects":[{"languagesknowntext":"One extra language, typically spoken by your Greater Favored Enemy or creatures associated with them."},{"replacestringfromfeaturetext":{"replacementtext":"+4 damage bonus","find":"+2 damage bonus"}}]}}],"8":[{"abilityscoreimprovement":""},{"featuretextwithbullet":"Fleet of Foot: You can Dash using a bonus action."}],"10":[{"featuretextwithbullet":"Hide in Plain Sight: You are skilled at remaining motionless for long periods of time to set up ambushes. When you attempt to hide, you can choose not to move. If you avoid moving, creatures that attempt to detect you take a -10 penalty to their Wisdom (Perception) checks until the start of your next turn. You lose this benefit if you move or fall prone for any reason. You are still automatically detected if any effect or action causes you to no longer be hidden. If you are still hidden on your next turn, you can continue to remain motionless and gain this benefit until detected."}],"12":[{"abilityscoreimprovement":""}],"14":[{"featuretextwithbullet":"Vanish: You can Hide as a bonus action. Also, you can not be tracked by nonmagical means unless you choose to leave a trail."}],"16":[{"abilityscoreimprovement":""}],"18":[{"featuretextwithbullet":"Feral Senses: Attacking a creature you can't see doesn't impose disadvantage on your attack rolls against it.  You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you are not blinded or deafened."}],"19":[{"abilityscoreimprovement":""}],"20":[{"featuretextwithbullet":"Foe Slayer: Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack that you make. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."}]}}],"archetypes":[{"name":"Beast Conclave","displayname":"Beast Conclave","class":"Revised Ranger","previewtext":"Bond with a beast, then further strengthen that bond through magic.","level":{"3":[{"featuretextwithbullet":"Animal Companion: With 8 hours of work and 50GP worth of rare herbs and fine food, you call forth a faithful animal companion. At the end of the 8 hours, your animal companion gains the benefits of the Companion's Bond ability.  You can only have one animal companion at a time.  If your companion is ever slain, you can call forth it's spirit with 8 hours of work and 25GP worth of rare herbs and fine food, and use your magic to create a new body for it.  If you use this ability while you have a current companion, the current companion leaves you and is replaced the restored companion."},{"menu":{"name":"Animal Companion","title":"Animal Companion","selections":"1","replace":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Ape","displayname":"Animal Companion - Ape","previewtext":"Uses Fist and Rock attacks, +5 Athletics, +3 Perception"},{"name":"Black Bear","displayname":"Animal Companion - Black Bear","previewtext":"Uses Bite and Claw attacks, Keen Smell, +3 Perception"},{"name":"Boar","displayname":"Animal Companion - Boar","previewtext":"Uses Tusk attacks, Charge, Relentless (short\/long rest)"},{"name":"Giant Badger","displayname":"Animal Companion - Giant Badger","previewtext":"Uses Bite and Claw attacks, Keen Smell, Darkvision 30ft"},{"name":"Panther","displayname":"Animal Companion - Panther","previewtext":"Uses Bite and Claw attacks, Pounce, Keen Smell, +4 Perception, +6 Stealth"},{"name":"Mule","displayname":"Animal Companion - Mule","previewtext":"Uses Hooves to attack, Beast of Burden, Sure-Footed"},{"name":"Giant Weasel","displayname":"Animal Companion - Giant Weasel","previewtext":"Uses Bite Attacks, Keen Hearing and Smell, +3 Perception, +5 Stealth"},{"name":"Wolf","displayname":"Animal Companion - Wolf","previewtext":"Uses Bite attacks, Keen Hearing and Smell, Pack Tactics, +3 Perception, +4 Stealth"},{"name":"Other Companion","displayname":"Other Companion","previewtext":"With DM approval, you can select another type of beast companion. You can manually edit this with appropriate information."}],"effects":[{"featuretextwithbullet":"Companion's Bond:\n   - Your Companion loses it's Multiattack ability if it has one.\n   - It obeys your command as best as it can. It rolls for its own Initiative, but you determine its actions, decisions, and attitudes. If you are incapacitated or absent, it acts on its own.\n   - When using Natural Explorer, your companion can move with you stealthily a normal pace.\n   - It uses your proficiency bonus rather than its own. In addition to normal proficiency uses, your Companion's adds it's proficiency bonus to AC and Damage rolls.\n   - It gains proficiency in two skills your choice.\n   - It becomes proficient with all saving throws.\n   - For each level you gain after 3rd, your companion gains an additional hit die and increases its hit points.\n   - When you gain an Ability Score Improvement, your Companion's abilities improve using the same rules.\n- Your Companion gains the benefits of your Favored Enemy and Greater Favored Enemy features.\n   - It shares your alignment, and has a personality trait and flaw you choose. It shares your I'd and it's bond is always \"The Ranger who travels with me is a beloved companion for whom I would gladly give my life.\""}]}}],"5":[{"featuretextwithbullet":"Coordinated Attack: When you use the Attack action on your turn, if your Companion can see you, it can use its Reaction to make a melee attack."}],"7":[{"featuretextwithbullet":"Beast's Defense: While your Companion can see you, it has Advantage on all Saving Throws."}],"11":[{"featuretextwithbullet":"Storm of Claws and Fangs: Your Companion can use its Action to make a melee attack against each creature of its choice within 5 feet of it, with a separate attack roll for each target."}],"15":[{"featuretextwithbullet":"Superior Beast's Defense: Whenever an attacker that your companion can see hits it with an attack, it can use its Reaction to halve the attack's damage."}]}},{"name":"Hunter Conclave","displayname":"Hunter Conclave","class":"Revised Ranger","previewtext":"Master weapons and learn specialized fighting techniques for use against the most dire threats.","level":{"3":[{"menu":{"name":"Hunter's Prey","title":"Hunter's Prey","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Colossus Slayer","displayname":"Colossus Slayer","previewtext":"When you hit a creature with a weapon attack, the creature takes an extra 1d8 damage if it is below it's hit point maximum. You can deal this damage once per turn."},{"name":"Giant Killer","displayname":"Giant Killer","previewtext":"When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your Reaction to attack that creature immediately after it's attack, provided you can see the creature."},{"name":"Horde Breaker","displayname":"Horde Breaker","previewtext":"Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon."}]}}],"5":[{"sharedclassfeature":{"name":"Extra Attack","class":"Ranger"}}],"7":[{"menu":{"name":"Defensive Tactics","title":"Defensive Tactics","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Escape the Horde","displayname":"Escape the Horde","previewtext":"Opportunity attacks against you are made with Disadvantage."},{"name":"Multiattack Defense","displayname":"Multiattack Defense","previewtext":"When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn."},{"name":"Steel Will","displayname":"Steel Will","previewtext":"You have Advantage on Saving Throws against being Frightened."}]}}],"11":[{"menu":{"name":"Multiattack","title":"Multiattack","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Volley","displayname":"Volley","previewtext":"You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your weapon's range. You must have ammo for each target, and you make a separate attack roll for each target."},{"name":"Whirlwind Attack","displayname":"Whirlwind Attack","previewtext":"You can use your action to make melee attacks against any number of creatures within 5 feet of you, with a separate attack roll for each target."}]}}],"15":[{"menu":{"name":"Superior Hunter's Defense","title":"Superior Hunter's Defense","selections":"1","advancedfeaturetext":{"useentrypreviewtext":"true","usebullet":"true","prefixwithentryname":"true","prefixseperator":": "},"entries":[{"name":"Evasion","displayname":"Evasion","previewtext":"When you are subjected to an effect, such as a red dragon's fiery breath or a lightning bolt spell, that allows you to make a Dexterity Saving Throw to take only half damage, you instead take no damage if you succeed on a saving throw, and only half damage if you fail."},{"name":"Stand Against the Tide","displayname":"Stand Against the Tide","previewtext":"When a hostile creature misses you with a melee attack, you can use your Reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice."},{"name":"Uncanny Dodge","displayname":"Uncanny Dodge","previewtext":"When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."}]}}]}},{"name":"Deep Stalker Conclave","displayname":"Deep Stalker Conclave","class":"Revised Ranger","previewtext":"Strives to uncover and defeat Underdark threats before they can reach the surface.","level":{"3":[{"featuretextwithbullet":"Underdark Scout:\n   - On your first turn during combat, you gain a +10 bonus to your speed, and if you use the Attack action, you can make one additional attack.\n   - You are adept at evading creatures that rely on Darkvision.  Such creatures gain no benefit when attempting to detect you in dark and dim conditions. Additionally, when the DM determines if you can hide from a creature, that creature gains no benefit from its Darkvision."},{"featuretextwithbullet":"Deep Stalker Magic:\n- You gain Darkvision out to 90 feet. If you already have Darkvision, you increase its range by 30 feet.\n- You gain access to Deep Stalker spells. They count as Ranger spells for you, but do not count against the number of Ranger spells you know."},{"addspell":{"name":"Disguise Self","spelllevel":"1"}}],"5":[{"sharedclassfeature":{"name":"Extra Attack","class":"Ranger"}},{"addspell":{"name":"Rope Trick","spelllevel":"2"}}],"7":[{"setsaveproficiency":{"wisdom":"true"}},{"featuretextwithbullet":"Iron Mind: You gain proficiency in Wisdom Saving Throws."},{"addspell":{"name":"Glyph of Warding","spelllevel":"3"}}],"11":[{"featuretextwithbullet":"Stalker's Flurry: Once on each of your turns, when you miss with an attack, you can make another attack."},{"addspell":{"name":"Greater Invisibility","spelllevel":"4"}}],"15":[{"featuretextwithbullet":"Stalker's Dodge: Whenever a creature attacks you and does not have Advantage, you can use your reaction to impose Disadvantage on the creature's attack roll against you. You can use this feature before or after the attack roll is made, but it must be used before the outcome of the roll is determined."},{"addspell":{"name":"Seeming","spelllevel":"5"}}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[{"name":"Fighting Style","title":"Fighting Style","selections":"1","storestring":[{"name":"string_fightingstyle","text":"Fighting Style"}],"entries":[{"name":"Archery","previewtext":"You gain a +2 bonus to attack rolls you make with ranged weapons.","prerequisites":[{"not":[{"sharedclassfeatureclass":"Paladin"}]}],"hideifprerequisitesnotmet":"true","effects":[{"appendstoredstring":{"name":"string_fightingstyle","text":" - Archery: You gain a +2 bonus to attack rolls you make with ranged weapons."}},{"modifyrangedattackbonus":"2"}]},{"name":"Close Quarters Shooter","previewtext":"Being within 5 feet of a hostile creature does not impose disadvantage on your ranged attack rolls.  You ignore half and three-quarters cover inside of 30 feet. You gain a +1 bonus to ranged attack rolls.","prerequisites":[{"not":[{"sharedclassfeatureclass":""}]}],"effects":[{"appendstoredstring":{"name":"string_fightingstyle","text":" - Archery: You gain a +2 bonus to attack rolls you make with ranged weapons."}},{"modifyrangedattackbonus":"1"}]},{"name":"Defense","previewtext":"While you are wearing armor, you gain a +1 bonus to AC.","hideifprerequisitesnotmet":"true","effects":[{"appendstoredstring":{"name":"string_fightingstyle","text":" - Defense: While you are wearing armor, you gain a +1 bonus to AC."}},{"modifyarmorclassbonus":"1"}]},{"name":"Dueling","previewtext":"When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.","hideifprerequisitesnotmet":"true","effects":[{"appendstoredstring":{"name":"string_fightingstyle","text":" - Dueling: When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."}},{"modifyonehandedmeleedamagebonus":"2"}]},{"name":"Great Weapon Fighting","previewtext":"When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.","prerequisites":[{"not":[{"sharedclassfeatureclass":"Ranger"}]}],"hideifprerequisitesnotmet":"true","effects":[{"appendstoredstring":{"name":"string_fightingstyle","text":" - Great Weapon Fighting: When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit."}}]},{"name":"Mariner","displayname":"Mariner","previewtext":"While not wearing heavy armor or using a shield you gain a swim and climb speed equal to your normal speed and a +1 to AC.","effects":[{"appendstoredstring":{"name":"string_fightingstyle","text":" - Mariner: While not wearing heavy armor or using a shield you gain a swim and climb speed equal to your normal speed and a +1 to AC."}},{"setarmorclassbonus":"1"}]},{"name":"Protection","previewtext":"When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.","prerequisites":[{"not":[{"sharedclassfeatureclass":"Ranger"}]}],"hideifprerequisitesnotmet":"true","effects":[{"appendstoredstring":{"name":"string_fightingstyle","text":" - Protection: When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."}}]},{"name":"Two-Weapon Fighting","previewtext":"When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.","prerequisites":[{"not":[{"sharedclassfeatureclass":"Paladin"}]}],"hideifprerequisitesnotmet":"true","effects":[{"appendstoredstring":{"name":"string_fightingstyle","text":" - Two-Weapon Fighting: When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."}}]}],"effects":[{"featuretextwithbullet":{"getstoredstring":"string_fightingstyle"}}]}],"feats":[],"weapons":[]}
