{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Shadow","class":"Rogue","level":{"3":[{"featuretext":"Bonus Cantrips\n\n\r\nWhen you choose this archetype at 3rd level, you gain the \r\numbraturgy † cantrip and the dueling shadows † cantrip. \r\nCharisma is your spellcasting ability for these spells."},{"featuretext":"Severed Shadow\n\nStarting at 3rd level, you can separate your shadow from your \r\nbody, creating a shadowy replica of yourself and causing you to \r\nno longer cast a shadow. This replica is completely opaque and \r\nsolid, and looks like a three-dimensional silhouette of yourself. \r\n As an action, you may separate your shadow and then move it \r\nup to 30 feet as part of the same action. The shadow shares your \r\nstatistics, and can perform all movements that you would be able \r\nto, making ability checks for any movements that would normally \r\nrequire them, but it cannot take any actions. The shadow is \r\nsusceptible to saving throws and attacks, including opportunity \r\nattacks, and it shares your AC. If it takes any damage, it instantly disappears. Your separated shadow can count as an enemy of a \r\nhostile creature for the purpose of granting sneak attack.\r\n On subsequent turns while you are separated from your shadow \r\nby less than 120 feet, you may move it another 30 feet (no action \r\nrequired). As a bonus action on your turn, you may choose to \r\nteleport to the location of your shadow, reuniting yourself with it. \r\nYou can also reunite with your shadow by moving into its space.\r\n Once you teleport to your shadow, you can’t teleport to it again \r\nuntil you complete a short or long rest."}],"9":[{"featuretext":"Deceiving Darkness\n\nStarting at 9th level, you have advantage on Dexterity (Stealth) \r\nchecks if you are in dim light or darkness."}],"13":[{"featuretext":"Shadow Simulacrum\n\nAt 13th level, you gain greater control over your shadow. When \r\nyour shadow is separated from you, you can use your bonus \r\naction to have it perform the Help action, and your shadow can \r\nalso manipulate objects weighing up to 25 pounds."}],"17":[{"featuretext":"Master of Shadows\n\nWhen you reach 17th level, you have gained ultimate control over \r\nyour shadow. When you sever your shadow, you can control its \r\nmovement as long as it is within 500 feet, and you may use your \r\nbonus action to switch from using its senses to using your own, or \r\nback again. Additionally, you no longer have to complete a short \r\nor long rest before teleporting to it again."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
