{"backgrounds":[],"races":[],"subraces":[],"classes":[{"name":"Soul Binder","hitdie":"6","armorproficiencies":["Light Armor"],"weaponproficiencies":["Simple Weapons"],"toolproficiencies":["One type of musical instrument","One type of artisan's tools"],"equipment":[{"selection":[{"weapon":{"name":"Dagger","quantity":"2"}},{"weapon":{"type":"simple"}},{"weapon":{"type":"martial"}}]},{"selection":["priest pack","scholar's pack"]},{"selection":[{"armor":{"name":"Leather"}},""]}],"saveproficiencies":["constitution","charisma"],"classskills":["animal handling","arcana","history","insight","intimidation","nature","persuasion"],"skillcount":"2","spellprogression":"half","spellcastingability":"charisma","multiclass":{"abilityscoreprerequisites":[{"greaterthanorequal":{"first":"charismascore","second":"14"}}]},"level":{"1":[{"featuretext":"Soul Bond\n\nAt 1st level, you have chosen to sacrifice a piece of your own soul to gain the aid of a creature stronger than you. You can choose one of several bonds detailed at the end of the class description. Your choice grants you additional features when you reach 3rd level and again at 7th, 11th and 15th levels.\n\n"},{"featuretext":"Bonded Companion\n\nAt 1st level, you gain a companion that will serve and aid you in every way it possibly can. The companion gains bonuses from being linked to your essence. In combat, the companion moves and acts on your turn in initiative. You can command it verbally (no action needed) and if you are incapacitated, it will do its best to protect you and itself from harm.\n\nYou and your companion both become empowered from the bond you share, but only one of you can take full advantage of that power at first. If you take the Attack action or cast a spell with a casting time of one action, your companion can't take the Attack action on the same turn, and if your companion takes the Attack action, you can't take the Attack action or cast a spell with a casting time of one action on the same turn.\n\nMore details about your companion can be found in the \"Soulbound Traits\" feature.\n\nSoulbound Traits\n\nYour soulbound companion has its own hit dice, and can spend them during a short rest. At first level, its hit points are equal to the maximum value of its hit dice + its Constitution modifier. Whenever you gain a level in this class, your companion also levels up, and it can increase its hit point maximum using its hit dice as normal.\n\nWhenever you gain the Ability Score Improvement class feature in this class, your companion's abilities also improve. You can increase one of its ability scores of your choice by 2, or you can increase two of its ability scores of your choice by 1. At the DM's discretion you can forgo increasing the companion's ability scores and instead take one feat of your choice for it. As normal, you can’t increase an ability score above 20 using this feature unless its description specifies otherwise.\n\nYour companion aids you in and out of battle, as it gains bonuses for being linked to your essence. It gains proficiency in two skills of your choice. In areas where it would use its proficiency bonus, it uses your proficiency bonus instead. It also uses your proficiency bonus when calculating its AC.\n\nYour companion will always use Strength for its attack and damage rolls (unless otherwise specified), and its damage dice is shown in the companion's stat block. If a feature for your companion requires another creature to make a saving throw, the DC is equal to your Spell Save DC.\n\nIf your companion is reduced to 0 hit points, it falls unconscious and makes death saving throws. When it is reduced to 0 hit points, the soul binder will take any excess damage from the attack. If it is killed, you can return it to life as part of a long rest. The process of reviving can be very hard on your soul, gaining one level of exhaustion at the end of the rest when you revive your companion.\n\nIf you die your companion will gain 1 level of exhaustion for each minute you are dead until you are revived again or the companion dies too."},{"featuretext":"Hidden Form\n\nYou have learned how to reduce your companion's size or hide them on another plane for an easy way to hide or carry it. At 1st level you learn one of the following features:\n\nShrink. You can use your bonus action to change your companion's size to Tiny or back to its full size if it is within 30 feet of you. If there isn't enough space for it to grow to its original size, it instead takes 1d10 force damage and stays Tiny. While in Tiny form, the companion can't attack in any way.\n\nPocket Dimension. As an action, you can temporarily dismiss your companion as long as it is within 5 feet of you. It disappears into a pocket dimension where it awaits your summons. As an action, while it is dismissed, you can cause it to reappear in any unoccupied space within 5 feet of you. If you go unconscious while your companion is in its pocket dimension, it reappears within 5 feet on you.\n\nDisguise As an action you can create an illusion around your companion that makes it looks like another beast or humanoid of similar build and size, such as making a drake look like a dog, or a demon look like a farmer. The disguise end if your companion takes any damage, deals damage to another creature or you end it as an action.\n\nAt the end of a long rest you can choose to swap out your hidden form feature for a different one.\n\n"}],"2":[{"featuretext":"Edict\n\nYou have gotten better control over your companion and can give it more complicated commands. You can use a bonus action to speak a command to your companion. It must be able to hear you for the command to take effect. \nAt 2nd level, you learn the following commands:\n\nStrike. You command your companion to attack with extra ferocity. The next time your companion hits another creature with an attack this turn, that attack deals extra 2d6 damage.\n\nToughen Up. You command your companion to toughen up and be ready to withstand even more blows. Your companion gains 2d6 temporary hit points that last for 10 minutes.\n\nBlock. You command your companion to evade or block incoming attacks rather than taking them. Until the end of your next turn your companion can add your Charisma modifier to any saving throw it has to make, and add half your Charimsa modifier (rounded up) to its AC.\n\nMove. You tell your companion that it needs to move fast, or move safely. When given this command your companion can take the Disengage or Dash action as a bonus action on this turn.\n\nYou can use this feature a number of times equal to your Charisma modifier (minimum of 1), regaining all uses on a long rest.\n\nThe amount of dice for the \"Strike\" and \"Toughen Up\" edict increase as you gain levels in this class, increasing to 3d6 at 5th level, 4d6 at 11th level and 5d6 at 17th level.\n\n"}],"3":[{"featuretext":"Magic Item Absorption\n\nWhen you reach 3rd level, the soul binder can perform a special ritual to merge a magic item into its companion during a short rest. Merging with an item requires physical contact between the soul binder, the item and the companion.\n\nCertain items have prerequisites. The companion must meet any prerequisite for the item to successfully merge with it. Your companion cannot merge with items requiring a class prerequisite. If the short rest is interrupted, the merging fails. Otherwise, at the end of the short rest, the item merges into the companion.\n\nWhile merged, the companion gains an intuitive understanding of how to activate any magical properties of the item, including any necessary Command words. Your companion can use the magical properties of the item and apply the effects to its natural weapons and natural armor, but doesn't get the benefit of the armor or weapon itself. It can only have one weapon merged at a time, and one piece of armor. The companions natural weapons can only benefit from one of the merged items, and you can change this on a short rest, the same goes for its natural armor. If it absorbs a weapon, its attacks becomes magical.\n\nExample: if you bind a +1 Plate armor to your companion it gains +1 to its AC, but not the benefits of wearing Plate armor. Each merged item within the creature counts as an attunement for the soul binder, regardless if whether the item required attunement. Attempting to merge with more than three items fails automatically. The soul binder can voluntarily end the merge by spending another short rest focused on the item, unless the item is cursed.\n\nIf the companion dies, all the merges items are expelled from its corpse on the ground around it.\n\n"}],"4":[{"abilityscoreimprovement":""}],"5":[{"featuretext":"Advanced Offense\n\nBeginning at 5th level, you and your companion have improved your skill in combat and work even better together. You gain one of the following features of your choice:\n\nCompanion Extra Attack. Your companion can attack twice instead of once, whenever it takes the Attack action on its turn.\n\nExpert Commanding. There is no longer any restrictions for whenever you or your companion can take the Attack action or cast a spell with a casting time of 1 action as long as it is a soul binder spell.\n\nAt 11th level you get the other feature that you didn't pick at 5th level.\n\nSoul Linked Casting\n\nYou and your companion are of the same soul, and you can channel magic through your link.\n\nAt 5th level, when you cast a spell targeting yourself, you can choose to also have the spell affect your companion if the companion is within 60 feet of you. If you lose concentration on the spell, you both lose the effect, and you must make concentration checks also if your companion takes damage, as if you took that amount of damage.\n\n"}],"6":[{"featuretext":"Soul Infused Attacks\n\nStarting at 6th level, your companions attacks count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\nCompanion's Protection\n\nWhen you reach 6th level your companion's defense is better than ever, avoiding everything from traps to spells. It gains proficiency in all saving throws. Additionally, it has advantage on Intelligence and Charisma saving throws when you are within 100 feet of it and it can see you.\n\n"}],"7":[{"featuretext":"Project Senses\n\nBeginning at 7th level you can project your mind into your companion. As an action, you can see through your companion’s eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses that the companion has. During this time, you are deaf and blind with regard to your own senses. While you are seeing with your companion's eyes you can also choose to speak though it with your own voice being projected from its mouth.\n\n"}],"8":[{"abilityscoreimprovement":""}],"9":[{"featuretext":"Resting Voice\n\nBeginning at 9th level you now regain all uses of your edicts on a short or long rest.\n\n"}],"10":[{"featuretext":"Countermeasure\n\nAt 10th level, your companion is very protective of you and will harm anyone who seeks to hurt you. When you are targeted by an attack, your companion can take one of the following reactions:\n\nRevenge. The companion can use its reaction to make one attack against the enemy if it is within range.\n\nRoar. It uses its reaction to let out a frightful roar to impose disadvantage on the attack roll as long as the attacker is within 30 feet of it and is not deafened.\n\nBody Shield. If your companion is within 5 feet of you when the attack is made, it can use its reaction to redirect the attack to target the companion instead.\n\n"}],"12":[{"abilityscoreimprovement":""}],"14":[{"featuretext":"Soul Purification\n\nWhen you reach 14th level you can use your soul energy to flush out any negative effects currently impeding your companion.\n\nIf your companion is affected by a magical effect that allows it to make a saving throw at the start or end of its turns, or as an action, you can use your action to allow your companion to immediately attempt to make the saving throw even if it has already done so on said turn.\n\n"}],"16":[{"abilityscoreimprovement":""}],"18":[{"featuretext":"Resonating Voice\n\nAt 18th level you use your magic to command your companion with a voice that resonates with your shared soul bond.\n\nWhen you use an edict you can select another edict you know and have that affect your companion as well.\n\n"}],"20":[{"abilityscoreimprovement":""}]}}],"archetypes":[{"name":"Bond of the Elements","class":"Soul Binder","level":{"1":[{"featuretext":"Bond of the Elements\n\nYou are in balance with the world, and the elements that surround you. You are so closely bonded with them that you can manifest an elemental avatar, using part of your soul to anchor it to this plane of existence.\n\nAid of the Elements\n\nWhen you choose this bond at 1st level, the elements themselves have granted you the aid of an elemental avatar, that takes on a different shape depending on which element you are attuned to. The avatar has the appearance of your choice and uses the Elemental Avatar stat block.\n\nWhen you gain this feature you may pick one of the following elemental types to attune to: fire, cold, lightning or thunder. On your turn you can change the attuned elemental type of your avatar as an action.\n\nEach element will also give your avatar a set of unique traits and a cantrip that it can cast. The different elements are detailed in the Elements table below.\n\nElemental Avatar\n\nLarge elemental, unaligned\n\nArmor Class 11 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d10 (or 6) + its Constitution modifier per soul binder level\n\nHit Die 1d10 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA16 (+3)14 (+2)14 (+2)6 (-2)12 (+1)6 (-2)\n\nSenses darkvision 60 ft.\n\nLanguages Understands the languages of its binder, but can't speak\n\nDamage Resistance: attuned elemental damage type\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d10 + its Strength modifier damage of your current attuned type.\n\nElements\n\nElement\/damage typeTraitCantripAir\/lightningThe avatar has a flying (hover) speed equal to its walking speed.gustEarth\/ThunderThe avatar can burrow through nonmagical, unworked earth and stone. While doing so, the elemental doesn't disturb the material it moves through.mold earthFire\/fireThe avatar sheds bright light in a 30-foot radius and dim light in an additional 30-feet radius.control flamesWater\/coldThe avatar has a swimming speed equal to its walking speed, and has the Amphibious trait.shape water\n\nExpanded Spell List\n\nAs your soul becomes one with the elements and nature itself, you gain access to more spells. These spells are always prepared and don't count against the number of spells you can prepare each day. They are soul binder spells for you.\n\nElements Bond Spells\n\nSpell LevelSpells\n1st absorb elements\n2nd dragon's breath\n3rd protection from energy\n4th elemental bane\n5th conjure elemental"}],"3":[{"featuretext":"Elemental Burst\n\nAt 3rd level, your avatar has learned to harness its elemental powers with great fury. As an action, it can burst elemental force all around it.\n\nEvery creature of its choice within 10 feet of it must make a saving throw which is dependent on the element of the attack, taking 3d8 damage of your current attuned elemental type on a failed save, or half as much on a successful one. Additionally, they suffer one of the following effects, dependent on what element you are attuned to:\n\nAir. Any creature within the area must succeed on a Strength saving throw or be pushed 15 feet away from the avatar.\n\nEarth. Any creature within the area must succeed on a Strength saving throw or be knocked prone.\n\nFire. Any creature within the area must succeed on a Dexterity saving throw or get charred, imposing disadvantage on their next attack.\n\nWater. Any creature within the area must succeed on a Constitution saving throw or have their speed reduced to 0 feet, until the end of your next turn.\n\nOnce your avatar has used this feature it must finish a long rest before it can do so again.\n\nThe damage of this feature increases by 1d8 as you gain levels in this class. The damage improves to 4d8 at 7th level, 5d8 at 11th level, 6d8 at 15th level and 7d8 at 18th level.\n\n"}],"7":[{"featuretext":"Boon of Nature\n\nWhen you reach 7th level, your soul is infused with the essence of nature through your avatar. As an action, you can use this power to empower your avatar. It keeps this boon for 1 minute. The boon has a different effect depending on what element you are attuned to, and the boon will not change even if you attune to a different element while it is in effect.\n\nAir. Your avatar runs swift like lightning. Its speed becomes 90 feet, and opportunity attacks against it have disadvantage.\n\nEarth. Your avatar hardens its rocky carapace. It gains temporary hit points equal to double your Charisma modifier at the start of its turns.\n\nFire. Your avatar strikes with precision. It can add your Charisma modifier to its attack rolls.\n\nWater. Your avatar freezes enemies into place. It can attempt to grapple a creature within 5 feet of it as a bonus action. While grappled by this feature, the grappled creature is also restrained. The avatar can only have one creature grappled like this at a time.\n\nOnce you have used this feature you must finish a long rest before you can do so again.\n\n"}],"11":[{"featuretext":"Edicts of the Elements\n\nAt the 11th level, you can command your avatar to unleash their elemental powers. The following commands are added to your Edict options:\n\nElemental Bolt. You command your avatar to hurl a bolt of elemental energy. It must use its reaction to send a bolt flying in a direction of your choice, flying in a 30-feet long and 5-feet wide line.\n\nWhen it hits a creature, that creature must succeed on a Dexterity saving throw or take 4d8 damage of your current attuned type and the bolt disperses. If creature does succeed, the bolt keeps flying until it hits another creature or travels its full distance.\n\nPunch of the Avatar. Your avatar gathers elemental energy in its hand, unleashing its energy when next striking a foe. If a creature is hit by your elemental's attack until the end of this turn, it takes an additional 3d8 damage of your current attuned type and must succeed on a saving throw determined by your attuned element. On a failed save it is subjected to a negative effect. The saving throw and its effect is identical to the one in your Elemental Burst feature.\n\n"}],"15":[{"featuretext":"Merged Attunement\n\nWhen you reach 15th level, your avatar can take on a form of multiple elements, combining the strength of both. You can now attune to two elements at once. Your avatar gains resistance to both damage types associated with said elements. When your elemental attacks, it can choose between the two damage types for its attacks. It does the same for its Edict options and when it uses Elemental Burst. It gains both traits and cantrips from your attuned elements. When you use your Boon of Nature feature, it gains the effects of both elements as well.\n\nWhen you use an action to change your avatar's elements, you can choose to change both at once.\n\n"}]}},{"name":"Bond of the Playful Fey","class":"Soul Binder","level":{"1":[{"featuretext":"Bond of the Playful Fey\n\nThere are places where the barrier between the Material Plane and the Feywild is thin, and sometimes creatures from one plane end up in another. Soul binders have found that creatures from the Fey make excellent companions. Maybe you got your companion as a gift from an Archfey or maybe the two of you became friends naturally and made a bond.\n\nTrickster Spirit\n\nWhen you choose this bond at 1st level, you make a bond with a playful creature from the Feywild. The fey has the appearance of your choice and uses the Fey Companion stat block. Additionally, as your soul is bonded with the creature, you learn to speak its language. You can speak, read and write Sylvan.\n\nFey Companion\n\nMedium fey, chaotic neutral\n\nArmor Class 11 + its Dexterity modifier + your proficiency bonus\n\nHit Points 1d8 (or 5) + its Constitution modifier per soul binder level\n\nHit Die 1d8 per soul binder level\n\nSpeed 30 ft.\n\nSTRDEXCONINTWISCHA16 (+3)14 (+2)12 (+1)8 (-1)10 (+0)13 (+1)\n\nActions\n\nAttack. Melee Weapon Attack: your proficiency bonus + its Strength modifier to hit, reach 5 ft., one target. Hit: 1d10 + its Strength modifier bludgeoning, piercing or slashing damage.\n\nExpanded Spell List\n\nAs you bind with this magical creature from another plane, you are able to have more spells available to you. These spells are always prepared and don't count against the number of spells you can prepare each day. They are soul binder spells for you.\n\nPlayful Fey Bond Spells\n\nSpell LevelSpells\n1st faerie fire\n2nd enthrall\n3rd major image\n4th hallucinatory terrain\n5th dream"}],"3":[{"featuretext":"Trickster's Dance\n\nAt 3rd level, your companion has learned to use their illusory powers to confuse and play tricks on their enemies.\n\nWhenever your companion is hit with a melee weapon attack, it can use its reaction to reduce the damage of the attack by 1d8 + your Charisma modifier + your soul binder level.\n\nIf the damage is reduced to 0, your companion can force the enemy to make a Wisdom saving throw. On a failed save, the creature takes psychic damage equal to the original amount of damage their attack would have dealt.\n\nYour fey can use this feature a number of times equal to your Charisma modifier (minimum 1). It regains all expended uses when you finish a long rest.\n\n"}],"7":[{"featuretext":"Mystical Evasiveness\n\nWhen you reach 7th level, you have learned to channel the powers from the Feywild and can use that energy to form a protective veil over your companion.\n\nWhenever your companion is forced to make a saving throw due to a spell or another magical effect, you can use your reaction to give your companion advantage on the saving throw if you are within 30 feet of it.\n\n"}],"11":[{"featuretext":"Jester's Edicts\n\nAt 11th level, you can command your companion to pull playful maneuvers. The following commands are added to your Edict options:\n\nHide and Seek. You command your companion to hide itself from preying eyes. On its next turn it can use a bonus action to turn invisible until the start of its next turn. The invisibility is broken if the companion makes an attack or otherwise harms another creature.\n\nHop and Skip. You command your companion to blink in and out of the Fey, jumping to a different position. On its turn, your companion can use its bonus action to teleport up to 30 feet to a point that it can see.\n\n"}],"15":[{"featuretext":"Fooling Copycat\n\nWhen you reach 15th level, your companion resonates with you so well, that it can mimic your every move.\n\nAs a bonus action, your companion can create an illusion over itself that is identical you, including the clothes and equipment you are currently wearing. The illusion lasts for 10 minutes or until the companion ends it as a bonus action. While the illusion is active, the companion gains the following benefits:\n\nOn its turn it can cast soul switch without expending a spell slot or material components.\n\nWhile the two of you are within 5 feet of each other, you both have advantage on attack rolls, and creatures short of truesight have disadvantage on attacks against the two of you.\n\nThe companion can speak any of your languages using your voice.\n\nYou and your companion can communicate telepathically as long as you are on the same plane of existence\n\nOnce it has used this feature it must finish a short or long rest before it can do so again.\n\n"}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}