{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"SpellFist","class":"Sorcerer","level":{"1":[{"featuretext":"THE SPELLFIST SORCECER \nSpellfisters are ambitious sorceres who dont feel intimidated by their disadvantages, but, instead of that, practice a particular and very dangerous way of magical combat. Born with the innerent power of sorceres, but with no talent enough to use skills correctly, every spell you cast just hit melee foes. The Spellfist way is not for the powefull ones, but the ones who has no other option. \nLACK OF TALENT Since your birth, you cannot generate spells beyond your hands. All ranged spells you use become melee. If they have area of damage or effect, the area is generated from the target of the spell. If you miss the first target, the spell doesn't affect the others. If you hit the first target, it will hit the others. \nSPELL FIST As no master wanted to teach a non talented boy, you have learned to fight by your own, with magic and fists. Any time your spells or cantrips do damage and you have not a weapon equiped, you do a 1d4 + your Strength or Dexterity modifier as extra damage if the target is at your side. Add another 1d4 at level 5, 10, 15 and 20. \nSPELL FIST EXTRA DAMAGE Level Dices \n1 \n5 10 15 20 \n1d4 2d4 3d4 4d4 5d4 \nSENSE OF DANGER You are weak, you know it. Life is hard for a sorcerer that cannot keep distance from his enemies. You have been develop the ability to use dash, disengage and hide as bonus actions. Being hidden is this way does not give you advantage on you melee spell casting. Also, after taking many hits, you choose to start wearing light armor. "}],"6":[{"featuretext":"COMBAT MASTERY When you reach 6th level, you can choose between 2 combat styles. Focusing on casting as an Arcane Fighter or using a weapon as a extension of yourself as a Spellblade. \nARCANE FIGTHER Certainly you are not the most powerful caster, but probably the fastest. Allow you to use a spell or cantrip as an additional chain action if your first spell hit the target successfully. You may choose another target for the additonal spell. \nSPELLBLADER \nNow you are able to use a one handed melee weapon and maintain Spell fist feature. The damage of the weapon becomes magical damage and you are able to use a spell or cantrip as additional chain action if your weapon hit the enemy susscessfully. You may choose another target for the additonal spell. "}],"14":[{"featuretext":"ARCANE PROTECTION At level 14, your arcane power come not just from your hands, but your entire body. Any time a foe hits you with weapons or magic, you may spend a sorcerer point to reduce the damage to half. "}],"18":[{"featuretext":"COUNTER ATTACK At level 18 you learn how to improve your body and mind by your arcane powers. When a foe attacks you and it misses, you may react using a cantrip if the foe is at your melee range. If the attacker is out of your range, you can use your reaction to move close to him by a magic leap. Is the attacker is out of your range and you cannot see him or it is stealthed, you don't react. "}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}