{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"The Bulwark","class":"Fighter","level":{"3":[{"featuretext":"Shield Smith\nWhen you adopt this specialization at 3rd level\n, you gain\nproficiency with Mason's Tools, Smith's tools or\nWoodcarver's Tools\nRedoubt\nAt 10th level, your Guardian Point dice becomes a dó.\nand the damage of your shield increases by one step.\nbecoming a do, or a d8 when used with a free hand."},{"featuretext":"Bastion\nStarting at 3rd level, you learn to use your defensive\nmight for more than just protection, when an attack\nmisses you, you gain one Guard Point represented by a\nd4, up to a maximum equal to your 1+ your Constitution\nmodifier (minimum of 2). These points last for 1 minute\nYou can use these dice in the following manners:\n. As a reaction to taking damage, you can expend any\nnumber of Guard Points, rolling the d4s and reducing\nthe damage by an equal amount.\nWhen a creature that you can see within 30 feet of you\nmakes an attack roll, you can use your reaction to\nexpend one Guard Point, rolling the die and\nsubtracting the number rolled from the creature's roll.\n. When you make an attack with your shield, you can\nexpend any number of Guard Points, adding the\nnumber rolled to the damage you deal,\nShield Bash\nAdditionally, at 3rd level, you learn to use your shield as a\nweapon. You gain proficiency in attacks made with\nShields, they deal 104 + your Strength bludgeoning\ndamage on a hit, or 1d6 if you have you other hand free"}],"7":[{"featuretext":"Shield Throw\nBeginning at 7th level, your proficiency with the shield\nreaches new heights, you may now treat your shield as a\nthrow weapon, with a range of 20\/60. The shield always\nreturns to your hand after the attack.\nMagical Aegis\nAt 7th level, if your shield has a magical bonus, you may\nnow apply the bonus to your attack and damage rolls, and\nthe shield count as magical for the purpose of overcoming\nresistance and immunity to nonmagical attacks and\ndamage."}],"10":[{"featuretext":"Redoubt\nAt 10th level, your Guardian Point dice becomes a dó.\nand the damage of your shield increases by one step.\nbecoming a do, or a d8 when used with a free hand."}],"15":[{"featuretext":"Torce Barrier\nShield Bash damage type\nYou may use your Shield Smith tools to alter\nyour shield during a long rest, adding spikes,\nor blades, causing the damage type to\nchoose to piercing or slashing.\nWhen you reach 15th level, you can, as a bonus action,\ncreate an area of safety for your allies. lasts for 1 minute\nor until you're incapacitated. For the duration, you and\nyour allies within 30 feet of you gain the benefits of half\ncover and have advantage on Strength saving throws.\nOnce you use this feature, you can't do so again until\nyou finish a long rest or until after you use your Second\nWind feature"}],"18":[{"featuretext":"Stronghold\nAr 18th level, your mastery with the shield allows you to\nsoften even the mightiest of blows. While you are\nconscious and wielding a shield, you reduce any\nbludgeoning, piercing, slashing, force, radiant and\nthunder damage by an amount equal to your proficiency\nbonus + your Constitution modifier"}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}