{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Vampiric Bloodline","displayname":"Vampiric Bloodline","class":"Sorcerer","previewtext":"Your innate magic stems from the mingling of your bloodline with the blood of a vampire. Some sorcerers with this origin can trace their powers back to an ancient bargain with a powerful vampire. When a vampire takes particular interest in a mortal being, they may allow that humanoid to have a taste of their blood. This ritual is seldom practiced, and few vampires would ever even dare to try it. But this is not the only way to gain this origin, as many of these sorcerers can trace their powers to a near-death experience with a vampire. Whatever the case, vampiric magic permeates your blood, and your very being. Vampiric sorcerers most often try to hide their ancestry, since their origins can make them as reviled as the vampires that spawned them. However, a select few embrace their vampiric ancestry, and may even seek to become true vampires in death.","spellprogression":"full","spellcastingability":"charisma","level":{"1":[{"featuretext":"Denizen of the Night\n\nStarting when you choose this origin at 1st level, you gain darkvision out to a range of 30 feet, as described in chapter 8 of the PHB."},{"featuretext":"Martial Prowess\n\nAlso at 1st level, your vampiric ancestry grants you increased effectiveness in melee combat. Your unarmed strikes use a d6 as their damage die, and use your Charisma instead of Strength for their attack and damage rolls. Additionally, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class."}],"6":[{"featuretext":"Vampiric Regeneration\n\nAt 6th level, you gain a semblance of the regenerative abilities of a vampire. At the start of each of your turns, you gain a number of temporary hit points equal to half your Sorcerer level. The amount of temporary hit points gained is halved when you are in sunlight or running water."},{"featuretext":"Extra Attack\n\nStarting at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. Additionally, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage, and use a d8 as their damage die."}],"14":[{"featuretext":"Shapechanger\n\nStarting at 14th level, you can use your action to polymorph into a Tiny bat or back into your true form. While in bat form, you can't speak, attack, or cast spells, your walking speed is 5 feet, and you have a flying speed of 30 feet. Your statistics, other than your size and speed, are unchanged. Anything you are wearing or carrying transforms with you."}],"18":[{"featuretext":"Misty Escape\n\nAt 18th level, you gain the ability to escape from death as a cloud of mist. When you would be reduced to 0 hit points, you can use your reaction and spend 5 sorcery points to instead be reduced to 1 hit point and immediately cast gaseous form on yourself without expending a spell slot or material components."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
