{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"The Raven Queen","displayname":"Raven Queen","class":"Warlock","previewtext":"Gain access to death based spells.\nReceive a raven sentinel, granting you numerous benefits. ","level":{"1":[{"featuretextwithbullet":"Warlock Archetype: Raven Queen"},{"featuretextwithbullet":"Expanded Spell List: You may select False Life and Sanctuary as Warlock spells."},{"featuretextwithbullet":"Sentinel Raven: You gain the service of a spirit in raven form. It has the stats of a raven and always obeys your commands. You can speak to it telepathically within 100 ft.\n- If the Raven is perched on your shoulder you gain 30 ft of darkvision and you can add your Charisma mod to your Passive , and only you can cast spells on it. \n - You can see through the raven's eyes and hear what it hears while it's within 100 ft of you. \n- You roll it a separate initiative and control it in combat. If it is slain, you have advantage on attack rolls against the killer for 24 hours. \n- The raven doesn't need sleep, it can waken you as a bonus action while within 100 ft of you. It vanishes when it dies, you die, or you are separated by more than 5 miles. \n- You can call the Raven back to you at the end of a short or long rest, wherever it is, alive or dead."}],"3":[{"featuretextwithbullet":"Expanded Spell List: You may select Silence and Spiritual Weapon as Warlock spells."}],"5":[{"featuretextwithbullet":"Expanded Spell List: You may select Feign Death and Speak With Dead as Warlock spells."}],"6":[{"featuretextwithbullet":"Soul of the Raven: You gain the ability to merge with your raven as a bonus action. It must be on your shoulder to do this. While merged, you become Tiny sized, your speed is the raven's, and you can only use your action to Dash, Disengage, Dodge, Help, Hide, or Search. \nYou gain the same benefits as if the raven is on your shoulder. It takes an action to revert back. "}],"7":[{"featuretextwithbullet":"Expanded Spell List: You may select Ice Storm and Locate Creature as Warlock spells."}],"9":[{"featuretextwithbullet":"Expanded Spell List: You may select Commune and Cone of Cold as Warlock spells."}],"10":[{"featuretextwithbullet":"Raven's Shield: You have advantage in death saving throws, immunity vs the frightened condition, and resistance to necrotic damage."}],"14":[{"featuretextwithbullet":"Queen's Right Hand: You can cast Finger of Death once per long rest."},{"addspell":{"name":"Finger of Death","spelllevel":"7"}}],"all":[]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}
