{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Way of the Seirei","class":"Monk","level":{"3":[{"featuretext":"PLANAR SPIRIT\nYour training has called the attention of an extraplanar spirit\nthat helps you in combat. When you gain this feature at 3rd\nlevel, determine the spirit's appearance and a damage type\nfrom the \"Damage Types\" list (PHB, 196) associated with\nyour spirit. You determine the spirits appearance. As a bonus\naction, you can spend 2 ki points to manifest the spirit in your\nspace. The spirit is an incorporeal, magical entity and can\noccupy the same space as you. On your turn, you can\nmentally command your spirit to move up to 30ft in any\ndirection (no action required) If your spirit is ever more than\n15ft away from you at the end of your turn, it teleports back to\nyour space.\nThe spirits lasts until you take a short or long rest or you\ndismiss it as a bonus action. Your Spirit counts as magical\nfor the purposes of Dispell Magic and Anti Magic\nBarrier The Spell Level is equal to your Monk level\nrounded up (maximum of 9th level Spell)\nYou can use your spirit in the following ways:\n- Once per turn, when you luit with a melee attack\nmade with a monk weapon or an unarmed strike,\nyou can deal an extra 1d4 damage of the spirit\ntype. This damage changes as you gain monk\nlevels, as shown in the Martial Arts column of\nthe Monk table.\n- When you make a melee attack, any of your\nattacks can originate from you or your spirit.\nWhen you make an attack from the spirit, the\ndamage dealt by it is of the spirit's type.\n• When a creature that you can see within 5ft of\nyour spirit moves at least 5ft away from it, you can\nuse your reaction to make an opportunity attack against\nthat creature from your spirit.\n"},{"featuretext":"PLANAR FLURRY\nAlso at third level, when you hit a creature with one of the\nattacks granted by your flurry of blows, you can deal Planar\nSpirit's extra damage again."}],"6":[{"featuretext":"PLANAR ATTUNEMENT\nAt Gth level your connection to your spirit's nature has\ndeepened. You gain resistance to your spirit's damage type, in\naddition, when you deal your spirit's damage type, you ignore\nresistance to that damage.\nWhen you reach 17th level in this class, you also ignore\nimmunity to that damage type."}],"11":[{"featuretext":"PLANAR PROTECTOR\nAt 11th level, your spirit can protect you or your allies from\nharm. When you or a creature the spirit can see within 30ft of\nyou takes damage, you can use your reaction to send the\nspirit to their aid The target gains immunity to the triggering\ndamage and your spirit disappears."}],"17":[{"featuretext":"PLANAR EMPOWERMENT\nAt 17th level, you can funnel your ki into your spirit to give it\nextra power\nWhen you use Planar Spirit, you can spend extra ki points\nto empowerit. For every 3 extra ki points you spend the extra\ndamage from Planar Spirit increases by 1d10 (as shown in\nthe Martial Arts column on the Monk Table) to a maximum of\n9 extra ki points.\nPLANAR EMPOWERMENT CONVERTION\nAmount of extra ki amount of extra planar spirit\npoints dice\n1 extra die\n5\n2 extra dice\n3 extra dice\n11\n4 extra dice"}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}