{"backgrounds":[],"races":[],"subraces":[],"classes":[],"archetypes":[{"name":"Way of the Astral Self","class":"Monk","level":{"3":[{"featuretext":"Arms of the Astral Self\n\nAt 3rd level, your mastery of your ki allows you \r\nto summon a portion of your astral self. On your \r\nturn, you can spend 2 ki points as a bonus action \r\nto summon the arms of your astral self for 10 \r\nminutes. These spectral arms hover near your \r\nshoulders. You determine the arms’ appearance \r\nbased on the qualities of your character. \r\nWhile your astral arms are summoned, you \r\ngain the following benefits: \r\n• You can use your Wisdom modifier in place of \r\nyour Strength modifier when making Strength \r\nchecks and Strength saving throws. \r\n• The arms are monk weapons and have a reach \r\nof 10 feet. The arms deal radiant or necrotic \r\ndamage (your choice). When you attack with \r\nthe arms, you can use your Wisdom modifier \r\ninstead of your Strength or Dexterity modifier \r\nfor the attack and damage rolls. \r\n• Immediately after you use the Attack action \r\nwith your astral arms on your turn, you can \r\nmake one extra attack with your astral arms as \r\na bonus action. The number of extra attacks \r\nincreases when you reach certain levels in this \r\nclass, increasing to two at 11th level and three \r\nat 17th level."}],"6":[{"featuretext":"Visage of the Astral Self"}],"11":[{"featuretext":"Awakening of the Astral Self\n\nStarting at 11th level, you tap into the greater \r\npower of your astral self. While you have both \r\nyour astral arms and visage summoned, you gain \r\nthe following benefits. \r\nDeflect Energy. When you take acid, cold, fire, \r\nlightning, or force damage, you can use your \r\nreaction to deflect it. When you do so, the \r\ndamage you take is reduced by 1d10 + your \r\nWisdom modifier + your monk level. \r\nEmpowered Arms. Once on each of your turns \r\nwhen you hit a target with your astral arms, you \r\ncan deal extra damage to the target equal to your \r\nMartial Arts die. \r\nWord of the Spirit. When you speak through \r\nyour visage, you can direct your words to a \r\ncreature of your choice that you can see within \r\n30 feet of you, making it so only that creature \r\ncan hear you. Alternatively, you can amplify your \r\nvoice so that all creatures within 600 feet can \r\nhear you."}],"17":[{"featuretext":"Complete Astral Self\n\r\nStarting at 17th level, your connection to your \r\nastral self is complete, allowing you summon it \r\nentirely. On your turn, you can spend 10 ki \r\npoints as a bonus action to summon the arms, \r\nvisage, and body of your astral self for 10 \r\nminutes. This spectral body covers your physical \r\nform like a suit of armor, connecting with the \r\narms and visage. You determine its appearance \r\nbased on the qualities of your character. \r\nWhile your astral self is summoned, you gain \r\nthe following benefits\nArmor of the Spirit. You gain a +2 bonus to AC \r\nwhile you aren’t incapacitated. \r\nAstral Barrage. Whenever you use the Extra \r\nAttack feature to attack twice, you can instead \r\nattack three times using your astral arms. \r\nKi Consumption. When a creature within 10 \r\nfeet of you is reduced to 0 hit points, you can use \r\nyour reaction to regain ki points equal to your \r\nWisdom modifier (minimum 1)."}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[],"feats":[],"weapons":[]}